---------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/koren/Downloads/ceo-value.log
  log type:  text
 opened on:  25 Sep 2025, 13:26:12

. d

Contains data from /Users/koren/Tresorit/Mac/projects/ceo-value/temp/unfiltered.dta
 Observations:    12,411,149                  
    Variables:            47                  21 Sep 2025 13:29
                                              (_dta has notes)
---------------------------------------------------------------------------------------------------------------
Variable      Storage   Display    Value
    name         type    format    label      Variable label
---------------------------------------------------------------------------------------------------------------
frame_id_nume~c long    %12.0g                Numeric frame ID
originalid      long    %10.0g              * Given year Taxid. Minus if taxid not valid
foundyear       int     %8.0g                 Year of foundation
year            int     %9.0g                 Year
teaor08_2d      byte    %9.0g                 2 digit TEAOR08
teaor08_1d      str1    %9s                   1 digit TEAOR08 Letter
sales           double  %12.0g                Sales
export          double  %12.0g                Export
employment      long    %9.0f                 Employment
tangible_assets double  %12.0g              * Tangible assets
materials       double  %12.0g                Materials
wagebill        double  %12.0g                Wagebill
personnel_exp~s double  %12.0g                Personnel expenses
intangible_as~s double  %12.0g              * Intangible assets
state_owned     byte    %9.0g                 State owned
foreign_owned   byte    %8.0g                 Foreign owned
person_id       long    %12.0g                Person ID
male            byte    %8.0g                 Male CEO
birth_year      int     %8.0g                 Year of birth
manager_categ~y byte    %14.0g     mc         Manager category
owner           byte    %8.0g                 Non-founding owner
cf              byte    %80.0g     cf         
n_ceo           byte    %9.0g                 Number of CEOs in a year
sector          byte    %34.0g     sector     
EBITDA          float   %9.0g                 
lnR             float   %9.0g                 Sales (log)
lnEBITDA        float   %9.0g                 EBITDA (log)
lnL             float   %9.0g                 Employment (log)
lnK             float   %9.0g                 Fixed assets (log)
lnM             float   %9.0g                 Materials (log)
lnWL            float   %9.0g                 Wagebill (log)
intangible_sh~e float   %9.0g                 Intangible assets share
has_intangible  byte    %8.0g                 Has intangible assets
max_employment  float   %9.0g                 
ceo_tenure      byte    %8.0g                 CEO tenure (years)
ceo_spell       float   %9.0g                 CEO spell
max_ceo_spell   float   %9.0g                 
exit            byte    %8.0g                 
expat           float   %9.0g                 Expatriate CEO
firm_age        float   %9.0g                 Firm age (years)
ceo_age         float   %9.0g                 CEO age (years)
second_ceo      byte    %8.0g                 Second CEO
third_ceo       byte    %8.0g                 Third or later CEO
founder         byte    %8.0g                 Founding owner
ceo_age_sq      float   %9.0g                 CEO age squared
firm_age_sq     float   %9.0g                 Firm age squared
ceo_tenure_sq   float   %9.0g                 CEO tenure squared
                                            * indicated variables have notes
---------------------------------------------------------------------------------------------------------------
Sorted by: 

. tab year if !missing(birth_year )

       Year |      Freq.     Percent        Cum.
------------+-----------------------------------
       1992 |    113,258        0.95        0.95
       1993 |    141,590        1.19        2.14
       1994 |    177,729        1.50        3.64
       1995 |    198,773        1.67        5.31
       1996 |    225,095        1.89        7.21
       1997 |    248,314        2.09        9.29
       1998 |    287,526        2.42       11.71
       1999 |    297,072        2.50       14.21
       2000 |    320,154        2.69       16.91
       2001 |    346,838        2.92       19.82
       2002 |    346,463        2.91       22.74
       2003 |    350,035        2.94       25.68
       2004 |    372,356        3.13       28.82
       2005 |    382,115        3.21       32.03
       2006 |    394,360        3.32       35.35
       2007 |    403,971        3.40       38.75
       2008 |    426,433        3.59       42.33
       2009 |    439,958        3.70       46.04
       2010 |    456,523        3.84       49.88
       2011 |    471,270        3.96       53.84
       2012 |    472,754        3.98       57.82
       2013 |    509,353        4.29       62.10
       2014 |    507,912        4.27       66.38
       2015 |    506,349        4.26       70.64
       2016 |    500,458        4.21       74.85
       2017 |    491,800        4.14       78.98
       2018 |    491,793        4.14       83.12
       2019 |    489,440        4.12       87.24
       2020 |    490,830        4.13       91.37
       2021 |    500,312        4.21       95.58
       2022 |    525,802        4.42      100.00
------------+-----------------------------------
      Total | 11,886,636      100.00

. gen byte has_birth = !missing(birth_year )

. tab year has_birth 

           |       has_birth
      Year |         0          1 |     Total
-----------+----------------------+----------
      1992 |    13,177    113,258 |   126,435 
      1993 |    13,608    141,590 |   155,198 
      1994 |    14,025    177,729 |   191,754 
      1995 |    13,780    198,773 |   212,553 
      1996 |    17,283    225,095 |   242,378 
      1997 |    17,271    248,314 |   265,585 
      1998 |    12,277    287,526 |   299,803 
      1999 |    14,067    297,072 |   311,139 
      2000 |    17,821    320,154 |   337,975 
      2001 |    17,104    346,838 |   363,942 
      2002 |    16,310    346,463 |   362,773 
      2003 |    18,335    350,035 |   368,370 
      2004 |    15,997    372,356 |   388,353 
      2005 |    16,391    382,115 |   398,506 
      2006 |    14,535    394,360 |   408,895 
      2007 |    18,889    403,971 |   422,860 
      2008 |    22,926    426,433 |   449,359 
      2009 |    21,323    439,958 |   461,281 
      2010 |    22,029    456,523 |   478,552 
      2011 |    27,085    471,270 |   498,355 
      2012 |    16,698    472,754 |   489,452 
      2013 |    22,103    509,353 |   531,456 
      2014 |    13,068    507,912 |   520,980 
      2015 |    17,356    506,349 |   523,705 
      2016 |    19,172    500,458 |   519,630 
      2017 |    18,664    491,800 |   510,464 
      2018 |    19,360    491,793 |   511,153 
      2019 |    15,623    489,440 |   505,063 
      2020 |    17,532    490,830 |   508,362 
      2021 |    16,751    500,312 |   517,063 
      2022 |     3,953    525,802 |   529,755 
-----------+----------------------+----------
     Total |   524,513 11,886,636 |12,411,149 

. tab year has_birth , row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |       has_birth
      Year |         0          1 |     Total
-----------+----------------------+----------
      1992 |    13,177    113,258 |   126,435 
           |     10.42      89.58 |    100.00 
-----------+----------------------+----------
      1993 |    13,608    141,590 |   155,198 
           |      8.77      91.23 |    100.00 
-----------+----------------------+----------
      1994 |    14,025    177,729 |   191,754 
           |      7.31      92.69 |    100.00 
-----------+----------------------+----------
      1995 |    13,780    198,773 |   212,553 
           |      6.48      93.52 |    100.00 
-----------+----------------------+----------
      1996 |    17,283    225,095 |   242,378 
           |      7.13      92.87 |    100.00 
-----------+----------------------+----------
      1997 |    17,271    248,314 |   265,585 
           |      6.50      93.50 |    100.00 
-----------+----------------------+----------
      1998 |    12,277    287,526 |   299,803 
           |      4.10      95.90 |    100.00 
-----------+----------------------+----------
      1999 |    14,067    297,072 |   311,139 
           |      4.52      95.48 |    100.00 
-----------+----------------------+----------
      2000 |    17,821    320,154 |   337,975 
           |      5.27      94.73 |    100.00 
-----------+----------------------+----------
      2001 |    17,104    346,838 |   363,942 
           |      4.70      95.30 |    100.00 
-----------+----------------------+----------
      2002 |    16,310    346,463 |   362,773 
           |      4.50      95.50 |    100.00 
-----------+----------------------+----------
      2003 |    18,335    350,035 |   368,370 
           |      4.98      95.02 |    100.00 
-----------+----------------------+----------
      2004 |    15,997    372,356 |   388,353 
           |      4.12      95.88 |    100.00 
-----------+----------------------+----------
      2005 |    16,391    382,115 |   398,506 
           |      4.11      95.89 |    100.00 
-----------+----------------------+----------
      2006 |    14,535    394,360 |   408,895 
           |      3.55      96.45 |    100.00 
-----------+----------------------+----------
      2007 |    18,889    403,971 |   422,860 
           |      4.47      95.53 |    100.00 
-----------+----------------------+----------
      2008 |    22,926    426,433 |   449,359 
           |      5.10      94.90 |    100.00 
-----------+----------------------+----------
      2009 |    21,323    439,958 |   461,281 
           |      4.62      95.38 |    100.00 
-----------+----------------------+----------
      2010 |    22,029    456,523 |   478,552 
           |      4.60      95.40 |    100.00 
-----------+----------------------+----------
      2011 |    27,085    471,270 |   498,355 
           |      5.43      94.57 |    100.00 
-----------+----------------------+----------
      2012 |    16,698    472,754 |   489,452 
           |      3.41      96.59 |    100.00 
-----------+----------------------+----------
      2013 |    22,103    509,353 |   531,456 
           |      4.16      95.84 |    100.00 
-----------+----------------------+----------
      2014 |    13,068    507,912 |   520,980 
           |      2.51      97.49 |    100.00 
-----------+----------------------+----------
      2015 |    17,356    506,349 |   523,705 
           |      3.31      96.69 |    100.00 
-----------+----------------------+----------
      2016 |    19,172    500,458 |   519,630 
           |      3.69      96.31 |    100.00 
-----------+----------------------+----------
      2017 |    18,664    491,800 |   510,464 
           |      3.66      96.34 |    100.00 
-----------+----------------------+----------
      2018 |    19,360    491,793 |   511,153 
           |      3.79      96.21 |    100.00 
-----------+----------------------+----------
      2019 |    15,623    489,440 |   505,063 
           |      3.09      96.91 |    100.00 
-----------+----------------------+----------
      2020 |    17,532    490,830 |   508,362 
           |      3.45      96.55 |    100.00 
-----------+----------------------+----------
      2021 |    16,751    500,312 |   517,063 
           |      3.24      96.76 |    100.00 
-----------+----------------------+----------
      2022 |     3,953    525,802 |   529,755 
           |      0.75      99.25 |    100.00 
-----------+----------------------+----------
     Total |   524,513 11,886,636 |12,411,149 
           |      4.23      95.77 |    100.00 

. egen age
invalid syntax
r(198);

. egen age_at_start = min(ceo_age), by(person_id )
(524,513 missing values generated)

. su max_employment , d

                       max_employment
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%            1              1       Obs          12,411,149
25%            1              1       Sum of wgt.    12411149

50%            3                      Mean           22.34405
                        Largest       Std. dev.      392.5914
75%            8         100955
90%           22         100955       Variance         154128
--Break--
r(1);

. compress
  variable ceo_spell was float now byte
  variable max_ceo_spell was float now byte
  variable expat was float now byte
  variable firm_age was float now byte
  variable ceo_age was float now int
  variable ceo_age_sq was float now int
  variable firm_age_sq was float now int
  variable ceo_tenure_sq was float now int
  variable age_at_start was float now byte
  (285,456,427 bytes saved)

. d

Contains data from /Users/koren/Tresorit/Mac/projects/ceo-value/temp/unfiltered.dta
 Observations:    12,411,149                  
    Variables:            49                  21 Sep 2025 13:29
                                              (_dta has notes)
---------------------------------------------------------------------------------------------------------------
Variable      Storage   Display    Value
    name         type    format    label      Variable label
---------------------------------------------------------------------------------------------------------------
frame_id_nume~c long    %12.0g                Numeric frame ID
originalid      long    %10.0g              * Given year Taxid. Minus if taxid not valid
foundyear       int     %8.0g                 Year of foundation
year            int     %9.0g                 Year
teaor08_2d      byte    %9.0g                 2 digit TEAOR08
teaor08_1d      str1    %9s                   1 digit TEAOR08 Letter
sales           double  %12.0g                Sales
export          double  %12.0g                Export
employment      long    %9.0f                 Employment
tangible_assets double  %12.0g              * Tangible assets
materials       double  %12.0g                Materials
wagebill        double  %12.0g                Wagebill
personnel_exp~s double  %12.0g                Personnel expenses
intangible_as~s double  %12.0g              * Intangible assets
state_owned     byte    %9.0g                 State owned
foreign_owned   byte    %8.0g                 Foreign owned
person_id       long    %12.0g                Person ID
male            byte    %8.0g                 Male CEO
birth_year      int     %8.0g                 Year of birth
manager_categ~y byte    %14.0g     mc         Manager category
owner           byte    %8.0g                 Non-founding owner
cf              byte    %80.0g     cf         
n_ceo           byte    %9.0g                 Number of CEOs in a year
sector          byte    %34.0g     sector     
EBITDA          float   %9.0g                 
lnR             float   %9.0g                 Sales (log)
lnEBITDA        float   %9.0g                 EBITDA (log)
lnL             float   %9.0g                 Employment (log)
lnK             float   %9.0g                 Fixed assets (log)
lnM             float   %9.0g                 Materials (log)
lnWL            float   %9.0g                 Wagebill (log)
intangible_sh~e float   %9.0g                 Intangible assets share
has_intangible  byte    %8.0g                 Has intangible assets
max_employment  float   %9.0g                 
ceo_tenure      byte    %8.0g                 CEO tenure (years)
ceo_spell       byte    %9.0g                 CEO spell
max_ceo_spell   byte    %9.0g                 
exit            byte    %8.0g                 
expat           byte    %9.0g                 Expatriate CEO
firm_age        byte    %9.0g                 Firm age (years)
ceo_age         int     %9.0g                 CEO age (years)
second_ceo      byte    %8.0g                 Second CEO
third_ceo       byte    %8.0g                 Third or later CEO
founder         byte    %8.0g                 Founding owner
ceo_age_sq      int     %9.0g                 CEO age squared
firm_age_sq     int     %9.0g                 Firm age squared
ceo_tenure_sq   int     %9.0g                 CEO tenure squared
has_birth       byte    %8.0g                 
age_at_start    byte    %9.0g                 
                                            * indicated variables have notes
---------------------------------------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.

. egen entry_year = min(year), by(person_id )

. note: this is the unfiltered data, includes all firms, incl nonemplyers

. generate entry_decade = int(entry_year /10)*10

. tab entry_decade founder

entry_deca |    Founding owner
        de |         0          1 |     Total
-----------+----------------------+----------
      1990 | 1,949,697  4,360,339 | 6,310,036 
      2000 | 1,281,064  2,741,357 | 4,022,421 
      2010 |   838,144  1,064,289 | 1,902,433 
      2020 |    89,188     87,071 |   176,259 
-----------+----------------------+----------
     Total | 4,158,093  8,253,056 |12,411,149 

. egen pt = tag(person_id )

. tab entry_decade founder if pt

entry_deca |    Founding owner
        de |         0          1 |     Total
-----------+----------------------+----------
      1990 |   112,715    304,620 |   417,335 
      2000 |   137,894    264,949 |   402,843 
      2010 |   149,145    163,643 |   312,788 
      2020 |    43,162     48,548 |    91,710 
-----------+----------------------+----------
     Total |   442,916    781,760 | 1,224,676 

. gen u = uniform()

. gen sample = u < .1

. tab entry_decade founder if pt & sample

entry_deca |    Founding owner
        de |         0          1 |     Total
-----------+----------------------+----------
      1990 |    11,211     30,591 |    41,802 
      2000 |    13,988     26,414 |    40,402 
      2010 |    14,939     16,331 |    31,270 
      2020 |     4,409      4,770 |     9,179 
-----------+----------------------+----------
     Total |    44,547     78,106 |   122,653 

. histogram age_at_start if pt & sample, discrete
--Break--
r(1);

. tabulate age_at_start entry_decade  if pt & sample & entry_decade < 2020,

age_at_sta |           entry_decade
        rt |      1990       2000       2010 |     Total
-----------+---------------------------------+----------
       -11 |         0          1          0 |         1 
        -9 |         2          0          0 |         2 
        -7 |         1          0          0 |         1 
        -5 |         1          0          0 |         1 
        -4 |         1          0          0 |         1 
        -2 |         4          0          0 |         4 
        -1 |         1          0          0 |         1 
         0 |         5          0          3 |         8 
         1 |         2          1          0 |         3 
         2 |         3          0          0 |         3 
         3 |         9          0          1 |        10 
         4 |        12          1          1 |        14 
         5 |        10          0          0 |        10 
         6 |        10          1          0 |        11 
         7 |        14          0          1 |        15 
         8 |        12          2          0 |        14 
         9 |        15          1          0 |        16 
        10 |        25          3          1 |        29 
        11 |        19          1          0 |        20 
        12 |        25          2          0 |        27 
        13 |        25          2          1 |        28 
        14 |        29          4          0 |        33 
        15 |        31          2          2 |        35 
        16 |        41          5          0 |        46 
        17 |        36          1          2 |        39 
        18 |        70         23         32 |       125 
        19 |       138        132        201 |       471 
        20 |       193        197        250 |       640 
        21 |       264        257        303 |       824 
        22 |       325        334        386 |     1,045 
        23 |       410        482        479 |     1,371 
        24 |       474        624        526 |     1,624 
        25 |       523        755        637 |     1,915 
        26 |       568        972        728 |     2,268 
        27 |       613        981        764 |     2,358 
        28 |       631      1,043        785 |     2,459 
        29 |       624      1,043        840 |     2,507 
        30 |       582      1,136        948 |     2,666 
        31 |       598      1,075        919 |     2,592 
        32 |       591      1,076        972 |     2,639 
        33 |       613      1,011      1,017 |     2,641 
        34 |       568        941      1,075 |     2,584 
        35 |       600        842      1,086 |     2,528 
        36 |       630        856      1,055 |     2,541 
        37 |       714        774      1,048 |     2,536 
        38 |    19,634     15,455      1,431 |    36,520 
        39 |     2,762      1,067      1,000 |     4,829 
        40 |     1,764        766        933 |     3,463 
        41 |     1,014        704        923 |     2,641 
        42 |       716        565        861 |     2,142 
        43 |       718        549        904 |     2,171 
        44 |       669        540        727 |     1,936 
        45 |       583        462        806 |     1,851 
        46 |       545        495        642 |     1,682 
        47 |       478        456        607 |     1,541 
        48 |       407        470        571 |     1,448 
        49 |       368        425        501 |     1,294 
        50 |       432        414        476 |     1,322 
        51 |       279        401        424 |     1,104 
        52 |       242        347        429 |     1,018 
        53 |       201        309        410 |       920 
        54 |       165        317        401 |       883 
        55 |       171        281        390 |       842 
        56 |       112        265        391 |       768 
        57 |       103        195        361 |       659 
        58 |        60        198        352 |       610 
        59 |        65        192        352 |       609 
        60 |        55        147        320 |       522 
        61 |        44        142        276 |       462 
        62 |        34        101        300 |       435 
        63 |        15         81        268 |       364 
        64 |        24         98        275 |       397 
        65 |        13         60        253 |       326 
        66 |        16         58        235 |       309 
        67 |        20         72        177 |       269 
        68 |         9         44        168 |       221 
        69 |         8         20        151 |       179 
        70 |         6         24        152 |       182 
        71 |         5         23        101 |       129 
        72 |         1         15         81 |        97 
        73 |         0         17         88 |       105 
        74 |         0         11         76 |        87 
        75 |         0          6         65 |        71 
        76 |         1          7         66 |        74 
        77 |         0          9         51 |        60 
        78 |         0          3         41 |        44 
        79 |         1          2         31 |        34 
        80 |         0          1         37 |        38 
        81 |         0          3         22 |        25 
        82 |         0          3         15 |        18 
        83 |         0          1         16 |        17 
        84 |         0          0         16 |        16 
        85 |         0          0          9 |         9 
        86 |         0          0          9 |         9 
        87 |         0          0          7 |         7 
        88 |         0          0          3 |         3 
        89 |         0          0          1 |         1 
        90 |         0          0          2 |         2 
        91 |         0          0          2 |         2 
        93 |         0          0          1 |         1 
-----------+---------------------------------+----------
     Total |    41,802     40,402     31,270 |   113,474 

. tabulate age_at_start entry_decade  if pt & sample & entry_decade < 2020 & inrange(age_at_start, 18, 70)

age_at_sta |           entry_decade
        rt |      1990       2000       2010 |     Total
-----------+---------------------------------+----------
        18 |        70         23         32 |       125 
        19 |       138        132        201 |       471 
        20 |       193        197        250 |       640 
        21 |       264        257        303 |       824 
        22 |       325        334        386 |     1,045 
        23 |       410        482        479 |     1,371 
        24 |       474        624        526 |     1,624 
        25 |       523        755        637 |     1,915 
        26 |       568        972        728 |     2,268 
        27 |       613        981        764 |     2,358 
        28 |       631      1,043        785 |     2,459 
        29 |       624      1,043        840 |     2,507 
        30 |       582      1,136        948 |     2,666 
        31 |       598      1,075        919 |     2,592 
        32 |       591      1,076        972 |     2,639 
        33 |       613      1,011      1,017 |     2,641 
        34 |       568        941      1,075 |     2,584 
        35 |       600        842      1,086 |     2,528 
        36 |       630        856      1,055 |     2,541 
        37 |       714        774      1,048 |     2,536 
        38 |    19,634     15,455      1,431 |    36,520 
        39 |     2,762      1,067      1,000 |     4,829 
        40 |     1,764        766        933 |     3,463 
        41 |     1,014        704        923 |     2,641 
        42 |       716        565        861 |     2,142 
        43 |       718        549        904 |     2,171 
        44 |       669        540        727 |     1,936 
        45 |       583        462        806 |     1,851 
        46 |       545        495        642 |     1,682 
        47 |       478        456        607 |     1,541 
        48 |       407        470        571 |     1,448 
        49 |       368        425        501 |     1,294 
        50 |       432        414        476 |     1,322 
        51 |       279        401        424 |     1,104 
        52 |       242        347        429 |     1,018 
        53 |       201        309        410 |       920 
        54 |       165        317        401 |       883 
        55 |       171        281        390 |       842 
        56 |       112        265        391 |       768 
        57 |       103        195        361 |       659 
        58 |        60        198        352 |       610 
        59 |        65        192        352 |       609 
        60 |        55        147        320 |       522 
        61 |        44        142        276 |       462 
        62 |        34        101        300 |       435 
        63 |        15         81        268 |       364 
        64 |        24         98        275 |       397 
        65 |        13         60        253 |       326 
        66 |        16         58        235 |       309 
        67 |        20         72        177 |       269 
        68 |         9         44        168 |       221 
        69 |         8         20        151 |       179 
        70 |         6         24        152 |       182 
-----------+---------------------------------+----------
     Total |    41,461     40,274     30,518 |   112,253 

. note: i remember, ceo age is imputed based on year of entry for eaarly years

. note: 2010 onwards is hard data

. tabulate age_at_start entry_decade  if pt & sample & entry_decade >= 2010 & inrange(age_at_start, 18, 70)

age_at_sta |     entry_decade
        rt |      2010       2020 |     Total
-----------+----------------------+----------
        18 |        32         11 |        43 
        19 |       201         63 |       264 
        20 |       250         82 |       332 
        21 |       303         98 |       401 
        22 |       386         94 |       480 
        23 |       479        109 |       588 
        24 |       526        146 |       672 
        25 |       637        144 |       781 
        26 |       728        173 |       901 
        27 |       764        175 |       939 
        28 |       785        207 |       992 
        29 |       840        253 |     1,093 
        30 |       948        240 |     1,188 
        31 |       919        266 |     1,185 
        32 |       972        223 |     1,195 
        33 |     1,017        236 |     1,253 
        34 |     1,075        286 |     1,361 
        35 |     1,086        206 |     1,292 
        36 |     1,055        245 |     1,300 
        37 |     1,048        242 |     1,290 
        38 |     1,431        279 |     1,710 
        39 |     1,000        259 |     1,259 
        40 |       933        249 |     1,182 
        41 |       923        265 |     1,188 
        42 |       861        256 |     1,117 
        43 |       904        280 |     1,184 
        44 |       727        263 |       990 
        45 |       806        294 |     1,100 
        46 |       642        299 |       941 
        47 |       607        234 |       841 
        48 |       571        230 |       801 
        49 |       501        188 |       689 
        50 |       476        140 |       616 
        51 |       424        180 |       604 
        52 |       429        152 |       581 
        53 |       410        137 |       547 
        54 |       401        127 |       528 
        55 |       390        117 |       507 
        56 |       391         95 |       486 
        57 |       361        104 |       465 
        58 |       352        103 |       455 
        59 |       352         85 |       437 
        60 |       320         65 |       385 
        61 |       276         90 |       366 
        62 |       300         76 |       376 
        63 |       268         68 |       336 
        64 |       275         91 |       366 
        65 |       253         90 |       343 
        66 |       235         93 |       328 
        67 |       177         76 |       253 
        68 |       168         76 |       244 
        69 |       151         72 |       223 
        70 |       152         67 |       219 
-----------+----------------------+----------
     Total |    30,518      8,699 |    39,217 

. tabulate age_at_start entry_decade  if pt & sample & entry_decade >= 2010 & inrange(age_at_start, 18, 70), co
> l

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

age_at_sta |     entry_decade
        rt |      2010       2020 |     Total
-----------+----------------------+----------
        18 |        32         11 |        43 
           |      0.10       0.13 |      0.11 
-----------+----------------------+----------
        19 |       201         63 |       264 
           |      0.66       0.72 |      0.67 
-----------+----------------------+----------
        20 |       250         82 |       332 
           |      0.82       0.94 |      0.85 
-----------+----------------------+----------
        21 |       303         98 |       401 
           |      0.99       1.13 |      1.02 
-----------+----------------------+----------
        22 |       386         94 |       480 
           |      1.26       1.08 |      1.22 
-----------+----------------------+----------
        23 |       479        109 |       588 
           |      1.57       1.25 |      1.50 
-----------+----------------------+----------
        24 |       526        146 |       672 
           |      1.72       1.68 |      1.71 
-----------+----------------------+----------
        25 |       637        144 |       781 
           |      2.09       1.66 |      1.99 
-----------+----------------------+----------
        26 |       728        173 |       901 
           |      2.39       1.99 |      2.30 
-----------+----------------------+----------
        27 |       764        175 |       939 
           |      2.50       2.01 |      2.39 
-----------+----------------------+----------
        28 |       785        207 |       992 
           |      2.57       2.38 |      2.53 
-----------+----------------------+----------
        29 |       840        253 |     1,093 
           |      2.75       2.91 |      2.79 
-----------+----------------------+----------
        30 |       948        240 |     1,188 
           |      3.11       2.76 |      3.03 
-----------+----------------------+----------
        31 |       919        266 |     1,185 
           |      3.01       3.06 |      3.02 
-----------+----------------------+----------
        32 |       972        223 |     1,195 
           |      3.19       2.56 |      3.05 
-----------+----------------------+----------
        33 |     1,017        236 |     1,253 
           |      3.33       2.71 |      3.20 
-----------+----------------------+----------
        34 |     1,075        286 |     1,361 
           |      3.52       3.29 |      3.47 
-----------+----------------------+----------
        35 |     1,086        206 |     1,292 
           |      3.56       2.37 |      3.29 
-----------+----------------------+----------
        36 |     1,055        245 |     1,300 
           |      3.46       2.82 |      3.31 
-----------+----------------------+----------
        37 |     1,048        242 |     1,290 
           |      3.43       2.78 |      3.29 
-----------+----------------------+----------
        38 |     1,431        279 |     1,710 
           |      4.69       3.21 |      4.36 
-----------+----------------------+----------
        39 |     1,000        259 |     1,259 
           |      3.28       2.98 |      3.21 
-----------+----------------------+----------
        40 |       933        249 |     1,182 
           |      3.06       2.86 |      3.01 
-----------+----------------------+----------
        41 |       923        265 |     1,188 
           |      3.02       3.05 |      3.03 
-----------+----------------------+----------
        42 |       861        256 |     1,117 
           |      2.82       2.94 |      2.85 
-----------+----------------------+----------
        43 |       904        280 |     1,184 
           |      2.96       3.22 |      3.02 
-----------+----------------------+----------
        44 |       727        263 |       990 
           |      2.38       3.02 |      2.52 
-----------+----------------------+----------
        45 |       806        294 |     1,100 
           |      2.64       3.38 |      2.80 
-----------+----------------------+----------
        46 |       642        299 |       941 
           |      2.10       3.44 |      2.40 
-----------+----------------------+----------
        47 |       607        234 |       841 
           |      1.99       2.69 |      2.14 
-----------+----------------------+----------
        48 |       571        230 |       801 
           |      1.87       2.64 |      2.04 
-----------+----------------------+----------
        49 |       501        188 |       689 
           |      1.64       2.16 |      1.76 
-----------+----------------------+----------
        50 |       476        140 |       616 
           |      1.56       1.61 |      1.57 
-----------+----------------------+----------
        51 |       424        180 |       604 
           |      1.39       2.07 |      1.54 
-----------+----------------------+----------
        52 |       429        152 |       581 
           |      1.41       1.75 |      1.48 
-----------+----------------------+----------
        53 |       410        137 |       547 
           |      1.34       1.57 |      1.39 
-----------+----------------------+----------
        54 |       401        127 |       528 
           |      1.31       1.46 |      1.35 
-----------+----------------------+----------
        55 |       390        117 |       507 
           |      1.28       1.34 |      1.29 
-----------+----------------------+----------
        56 |       391         95 |       486 
           |      1.28       1.09 |      1.24 
-----------+----------------------+----------
        57 |       361        104 |       465 
           |      1.18       1.20 |      1.19 
-----------+----------------------+----------
        58 |       352        103 |       455 
           |      1.15       1.18 |      1.16 
-----------+----------------------+----------
        59 |       352         85 |       437 
           |      1.15       0.98 |      1.11 
-----------+----------------------+----------
        60 |       320         65 |       385 
           |      1.05       0.75 |      0.98 
-----------+----------------------+----------
        61 |       276         90 |       366 
           |      0.90       1.03 |      0.93 
-----------+----------------------+----------
        62 |       300         76 |       376 
           |      0.98       0.87 |      0.96 
-----------+----------------------+----------
        63 |       268         68 |       336 
           |      0.88       0.78 |      0.86 
-----------+----------------------+----------
        64 |       275         91 |       366 
           |      0.90       1.05 |      0.93 
-----------+----------------------+----------
        65 |       253         90 |       343 
           |      0.83       1.03 |      0.87 
-----------+----------------------+----------
        66 |       235         93 |       328 
           |      0.77       1.07 |      0.84 
-----------+----------------------+----------
        67 |       177         76 |       253 
           |      0.58       0.87 |      0.65 
-----------+----------------------+----------
        68 |       168         76 |       244 
           |      0.55       0.87 |      0.62 
-----------+----------------------+----------
        69 |       151         72 |       223 
           |      0.49       0.83 |      0.57 
-----------+----------------------+----------
        70 |       152         67 |       219 
           |      0.50       0.77 |      0.56 
-----------+----------------------+----------
     Total |    30,518      8,699 |    39,217 
           |    100.00     100.00 |    100.00 

. tabulate age_at_start if pt & sample & entry_decade == 2010 & inrange(age_at_start, 18, 70),

age_at_star |
          t |      Freq.     Percent        Cum.
------------+-----------------------------------
         18 |         32        0.10        0.10
         19 |        201        0.66        0.76
         20 |        250        0.82        1.58
         21 |        303        0.99        2.58
         22 |        386        1.26        3.84
         23 |        479        1.57        5.41
         24 |        526        1.72        7.13
         25 |        637        2.09        9.22
         26 |        728        2.39       11.61
         27 |        764        2.50       14.11
         28 |        785        2.57       16.68
         29 |        840        2.75       19.43
         30 |        948        3.11       22.54
         31 |        919        3.01       25.55
         32 |        972        3.19       28.74
         33 |      1,017        3.33       32.07
         34 |      1,075        3.52       35.59
         35 |      1,086        3.56       39.15
         36 |      1,055        3.46       42.61
         37 |      1,048        3.43       46.04
         38 |      1,431        4.69       50.73
         39 |      1,000        3.28       54.01
         40 |        933        3.06       57.06
         41 |        923        3.02       60.09
         42 |        861        2.82       62.91
         43 |        904        2.96       65.87
         44 |        727        2.38       68.25
         45 |        806        2.64       70.90
         46 |        642        2.10       73.00
         47 |        607        1.99       74.99
         48 |        571        1.87       76.86
         49 |        501        1.64       78.50
         50 |        476        1.56       80.06
         51 |        424        1.39       81.45
         52 |        429        1.41       82.86
         53 |        410        1.34       84.20
         54 |        401        1.31       85.51
         55 |        390        1.28       86.79
         56 |        391        1.28       88.07
         57 |        361        1.18       89.26
         58 |        352        1.15       90.41
         59 |        352        1.15       91.56
         60 |        320        1.05       92.61
         61 |        276        0.90       93.52
         62 |        300        0.98       94.50
         63 |        268        0.88       95.38
         64 |        275        0.90       96.28
         65 |        253        0.83       97.11
         66 |        235        0.77       97.88
         67 |        177        0.58       98.46
         68 |        168        0.55       99.01
         69 |        151        0.49       99.50
         70 |        152        0.50      100.00
------------+-----------------------------------
      Total |     30,518      100.00

. note: iqr is 31 - 47

. tabulate age_at_start if pt & sample & entry_decade == 2020 & inrange(age_at_start, 18, 70),

age_at_star |
          t |      Freq.     Percent        Cum.
------------+-----------------------------------
         18 |         11        0.13        0.13
         19 |         63        0.72        0.85
         20 |         82        0.94        1.79
         21 |         98        1.13        2.92
         22 |         94        1.08        4.00
         23 |        109        1.25        5.25
         24 |        146        1.68        6.93
         25 |        144        1.66        8.59
         26 |        173        1.99       10.58
         27 |        175        2.01       12.59
         28 |        207        2.38       14.97
         29 |        253        2.91       17.88
         30 |        240        2.76       20.63
         31 |        266        3.06       23.69
         32 |        223        2.56       26.26
         33 |        236        2.71       28.97
         34 |        286        3.29       32.26
         35 |        206        2.37       34.62
         36 |        245        2.82       37.44
         37 |        242        2.78       40.22
         38 |        279        3.21       43.43
         39 |        259        2.98       46.41
         40 |        249        2.86       49.27
         41 |        265        3.05       52.32
         42 |        256        2.94       55.26
         43 |        280        3.22       58.48
         44 |        263        3.02       61.50
         45 |        294        3.38       64.88
         46 |        299        3.44       68.32
         47 |        234        2.69       71.01
         48 |        230        2.64       73.65
         49 |        188        2.16       75.81
         50 |        140        1.61       77.42
         51 |        180        2.07       79.49
         52 |        152        1.75       81.24
         53 |        137        1.57       82.81
         54 |        127        1.46       84.27
         55 |        117        1.34       85.62
         56 |         95        1.09       86.71
         57 |        104        1.20       87.91
         58 |        103        1.18       89.09
         59 |         85        0.98       90.07
         60 |         65        0.75       90.82
         61 |         90        1.03       91.85
         62 |         76        0.87       92.72
         63 |         68        0.78       93.51
         64 |         91        1.05       94.55
         65 |         90        1.03       95.59
         66 |         93        1.07       96.65
         67 |         76        0.87       97.53
         68 |         76        0.87       98.40
         69 |         72        0.83       99.23
         70 |         67        0.77      100.00
------------+-----------------------------------
      Total |      8,699      100.00

. note: iqr is 31 - 49, very similar

. tabulate age_at_start founder if pt & sample & entry_decade == 2020 & inrange(age_at_start, 18, 70), col

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

age_at_sta |    Founding owner
        rt |         0          1 |     Total
-----------+----------------------+----------
        18 |         7          4 |        11 
           |      0.17       0.09 |      0.13 
-----------+----------------------+----------
        19 |        45         18 |        63 
           |      1.12       0.39 |      0.72 
-----------+----------------------+----------
        20 |        38         44 |        82 
           |      0.94       0.94 |      0.94 
-----------+----------------------+----------
        21 |        46         52 |        98 
           |      1.14       1.11 |      1.13 
-----------+----------------------+----------
        22 |        37         57 |        94 
           |      0.92       1.22 |      1.08 
-----------+----------------------+----------
        23 |        44         65 |       109 
           |      1.09       1.39 |      1.25 
-----------+----------------------+----------
        24 |        60         86 |       146 
           |      1.49       1.84 |      1.68 
-----------+----------------------+----------
        25 |        61         83 |       144 
           |      1.51       1.78 |      1.66 
-----------+----------------------+----------
        26 |        58        115 |       173 
           |      1.44       2.46 |      1.99 
-----------+----------------------+----------
        27 |        59        116 |       175 
           |      1.46       2.49 |      2.01 
-----------+----------------------+----------
        28 |        88        119 |       207 
           |      2.18       2.55 |      2.38 
-----------+----------------------+----------
        29 |        93        160 |       253 
           |      2.31       3.43 |      2.91 
-----------+----------------------+----------
        30 |        86        154 |       240 
           |      2.13       3.30 |      2.76 
-----------+----------------------+----------
        31 |        97        169 |       266 
           |      2.41       3.62 |      3.06 
-----------+----------------------+----------
        32 |        98        125 |       223 
           |      2.43       2.68 |      2.56 
-----------+----------------------+----------
        33 |        92        144 |       236 
           |      2.28       3.09 |      2.71 
-----------+----------------------+----------
        34 |       122        164 |       286 
           |      3.03       3.51 |      3.29 
-----------+----------------------+----------
        35 |        83        123 |       206 
           |      2.06       2.64 |      2.37 
-----------+----------------------+----------
        36 |        90        155 |       245 
           |      2.23       3.32 |      2.82 
-----------+----------------------+----------
        37 |        95        147 |       242 
           |      2.36       3.15 |      2.78 
-----------+----------------------+----------
        38 |       125        154 |       279 
           |      3.10       3.30 |      3.21 
-----------+----------------------+----------
        39 |       117        142 |       259 
           |      2.90       3.04 |      2.98 
-----------+----------------------+----------
        40 |       104        145 |       249 
           |      2.58       3.11 |      2.86 
-----------+----------------------+----------
        41 |       117        148 |       265 
           |      2.90       3.17 |      3.05 
-----------+----------------------+----------
        42 |       108        148 |       256 
           |      2.68       3.17 |      2.94 
-----------+----------------------+----------
        43 |       129        151 |       280 
           |      3.20       3.24 |      3.22 
-----------+----------------------+----------
        44 |       107        156 |       263 
           |      2.65       3.34 |      3.02 
-----------+----------------------+----------
        45 |       111        183 |       294 
           |      2.75       3.92 |      3.38 
-----------+----------------------+----------
        46 |       131        168 |       299 
           |      3.25       3.60 |      3.44 
-----------+----------------------+----------
        47 |       107        127 |       234 
           |      2.65       2.72 |      2.69 
-----------+----------------------+----------
        48 |       110        120 |       230 
           |      2.73       2.57 |      2.64 
-----------+----------------------+----------
        49 |        87        101 |       188 
           |      2.16       2.16 |      2.16 
-----------+----------------------+----------
        50 |        79         61 |       140 
           |      1.96       1.31 |      1.61 
-----------+----------------------+----------
        51 |        96         84 |       180 
           |      2.38       1.80 |      2.07 
-----------+----------------------+----------
        52 |        86         66 |       152 
           |      2.13       1.41 |      1.75 
-----------+----------------------+----------
        53 |        69         68 |       137 
           |      1.71       1.46 |      1.57 
-----------+----------------------+----------
        54 |        66         61 |       127 
           |      1.64       1.31 |      1.46 
-----------+----------------------+----------
        55 |        69         48 |       117 
           |      1.71       1.03 |      1.34 
-----------+----------------------+----------
        56 |        57         38 |        95 
           |      1.41       0.81 |      1.09 
-----------+----------------------+----------
        57 |        55         49 |       104 
           |      1.36       1.05 |      1.20 
-----------+----------------------+----------
        58 |        66         37 |       103 
           |      1.64       0.79 |      1.18 
-----------+----------------------+----------
        59 |        47         38 |        85 
           |      1.17       0.81 |      0.98 
-----------+----------------------+----------
        60 |        44         21 |        65 
           |      1.09       0.45 |      0.75 
-----------+----------------------+----------
        61 |        47         43 |        90 
           |      1.17       0.92 |      1.03 
-----------+----------------------+----------
        62 |        53         23 |        76 
           |      1.31       0.49 |      0.87 
-----------+----------------------+----------
        63 |        45         23 |        68 
           |      1.12       0.49 |      0.78 
-----------+----------------------+----------
        64 |        63         28 |        91 
           |      1.56       0.60 |      1.05 
-----------+----------------------+----------
        65 |        62         28 |        90 
           |      1.54       0.60 |      1.03 
-----------+----------------------+----------
        66 |        60         33 |        93 
           |      1.49       0.71 |      1.07 
-----------+----------------------+----------
        67 |        54         22 |        76 
           |      1.34       0.47 |      0.87 
-----------+----------------------+----------
        68 |        55         21 |        76 
           |      1.36       0.45 |      0.87 
-----------+----------------------+----------
        69 |        57         15 |        72 
           |      1.41       0.32 |      0.83 
-----------+----------------------+----------
        70 |        50         17 |        67 
           |      1.24       0.36 |      0.77 
-----------+----------------------+----------
     Total |     4,032      4,667 |     8,699 
           |    100.00     100.00 |    100.00 

. tabulate age_at_start founder if pt & sample & entry_decade == 2020 & inrange(age_at_start, 30, 50), col

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

age_at_sta |    Founding owner
        rt |         0          1 |     Total
-----------+----------------------+----------
        30 |        86        154 |       240 
           |      3.92       5.16 |      4.63 
-----------+----------------------+----------
        31 |        97        169 |       266 
           |      4.42       5.66 |      5.14 
-----------+----------------------+----------
        32 |        98        125 |       223 
           |      4.46       4.19 |      4.31 
-----------+----------------------+----------
        33 |        92        144 |       236 
           |      4.19       4.82 |      4.56 
-----------+----------------------+----------
        34 |       122        164 |       286 
           |      5.56       5.49 |      5.52 
-----------+----------------------+----------
        35 |        83        123 |       206 
           |      3.78       4.12 |      3.98 
-----------+----------------------+----------
        36 |        90        155 |       245 
           |      4.10       5.19 |      4.73 
-----------+----------------------+----------
        37 |        95        147 |       242 
           |      4.33       4.92 |      4.67 
-----------+----------------------+----------
        38 |       125        154 |       279 
           |      5.69       5.16 |      5.39 
-----------+----------------------+----------
        39 |       117        142 |       259 
           |      5.33       4.76 |      5.00 
-----------+----------------------+----------
        40 |       104        145 |       249 
           |      4.74       4.86 |      4.81 
-----------+----------------------+----------
        41 |       117        148 |       265 
           |      5.33       4.96 |      5.12 
-----------+----------------------+----------
        42 |       108        148 |       256 
           |      4.92       4.96 |      4.94 
-----------+----------------------+----------
        43 |       129        151 |       280 
           |      5.88       5.06 |      5.41 
-----------+----------------------+----------
        44 |       107        156 |       263 
           |      4.87       5.23 |      5.08 
-----------+----------------------+----------
        45 |       111        183 |       294 
           |      5.06       6.13 |      5.68 
-----------+----------------------+----------
        46 |       131        168 |       299 
           |      5.97       5.63 |      5.77 
-----------+----------------------+----------
        47 |       107        127 |       234 
           |      4.87       4.25 |      4.52 
-----------+----------------------+----------
        48 |       110        120 |       230 
           |      5.01       4.02 |      4.44 
-----------+----------------------+----------
        49 |        87        101 |       188 
           |      3.96       3.38 |      3.63 
-----------+----------------------+----------
        50 |        79         61 |       140 
           |      3.60       2.04 |      2.70 
-----------+----------------------+----------
     Total |     2,195      2,985 |     5,180 
           |    100.00     100.00 |    100.00 

. tabulate age_at_start if pt & sample & entry_decade == 2020 & inrange(age_at_start, 18, 70) & founder

age_at_star |
          t |      Freq.     Percent        Cum.
------------+-----------------------------------
         18 |          4        0.09        0.09
         19 |         18        0.39        0.47
         20 |         44        0.94        1.41
         21 |         52        1.11        2.53
         22 |         57        1.22        3.75
         23 |         65        1.39        5.14
         24 |         86        1.84        6.99
         25 |         83        1.78        8.76
         26 |        115        2.46       11.23
         27 |        116        2.49       13.71
         28 |        119        2.55       16.26
         29 |        160        3.43       19.69
         30 |        154        3.30       22.99
         31 |        169        3.62       26.61
         32 |        125        2.68       29.29
         33 |        144        3.09       32.38
         34 |        164        3.51       35.89
         35 |        123        2.64       38.53
         36 |        155        3.32       41.85
         37 |        147        3.15       45.00
         38 |        154        3.30       48.30
         39 |        142        3.04       51.34
         40 |        145        3.11       54.45
         41 |        148        3.17       57.62
         42 |        148        3.17       60.79
         43 |        151        3.24       64.02
         44 |        156        3.34       67.37
         45 |        183        3.92       71.29
         46 |        168        3.60       74.89
         47 |        127        2.72       77.61
         48 |        120        2.57       80.18
         49 |        101        2.16       82.34
         50 |         61        1.31       83.65
         51 |         84        1.80       85.45
         52 |         66        1.41       86.87
         53 |         68        1.46       88.32
         54 |         61        1.31       89.63
         55 |         48        1.03       90.66
         56 |         38        0.81       91.47
         57 |         49        1.05       92.52
         58 |         37        0.79       93.31
         59 |         38        0.81       94.13
         60 |         21        0.45       94.58
         61 |         43        0.92       95.50
         62 |         23        0.49       95.99
         63 |         23        0.49       96.49
         64 |         28        0.60       97.09
         65 |         28        0.60       97.69
         66 |         33        0.71       98.39
         67 |         22        0.47       98.86
         68 |         21        0.45       99.31
         69 |         15        0.32       99.64
         70 |         17        0.36      100.00
------------+-----------------------------------
      Total |      4,667      100.00

. tabulate age_at_start if pt & sample & entry_decade == 2020 & inrange(age_at_start, 18, 70) & !founder

age_at_star |
          t |      Freq.     Percent        Cum.
------------+-----------------------------------
         18 |          7        0.17        0.17
         19 |         45        1.12        1.29
         20 |         38        0.94        2.23
         21 |         46        1.14        3.37
         22 |         37        0.92        4.29
         23 |         44        1.09        5.38
         24 |         60        1.49        6.87
         25 |         61        1.51        8.38
         26 |         58        1.44        9.82
         27 |         59        1.46       11.28
         28 |         88        2.18       13.47
         29 |         93        2.31       15.77
         30 |         86        2.13       17.91
         31 |         97        2.41       20.31
         32 |         98        2.43       22.74
         33 |         92        2.28       25.02
         34 |        122        3.03       28.05
         35 |         83        2.06       30.11
         36 |         90        2.23       32.34
         37 |         95        2.36       34.70
         38 |        125        3.10       37.80
         39 |        117        2.90       40.70
         40 |        104        2.58       43.28
         41 |        117        2.90       46.18
         42 |        108        2.68       48.86
         43 |        129        3.20       52.06
         44 |        107        2.65       54.71
         45 |        111        2.75       57.47
         46 |        131        3.25       60.71
         47 |        107        2.65       63.37
         48 |        110        2.73       66.10
         49 |         87        2.16       68.25
         50 |         79        1.96       70.21
         51 |         96        2.38       72.59
         52 |         86        2.13       74.73
         53 |         69        1.71       76.44
         54 |         66        1.64       78.08
         55 |         69        1.71       79.79
         56 |         57        1.41       81.20
         57 |         55        1.36       82.56
         58 |         66        1.64       84.20
         59 |         47        1.17       85.37
         60 |         44        1.09       86.46
         61 |         47        1.17       87.62
         62 |         53        1.31       88.94
         63 |         45        1.12       90.05
         64 |         63        1.56       91.62
         65 |         62        1.54       93.15
         66 |         60        1.49       94.64
         67 |         54        1.34       95.98
         68 |         55        1.36       97.35
         69 |         57        1.41       98.76
         70 |         50        1.24      100.00
------------+-----------------------------------
      Total |      4,032      100.00

. note: nonfounder iqr is 33/53

. tabulate age_at_start if pt & sample & entry_decade == 2010 & inrange(age_at_start, 18, 70) & founder

age_at_star |
          t |      Freq.     Percent        Cum.
------------+-----------------------------------
         18 |         15        0.09        0.09
         19 |         92        0.57        0.66
         20 |        137        0.85        1.52
         21 |        146        0.91        2.42
         22 |        202        1.26        3.68
         23 |        263        1.63        5.31
         24 |        284        1.76        7.08
         25 |        353        2.19        9.27
         26 |        443        2.75       12.02
         27 |        451        2.80       14.82
         28 |        453        2.81       17.64
         29 |        482        2.99       20.63
         30 |        557        3.46       24.09
         31 |        525        3.26       27.36
         32 |        550        3.42       30.77
         33 |        599        3.72       34.50
         34 |        642        3.99       38.48
         35 |        630        3.91       42.40
         36 |        599        3.72       46.12
         37 |        592        3.68       49.80
         38 |        716        4.45       54.25
         39 |        561        3.49       57.73
         40 |        492        3.06       60.79
         41 |        491        3.05       63.84
         42 |        453        2.81       66.65
         43 |        478        2.97       69.62
         44 |        370        2.30       71.92
         45 |        417        2.59       74.51
         46 |        316        1.96       76.48
         47 |        325        2.02       78.50
         48 |        272        1.69       80.19
         49 |        239        1.48       81.67
         50 |        243        1.51       83.18
         51 |        195        1.21       84.39
         52 |        195        1.21       85.60
         53 |        209        1.30       86.90
         54 |        206        1.28       88.18
         55 |        198        1.23       89.41
         56 |        184        1.14       90.56
         57 |        161        1.00       91.56
         58 |        157        0.98       92.53
         59 |        151        0.94       93.47
         60 |        146        0.91       94.38
         61 |        120        0.75       95.12
         62 |        132        0.82       95.94
         63 |        127        0.79       96.73
         64 |        103        0.64       97.37
         65 |         98        0.61       97.98
         66 |         99        0.62       98.60
         67 |         58        0.36       98.96
         68 |         55        0.34       99.30
         69 |         61        0.38       99.68
         70 |         52        0.32      100.00
------------+-----------------------------------
      Total |     16,095      100.00

. tabulate age_at_start if pt & sample & entry_decade == 2010 & inrange(age_at_start, 18, 70) & !founder

age_at_star |
          t |      Freq.     Percent        Cum.
------------+-----------------------------------
         18 |         17        0.12        0.12
         19 |        109        0.76        0.87
         20 |        113        0.78        1.66
         21 |        157        1.09        2.75
         22 |        184        1.28        4.02
         23 |        216        1.50        5.52
         24 |        242        1.68        7.20
         25 |        284        1.97        9.17
         26 |        285        1.98       11.14
         27 |        313        2.17       13.31
         28 |        332        2.30       15.61
         29 |        358        2.48       18.10
         30 |        391        2.71       20.81
         31 |        394        2.73       23.54
         32 |        422        2.93       26.46
         33 |        418        2.90       29.36
         34 |        433        3.00       32.36
         35 |        456        3.16       35.53
         36 |        456        3.16       38.69
         37 |        456        3.16       41.85
         38 |        715        4.96       46.81
         39 |        439        3.04       49.85
         40 |        441        3.06       52.91
         41 |        432        3.00       55.90
         42 |        408        2.83       58.73
         43 |        426        2.95       61.69
         44 |        357        2.48       64.16
         45 |        389        2.70       66.86
         46 |        326        2.26       69.12
         47 |        282        1.96       71.07
         48 |        299        2.07       73.15
         49 |        262        1.82       74.96
         50 |        233        1.62       76.58
         51 |        229        1.59       78.17
         52 |        234        1.62       79.79
         53 |        201        1.39       81.18
         54 |        195        1.35       82.53
         55 |        192        1.33       83.87
         56 |        207        1.44       85.30
         57 |        200        1.39       86.69
         58 |        195        1.35       88.04
         59 |        201        1.39       89.43
         60 |        174        1.21       90.64
         61 |        156        1.08       91.72
         62 |        168        1.16       92.89
         63 |        141        0.98       93.86
         64 |        172        1.19       95.06
         65 |        155        1.07       96.13
         66 |        136        0.94       97.07
         67 |        119        0.83       97.90
         68 |        113        0.78       98.68
         69 |         90        0.62       99.31
         70 |        100        0.69      100.00
------------+-----------------------------------
      Total |     14,423      100.00

. tabulate age_at_start if pt & sample & inrange(entry_decade, 2010, 2020) & inrange(age_at_start, 18, 70) & !f
> ounder

age_at_star |
          t |      Freq.     Percent        Cum.
------------+-----------------------------------
         18 |         24        0.13        0.13
         19 |        154        0.83        0.96
         20 |        151        0.82        1.78
         21 |        203        1.10        2.88
         22 |        221        1.20        4.08
         23 |        260        1.41        5.49
         24 |        302        1.64        7.13
         25 |        345        1.87        8.99
         26 |        343        1.86       10.85
         27 |        372        2.02       12.87
         28 |        420        2.28       15.14
         29 |        451        2.44       17.59
         30 |        477        2.58       20.17
         31 |        491        2.66       22.83
         32 |        520        2.82       25.65
         33 |        510        2.76       28.42
         34 |        555        3.01       31.42
         35 |        539        2.92       34.34
         36 |        546        2.96       37.30
         37 |        551        2.99       40.29
         38 |        840        4.55       44.84
         39 |        556        3.01       47.85
         40 |        545        2.95       50.80
         41 |        549        2.97       53.78
         42 |        516        2.80       56.58
         43 |        555        3.01       59.58
         44 |        464        2.51       62.10
         45 |        500        2.71       64.81
         46 |        457        2.48       67.28
         47 |        389        2.11       69.39
         48 |        409        2.22       71.61
         49 |        349        1.89       73.50
         50 |        312        1.69       75.19
         51 |        325        1.76       76.95
         52 |        320        1.73       78.68
         53 |        270        1.46       80.15
         54 |        261        1.41       81.56
         55 |        261        1.41       82.97
         56 |        264        1.43       84.41
         57 |        255        1.38       85.79
         58 |        261        1.41       87.20
         59 |        248        1.34       88.55
         60 |        218        1.18       89.73
         61 |        203        1.10       90.83
         62 |        221        1.20       92.02
         63 |        186        1.01       93.03
         64 |        235        1.27       94.31
         65 |        217        1.18       95.48
         66 |        196        1.06       96.54
         67 |        173        0.94       97.48
         68 |        168        0.91       98.39
         69 |        147        0.80       99.19
         70 |        150        0.81      100.00
------------+-----------------------------------
      Total |     18,455      100.00

. tabulate age_at_start if pt & sample & inrange(entry_decade, 2010, 2020) & inrange(age_at_start, 18, 70) & fo
> under

age_at_star |
          t |      Freq.     Percent        Cum.
------------+-----------------------------------
         18 |         19        0.09        0.09
         19 |        110        0.53        0.62
         20 |        181        0.87        1.49
         21 |        198        0.95        2.45
         22 |        259        1.25        3.69
         23 |        328        1.58        5.27
         24 |        370        1.78        7.06
         25 |        436        2.10        9.16
         26 |        558        2.69       11.84
         27 |        567        2.73       14.57
         28 |        572        2.76       17.33
         29 |        642        3.09       20.42
         30 |        711        3.42       23.85
         31 |        694        3.34       27.19
         32 |        675        3.25       30.44
         33 |        743        3.58       34.02
         34 |        806        3.88       37.90
         35 |        753        3.63       41.53
         36 |        754        3.63       45.16
         37 |        739        3.56       48.72
         38 |        870        4.19       52.91
         39 |        703        3.39       56.30
         40 |        637        3.07       59.36
         41 |        639        3.08       62.44
         42 |        601        2.89       65.34
         43 |        629        3.03       68.37
         44 |        526        2.53       70.90
         45 |        600        2.89       73.79
         46 |        484        2.33       76.12
         47 |        452        2.18       78.30
         48 |        392        1.89       80.18
         49 |        340        1.64       81.82
         50 |        304        1.46       83.29
         51 |        279        1.34       84.63
         52 |        261        1.26       85.89
         53 |        277        1.33       87.22
         54 |        267        1.29       88.51
         55 |        246        1.18       89.69
         56 |        222        1.07       90.76
         57 |        210        1.01       91.77
         58 |        194        0.93       92.71
         59 |        189        0.91       93.62
         60 |        167        0.80       94.42
         61 |        163        0.79       95.21
         62 |        155        0.75       95.95
         63 |        150        0.72       96.68
         64 |        131        0.63       97.31
         65 |        126        0.61       97.91
         66 |        132        0.64       98.55
         67 |         80        0.39       98.94
         68 |         76        0.37       99.30
         69 |         76        0.37       99.67
         70 |         69        0.33      100.00
------------+-----------------------------------
      Total |     20,762      100.00

. note: age freq > 2% for nonfounders, 27-48 for founders, 25-47

. gen byte age25_45 = inrange(age_at_start, 25, 45)

. table entry_decade founder if pt & sample, stat(mean age25_45 )

----------------------------------------------
             |          Founding owner        
             |         0          1      Total
-------------+--------------------------------
entry_decade |                                
  1990       |  .8326643   .8623451    .854385
  2000       |  .7839577   .8195275   .8072125
  2010       |  .5760091   .6646256   .6222897
  2020       |    .46269   .6291405   .5491884
  Total      |   .694682   .7922823   .7568343
----------------------------------------------

. tabulate founder age25_45 if pt & entry_decade >= 2010

  Founding |       age25_45
     owner |         0          1 |     Total
-----------+----------------------+----------
         0 |    86,278    106,029 |   192,307 
         1 |    73,014    139,177 |   212,191 
-----------+----------------------+----------
     Total |   159,292    245,206 |   404,498 

. tabulate founder age25_45 if pt & entry_decade >= 2010, row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

  Founding |       age25_45
     owner |         0          1 |     Total
-----------+----------------------+----------
         0 |    86,278    106,029 |   192,307 
           |     44.86      55.14 |    100.00 
-----------+----------------------+----------
         1 |    73,014    139,177 |   212,191 
           |     34.41      65.59 |    100.00 
-----------+----------------------+----------
     Total |   159,292    245,206 |   404,498 
           |     39.38      60.62 |    100.00 

. gen byte age30_50 = inrange(age_at_start, 30, 50)

. tabulate founder age30_50  if pt & entry_decade >= 2010, row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

  Founding |       age30_50
     owner |         0          1 |     Total
-----------+----------------------+----------
         0 |    87,193    105,114 |   192,307 
           |     45.34      54.66 |    100.00 
-----------+----------------------+----------
         1 |    81,092    131,099 |   212,191 
           |     38.22      61.78 |    100.00 
-----------+----------------------+----------
     Total |   168,285    236,213 |   404,498 
           |     41.60      58.40 |    100.00 

. tabulate age_at_start if inrange(age_at_start, 18, 65) & pt & entry_decade >= 2010 & !founder

age_at_star |
          t |      Freq.     Percent        Cum.
------------+-----------------------------------
         18 |        260        0.15        0.15
         19 |      1,502        0.86        1.00
         20 |      1,758        1.00        2.01
         21 |      2,178        1.24        3.25
         22 |      2,434        1.39        4.64
         23 |      2,661        1.52        6.16
         24 |      3,048        1.74        7.89
         25 |      3,273        1.87        9.76
         26 |      3,725        2.12       11.88
         27 |      3,903        2.23       14.11
         28 |      4,204        2.40       16.51
         29 |      4,475        2.55       19.06
         30 |      4,703        2.68       21.74
         31 |      4,870        2.78       24.52
         32 |      5,172        2.95       27.47
         33 |      5,189        2.96       30.43
         34 |      5,329        3.04       33.47
         35 |      5,560        3.17       36.64
         36 |      5,636        3.21       39.85
         37 |      5,630        3.21       43.06
         38 |      8,600        4.90       47.97
         39 |      5,576        3.18       51.15
         40 |      5,506        3.14       54.29
         41 |      5,320        3.03       57.32
         42 |      5,190        2.96       60.28
         43 |      5,019        2.86       63.14
         44 |      4,666        2.66       65.80
         45 |      4,483        2.56       68.36
         46 |      4,326        2.47       70.83
         47 |      3,891        2.22       73.05
         48 |      3,706        2.11       75.16
         49 |      3,485        1.99       77.15
         50 |      3,257        1.86       79.01
         51 |      3,081        1.76       80.76
         52 |      3,002        1.71       82.47
         53 |      2,825        1.61       84.09
         54 |      2,710        1.55       85.63
         55 |      2,587        1.48       87.11
         56 |      2,592        1.48       88.58
         57 |      2,596        1.48       90.06
         58 |      2,508        1.43       91.50
         59 |      2,395        1.37       92.86
         60 |      2,166        1.24       94.10
         61 |      2,077        1.18       95.28
         62 |      2,074        1.18       96.46
         63 |      2,053        1.17       97.63
         64 |      2,157        1.23       98.86
         65 |      1,991        1.14      100.00
------------+-----------------------------------
      Total |    175,349      100.00

. note: 2/3 is between 28 and 53

. tabulate age_at_start if inrange(age_at_start, 18, 65) & pt & entry_decade >= 2010 & founder

age_at_star |
          t |      Freq.     Percent        Cum.
------------+-----------------------------------
         18 |        134        0.07        0.07
         19 |      1,111        0.54        0.61
         20 |      1,700        0.83        1.44
         21 |      2,188        1.07        2.51
         22 |      2,669        1.31        3.82
         23 |      3,089        1.51        5.33
         24 |      3,910        1.91        7.24
         25 |      4,477        2.19        9.43
         26 |      5,186        2.54       11.97
         27 |      5,493        2.69       14.66
         28 |      6,080        2.98       17.64
         29 |      6,458        3.16       20.80
         30 |      6,903        3.38       24.17
         31 |      7,092        3.47       27.64
         32 |      7,255        3.55       31.19
         33 |      7,549        3.69       34.89
         34 |      7,749        3.79       38.68
         35 |      7,901        3.87       42.55
         36 |      7,835        3.83       46.38
         37 |      7,631        3.73       50.12
         38 |      8,511        4.17       54.28
         39 |      6,883        3.37       57.65
         40 |      6,685        3.27       60.92
         41 |      6,621        3.24       64.16
         42 |      6,167        3.02       67.18
         43 |      5,959        2.92       70.10
         44 |      5,419        2.65       72.75
         45 |      5,323        2.60       75.35
         46 |      4,721        2.31       77.66
         47 |      4,312        2.11       79.77
         48 |      3,772        1.85       81.62
         49 |      3,532        1.73       83.35
         50 |      3,279        1.60       84.95
         51 |      3,074        1.50       86.46
         52 |      2,849        1.39       87.85
         53 |      2,779        1.36       89.21
         54 |      2,583        1.26       90.47
         55 |      2,449        1.20       91.67
         56 |      2,314        1.13       92.81
         57 |      2,159        1.06       93.86
         58 |      2,051        1.00       94.87
         59 |      1,948        0.95       95.82
         60 |      1,658        0.81       96.63
         61 |      1,568        0.77       97.40
         62 |      1,404        0.69       98.08
         63 |      1,406        0.69       98.77
         64 |      1,327        0.65       99.42
         65 |      1,181        0.58      100.00
------------+-----------------------------------
      Total |    204,344      100.00

. note: 2/3 is between 27 and 50

. note: decision made, we will use age group 25-50

. gen byte age25_50 = inrange(age_at_start, 25, 50)

. tabulate founder age25_50   if pt & entry_decade >= 2010, row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

  Founding |       age25_50
     owner |         0          1 |     Total
-----------+----------------------+----------
         0 |    67,613    124,694 |   192,307 
           |     35.16      64.84 |    100.00 
-----------+----------------------+----------
         1 |    53,398    158,793 |   212,191 
           |     25.17      74.83 |    100.00 
-----------+----------------------+----------
     Total |   121,011    283,487 |   404,498 
           |     29.92      70.08 |    100.00 

. cd ..
/Users/koren/Tresorit/Mac/projects/ceo-value

. do "code/estimate/cohort.do"

. use "temp/manager_value.dta", clear

. 
. 
end of do-file

. d

Contains data from temp/manager_value.dta
 Observations:       471,702                  
    Variables:             7                  25 Sep 2025 13:57
                                              (_dta has notes)
---------------------------------------------------------------------------------------------------------------
Variable      Storage   Display    Value
    name         type    format    label      Variable label
---------------------------------------------------------------------------------------------------------------
frame_id_nume~c long    %12.0g                Numeric frame ID
person_id       long    %12.0g                Person ID
firm_fixed_ef~t double  %10.0g                (firstnm) firm_fixed_effect
manager_skill   double  %10.0g                (firstnm) manager_skill
chi             double  %10.0g                (firstnm) chi
component_id    int     %8.0g                 (firstnm) component_id
component_size  long    %12.0g                (firstnm) component_size
---------------------------------------------------------------------------------------------------------------
Sorted by: frame_id_numeric  person_id

. do "code/estimate/cohort.do"

. use "temp/unfiltered.dta", clear

. merge m:1 frame_id_numeric person_id using "temp/manager_value.dta", keep(master match) nogen

    Result                      Number of obs
    -----------------------------------------
    Not matched                     8,876,324
        from master                 8,876,324  
        from using                          0  

    Matched                         3,646,976  
    -----------------------------------------

. 
. 
end of do-file

. d

Contains data from temp/unfiltered.dta
 Observations:    12,523,300                  
    Variables:            52                  25 Sep 2025 13:40
                                              (_dta has notes)
---------------------------------------------------------------------------------------------------------------
Variable      Storage   Display    Value
    name         type    format    label      Variable label
---------------------------------------------------------------------------------------------------------------
frame_id_nume~c long    %12.0g                Numeric frame ID
originalid      long    %10.0g              * Given year Taxid. Minus if taxid not valid
foundyear       int     %8.0g                 Year of foundation
year            int     %9.0g                 Year
teaor08_2d      byte    %9.0g                 2 digit TEAOR08
teaor08_1d      str1    %9s                   1 digit TEAOR08 Letter
sales           double  %12.0g                Sales
export          double  %12.0g                Export
employment      long    %9.0f                 Employment
tangible_assets double  %12.0g              * Tangible assets
materials       double  %12.0g                Materials
wagebill        double  %12.0g                Wagebill
personnel_exp~s double  %12.0g                Personnel expenses
intangible_as~s double  %12.0g              * Intangible assets
state_owned     byte    %9.0g                 State owned
foreign_owned   byte    %8.0g                 Foreign owned
person_id       long    %12.0g                Person ID
male            byte    %8.0g                 Male CEO
birth_year      int     %8.0g                 Year of birth
manager_categ~y byte    %14.0g     mc         Manager category
owner           byte    %8.0g                 Non-founding owner
cf              byte    %80.0g     cf         
n_ceo           byte    %9.0g                 Number of CEOs in a year
sector          byte    %34.0g     sector     
EBITDA          float   %9.0g                 
lnR             float   %9.0g                 Sales (log)
lnEBITDA        float   %9.0g                 EBITDA (log)
lnL             float   %9.0g                 Employment (log)
lnK             float   %9.0g                 Fixed assets (log)
lnM             float   %9.0g                 Materials (log)
lnWL            float   %9.0g                 Wagebill (log)
intangible_sh~e float   %9.0g                 Intangible assets share
has_intangible  byte    %8.0g                 Has intangible assets
max_employment  float   %9.0g                 
ceo_tenure      byte    %8.0g                 CEO tenure (years)
ceo_spell       float   %9.0g                 CEO spell
max_ceo_spell   float   %9.0g                 
exit            byte    %8.0g                 
expat           float   %9.0g                 Expatriate CEO
firm_age        float   %9.0g                 Firm age (years)
ceo_age         float   %9.0g                 CEO age (years)
second_ceo      byte    %8.0g                 Second CEO
third_ceo       byte    %8.0g                 Third or later CEO
founder         byte    %8.0g                 Founding owner
ceo_age_sq      float   %9.0g                 CEO age squared
firm_age_sq     float   %9.0g                 Firm age squared
ceo_tenure_sq   float   %9.0g                 CEO tenure squared
firm_fixed_ef~t double  %10.0g                (firstnm) firm_fixed_effect
manager_skill   double  %10.0g                (firstnm) manager_skill
chi             double  %10.0g                (firstnm) chi
component_id    int     %8.0g                 (firstnm) component_id
component_size  long    %12.0g                (firstnm) component_size
                                            * indicated variables have notes
---------------------------------------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.

. tab year

       Year |      Freq.     Percent        Cum.
------------+-----------------------------------
       1986 |      4,394        0.04        0.04
       1987 |      4,957        0.04        0.07
       1988 |      5,772        0.05        0.12
       1989 |     12,817        0.10        0.22
       1990 |     30,200        0.24        0.46
       1991 |     53,602        0.43        0.89
       1992 |    126,546        1.01        1.90
       1993 |    155,286        1.24        3.14
       1994 |    191,798        1.53        4.67
       1995 |    212,585        1.70        6.37
       1996 |    242,404        1.94        8.31
       1997 |    265,608        2.12       10.43
       1998 |    299,827        2.39       12.82
       1999 |    311,149        2.48       15.31
       2000 |    337,985        2.70       18.01
       2001 |    363,950        2.91       20.91
       2002 |    362,781        2.90       23.81
       2003 |    368,379        2.94       26.75
       2004 |    388,357        3.10       29.85
       2005 |    398,510        3.18       33.03
       2006 |    408,898        3.27       36.30
       2007 |    422,861        3.38       39.68
       2008 |    449,361        3.59       43.26
       2009 |    461,283        3.68       46.95
       2010 |    478,552        3.82       50.77
       2011 |    498,355        3.98       54.75
       2012 |    489,452        3.91       58.66
       2013 |    531,456        4.24       62.90
       2014 |    520,980        4.16       67.06
       2015 |    523,705        4.18       71.24
       2016 |    519,630        4.15       75.39
       2017 |    510,464        4.08       79.47
       2018 |    511,153        4.08       83.55
       2019 |    505,063        4.03       87.58
       2020 |    508,362        4.06       91.64
       2021 |    517,063        4.13       95.77
       2022 |    529,755        4.23      100.00
------------+-----------------------------------
      Total | 12,523,300      100.00

. su manager_skill 

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
manager_sk~l |  3,485,522   -.0015342    .1240843    -1.8748   2.769519

. do "code/estimate/cohort.do"

. use "temp/unfiltered.dta", clear

. merge m:1 frame_id_numeric person_id using "temp/manager_value.dta", keep(master match) nogen

    Result                      Number of obs
    -----------------------------------------
    Not matched                     8,876,324
        from master                 8,876,324  
        from using                          0  

    Matched                         3,646,976  
    -----------------------------------------

. 
. collapse (mean) manager_skill (min) first_year = year (max) last_year = year, by(person_id founder)

. reshape wide manager_skill first_year last_year, i(person_id) j(founder)
(j = 0 1)
--Break--
r(1);

end of do-file

--Break--
r(1);

. do "code/estimate/cohort.do"

. use "temp/unfiltered.dta", clear

. merge m:1 frame_id_numeric person_id using "temp/manager_value.dta", keep(match) nogen

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                         3,646,976  
    -----------------------------------------

. 
. collapse (mean) manager_skill (min) first_year = year (max) last_year = year (min) component_id (max) compone
> nt_size, by(person_id founder)

. reshape wide manager_skill first_year last_year, i(person_id) j(founder)
(j = 0 1)

Data                               Long   ->   Wide
-----------------------------------------------------------------------------
Number of observations          391,783   ->   360,589     
Number of variables                   7   ->   9           
j variable (2 values)           founder   ->   (dropped)
xij variables:
                          manager_skill   ->   manager_skill0 manager_skill1
                             first_year   ->   first_year0 first_year1
                              last_year   ->   last_year0 last_year1
-----------------------------------------------------------------------------

. 
end of do-file

. bro

. count
  360,589

. count if !missing(manager_skill0 , manager_skill1 )
  27,056

. bro if !missing(manager_skill0 , manager_skill1 )

. gen founder_after_ceo = first_year1 - first_year0 
(329,395 missing values generated)

. tab founder_after_ceo 

founder_aft |
     er_ceo |      Freq.     Percent        Cum.
------------+-----------------------------------
        -33 |          1        0.00        0.00
        -32 |          2        0.01        0.01
        -31 |         13        0.04        0.05
        -30 |         19        0.06        0.11
        -29 |         39        0.13        0.24
        -28 |         64        0.21        0.44
        -27 |         74        0.24        0.68
        -26 |        106        0.34        1.02
        -25 |        119        0.38        1.40
        -24 |        133        0.43        1.83
        -23 |        184        0.59        2.42
        -22 |        202        0.65        3.06
        -21 |        254        0.81        3.88
        -20 |        320        1.03        4.90
        -19 |        369        1.18        6.09
        -18 |        382        1.22        7.31
        -17 |        493        1.58        8.89
        -16 |        531        1.70       10.59
        -15 |        562        1.80       12.40
        -14 |        643        2.06       14.46
        -13 |        688        2.21       16.66
        -12 |        861        2.76       19.42
        -11 |        850        2.72       22.15
        -10 |        895        2.87       25.02
         -9 |      1,052        3.37       28.39
         -8 |      1,093        3.50       31.89
         -7 |      1,138        3.65       35.54
         -6 |      1,207        3.87       39.41
         -5 |      1,301        4.17       43.58
         -4 |      1,374        4.40       47.99
         -3 |      1,368        4.39       52.37
         -2 |      1,370        4.39       56.76
         -1 |      1,359        4.36       61.12
          0 |      1,522        4.88       66.00
          1 |      1,366        4.38       70.38
          2 |      1,361        4.36       74.74
          3 |      1,175        3.77       78.51
          4 |      1,077        3.45       81.96
          5 |        907        2.91       84.87
          6 |        750        2.40       87.27
          7 |        633        2.03       89.30
          8 |        545        1.75       91.05
          9 |        436        1.40       92.45
         10 |        408        1.31       93.76
         11 |        314        1.01       94.76
         12 |        294        0.94       95.70
         13 |        216        0.69       96.40
         14 |        215        0.69       97.09
         15 |        190        0.61       97.70
         16 |        159        0.51       98.20
         17 |        119        0.38       98.59
         18 |         82        0.26       98.85
         19 |         87        0.28       99.13
         20 |         72        0.23       99.36
         21 |         48        0.15       99.51
         22 |         39        0.13       99.64
         23 |         32        0.10       99.74
         24 |         20        0.06       99.80
         25 |         16        0.05       99.86
         26 |          6        0.02       99.87
         27 |         11        0.04       99.91
         28 |         13        0.04       99.95
         29 |          3        0.01       99.96
         30 |          3        0.01       99.97
         31 |          2        0.01       99.98
         32 |          4        0.01       99.99
         33 |          2        0.01      100.00
         35 |          1        0.00      100.00
------------+-----------------------------------
      Total |     31,194      100.00

. gen byte founder_first = first_year1 < first_year0 

. tab founder_first 

founder_fir |
         st |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    151,652       42.06       42.06
          1 |    208,937       57.94      100.00
------------+-----------------------------------
      Total |    360,589      100.00

. tab founder_first  if !missing(manager_skill0 , manager_skill1 )

founder_fir |
         st |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     10,440       38.59       38.59
          1 |     16,616       61.41      100.00
------------+-----------------------------------
      Total |     27,056      100.00

. drop founder_first 

. gen byte founder_first = first_year1 < first_year0 if !missing(first_year0 )
(189,871 missing values generated)

. tab founder_first , miss

founder_fir |
         st |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    151,652       42.06       42.06
          1 |     19,066        5.29       47.34
          . |    189,871       52.66      100.00
------------+-----------------------------------
      Total |    360,589      100.00

. gen byte founder = !missing(first_year1 )

. tab founder_first founder, miss

founder_fi |        founder
       rst |         0          1 |     Total
-----------+----------------------+----------
         0 |   139,524     12,128 |   151,652 
         1 |         0     19,066 |    19,066 
         . |         0    189,871 |   189,871 
-----------+----------------------+----------
     Total |   139,524    221,065 |   360,589 

. count if !missing(manager_skill0 , manager_skill1 )
  27,056

. count if !(manager_skill0 == manager_skill1 )
  316,539

. count if !missing(manager_skill0 , manager_skill1 ) & !(manager_skill0 == manager_skill1 )
  13,649

. bro if !missing(manager_skill0 , manager_skill1 ) & !(manager_skill0 == manager_skill1 )

. tab component_id 

      (min) |
component_i |
          d |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    316,364       87.74       87.74
          1 |     34,685        9.62       97.35
          2 |        169        0.05       97.40
          3 |        163        0.05       97.45
          4 |        132        0.04       97.48
          5 |        132        0.04       97.52
          6 |        124        0.03       97.55
          7 |        110        0.03       97.58
          8 |        102        0.03       97.61
          9 |         96        0.03       97.64
         10 |         95        0.03       97.67
         11 |         92        0.03       97.69
         12 |         92        0.03       97.72
         13 |         91        0.03       97.74
         14 |         87        0.02       97.77
         15 |         87        0.02       97.79
         16 |         85        0.02       97.81
         17 |         84        0.02       97.84
         18 |         83        0.02       97.86
         19 |         83        0.02       97.88
         20 |         80        0.02       97.91
         21 |         79        0.02       97.93
         22 |         79        0.02       97.95
         23 |         79        0.02       97.97
         24 |         78        0.02       97.99
         25 |         76        0.02       98.01
         26 |         75        0.02       98.03
         27 |         74        0.02       98.06
         28 |         72        0.02       98.08
         29 |         71        0.02       98.09
         30 |         70        0.02       98.11
         31 |         70        0.02       98.13
         32 |         69        0.02       98.15
         33 |         69        0.02       98.17
         34 |         67        0.02       98.19
         35 |         67        0.02       98.21
         36 |         67        0.02       98.23
         37 |         67        0.02       98.25
         38 |         66        0.02       98.26
         39 |         66        0.02       98.28
         40 |         66        0.02       98.30
         41 |         62        0.02       98.32
         42 |         60        0.02       98.33
         43 |         60        0.02       98.35
         44 |         60        0.02       98.37
         45 |         58        0.02       98.38
         46 |         58        0.02       98.40
         47 |         57        0.02       98.42
         48 |         57        0.02       98.43
         49 |         57        0.02       98.45
         50 |         56        0.02       98.46
         51 |         55        0.02       98.48
         52 |         55        0.02       98.49
         53 |         55        0.02       98.51
         54 |         54        0.01       98.52
         55 |         53        0.01       98.54
         56 |         53        0.01       98.55
         57 |         53        0.01       98.57
         58 |         53        0.01       98.58
         59 |         52        0.01       98.60
         60 |         52        0.01       98.61
         61 |         52        0.01       98.63
         62 |         51        0.01       98.64
         63 |         51        0.01       98.65
         64 |         51        0.01       98.67
         65 |         50        0.01       98.68
         66 |         50        0.01       98.70
         67 |         49        0.01       98.71
         68 |         49        0.01       98.72
         69 |         49        0.01       98.74
         70 |         49        0.01       98.75
         71 |         48        0.01       98.76
         72 |         48        0.01       98.78
         73 |         48        0.01       98.79
         74 |         47        0.01       98.80
         75 |         47        0.01       98.82
         76 |         47        0.01       98.83
         77 |         46        0.01       98.84
         78 |         46        0.01       98.86
         79 |         46        0.01       98.87
         80 |         46        0.01       98.88
         81 |         46        0.01       98.89
         82 |         45        0.01       98.91
         83 |         45        0.01       98.92
         84 |         44        0.01       98.93
         85 |         44        0.01       98.94
         86 |         44        0.01       98.96
         87 |         44        0.01       98.97
         88 |         43        0.01       98.98
         89 |         43        0.01       98.99
         90 |         43        0.01       99.00
         91 |         42        0.01       99.01
         92 |         42        0.01       99.03
         93 |         42        0.01       99.04
         94 |         42        0.01       99.05
         95 |         42        0.01       99.06
         96 |         41        0.01       99.07
         97 |         41        0.01       99.08
         98 |         41        0.01       99.10
         99 |         41        0.01       99.11
        100 |         41        0.01       99.12
        101 |         41        0.01       99.13
        102 |         41        0.01       99.14
        103 |         40        0.01       99.15
        104 |         40        0.01       99.16
        105 |         40        0.01       99.17
        106 |         40        0.01       99.19
        107 |         39        0.01       99.20
        108 |         39        0.01       99.21
        109 |         39        0.01       99.22
        110 |         39        0.01       99.23
        111 |         39        0.01       99.24
        112 |         39        0.01       99.25
        113 |         39        0.01       99.26
        114 |         39        0.01       99.27
        115 |         39        0.01       99.28
        116 |         39        0.01       99.29
        117 |         39        0.01       99.30
        118 |         38        0.01       99.31
        119 |         38        0.01       99.33
        120 |         38        0.01       99.34
        121 |         38        0.01       99.35
        122 |         38        0.01       99.36
        123 |         38        0.01       99.37
        124 |         38        0.01       99.38
        125 |         38        0.01       99.39
        126 |         37        0.01       99.40
        127 |         37        0.01       99.41
        128 |         37        0.01       99.42
        129 |         37        0.01       99.43
        130 |         37        0.01       99.44
        131 |         36        0.01       99.45
        132 |         36        0.01       99.46
        133 |         36        0.01       99.47
        134 |         36        0.01       99.48
        135 |         36        0.01       99.49
        136 |         36        0.01       99.50
        137 |         36        0.01       99.51
        138 |         35        0.01       99.52
        139 |         35        0.01       99.53
        140 |         35        0.01       99.54
        141 |         35        0.01       99.55
        142 |         35        0.01       99.56
        143 |         35        0.01       99.57
        144 |         35        0.01       99.58
        145 |         34        0.01       99.59
        146 |         34        0.01       99.60
        147 |         34        0.01       99.61
        148 |         33        0.01       99.62
        149 |         33        0.01       99.62
        150 |         33        0.01       99.63
        151 |         33        0.01       99.64
        152 |         33        0.01       99.65
        153 |         33        0.01       99.66
        154 |         33        0.01       99.67
        155 |         33        0.01       99.68
        156 |         33        0.01       99.69
        157 |         33        0.01       99.70
        158 |         32        0.01       99.71
        159 |         32        0.01       99.72
        160 |         32        0.01       99.72
        161 |         32        0.01       99.73
        162 |         32        0.01       99.74
        163 |         32        0.01       99.75
        164 |         32        0.01       99.76
        165 |         32        0.01       99.77
        166 |         32        0.01       99.78
        167 |         32        0.01       99.79
        168 |         32        0.01       99.80
        169 |         32        0.01       99.80
        170 |         32        0.01       99.81
        171 |         32        0.01       99.82
        172 |         31        0.01       99.83
        173 |         31        0.01       99.84
        174 |         31        0.01       99.85
        175 |         31        0.01       99.86
        176 |         31        0.01       99.86
        177 |         31        0.01       99.87
        178 |         31        0.01       99.88
        179 |         31        0.01       99.89
        180 |         31        0.01       99.90
        181 |         31        0.01       99.91
        182 |         31        0.01       99.92
        183 |         31        0.01       99.92
        184 |         31        0.01       99.93
        185 |         30        0.01       99.94
        186 |         30        0.01       99.95
        187 |         30        0.01       99.96
        188 |         30        0.01       99.97
        189 |         30        0.01       99.98
        190 |         30        0.01       99.98
        191 |         30        0.01       99.99
        192 |         30        0.01      100.00
------------+-----------------------------------
      Total |    360,589      100.00

. egen first_year = rowmin(first_year?)

. egen last_year = rowmax(last_year?)

. egen manager_skill = firstnm(manager_skill?)
unknown egen function firstnm()
r(133);

. 
. help egen

. egen manager_skill = rowfirst(manager_skill?)
(30,643 missing values generated)

. 
. generate byte founder2 = first_year0 > first_year

. tab founder founder2 

           |       founder2
   founder |         0          1 |     Total
-----------+----------------------+----------
         0 |   139,524          0 |   139,524 
         1 |    12,128    208,937 |   221,065 
-----------+----------------------+----------
     Total |   151,652    208,937 |   360,589 

. tab founder founder2 , miss

           |       founder2
   founder |         0          1 |     Total
-----------+----------------------+----------
         0 |   139,524          0 |   139,524 
         1 |    12,128    208,937 |   221,065 
-----------+----------------------+----------
     Total |   151,652    208,937 |   360,589 

. tab founder_first  founder2 , miss

founder_fi |       founder2
       rst |         0          1 |     Total
-----------+----------------------+----------
         0 |   151,652          0 |   151,652 
         1 |         0     19,066 |    19,066 
         . |         0    189,871 |   189,871 
-----------+----------------------+----------
     Total |   151,652    208,937 |   360,589 

. bro if founder2 

. do "code/estimate/cohort.do"

. use "temp/unfiltered.dta", clear

. merge m:1 frame_id_numeric person_id using "temp/manager_value.dta", keep(match) nogen

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                        10,224,519  
    -----------------------------------------

. 
. collapse (mean) manager_skill (min) first_year = year (max) last_year = year (min) component_id (max) compone
> nt_size, by(person_id founder)

. reshape wide manager_skill first_year last_year, i(person_id) j(founder)
(j = 0 1)

Data                               Long   ->   Wide
-----------------------------------------------------------------------------
Number of observations        1,172,521   ->   1,044,111   
Number of variables                   7   ->   9           
j variable (2 values)           founder   ->   (dropped)
xij variables:
                          manager_skill   ->   manager_skill0 manager_skill1
                             first_year   ->   first_year0 first_year1
                              last_year   ->   last_year0 last_year1
-----------------------------------------------------------------------------

. 
. * relatively few overlap, use the first ceo spell
. egen first_year = rowmin(first_year?)

. egen last_year = rowmax(last_year?)

. egen manager_skill = rowfirst(manager_skill?)
(231,259 missing values generated)

. 
. generate byte founder = first_year0 > first_year

. tabulate first_year founder

           |        founder
first_year |         0          1 |     Total
-----------+----------------------+----------
      1986 |     1,665          1 |     1,666 
      1987 |       300          0 |       300 
      1988 |       352         25 |       377 
      1989 |     1,416      1,457 |     2,873 
      1990 |     3,687      6,420 |    10,107 
      1991 |     4,724     12,414 |    17,138 
      1992 |     8,530     50,260 |    58,790 
      1993 |     6,518     30,423 |    36,941 
      1994 |     6,353     31,805 |    38,158 
      1995 |     6,072     26,809 |    32,881 
      1996 |     6,825     29,922 |    36,747 
      1997 |     8,024     31,859 |    39,883 
      1998 |     8,156     32,492 |    40,648 
      1999 |     7,464     23,792 |    31,256 
      2000 |    10,220     29,261 |    39,481 
      2001 |     8,740     31,143 |    39,883 
      2002 |     8,346     27,502 |    35,848 
      2003 |     8,204     24,489 |    32,693 
      2004 |     9,651     26,435 |    36,086 
      2005 |     9,536     21,171 |    30,707 
      2006 |     9,503     21,267 |    30,770 
      2007 |    10,120     19,302 |    29,422 
      2008 |    12,036     24,291 |    36,327 
      2009 |    10,638     23,065 |    33,703 
      2010 |    10,468     22,501 |    32,969 
      2011 |    10,513     21,794 |    32,307 
      2012 |    12,936     22,054 |    34,990 
      2013 |    19,392     20,484 |    39,876 
      2014 |    11,361     14,714 |    26,075 
      2015 |    10,705     10,639 |    21,344 
      2016 |    11,491     11,262 |    22,753 
      2017 |    11,149     10,954 |    22,103 
      2018 |    10,359     11,235 |    21,594 
      2019 |     9,654     11,224 |    20,878 
      2020 |    15,041     11,622 |    26,663 
      2021 |    10,170     15,738 |    25,908 
      2022 |    10,866     13,100 |    23,966 
-----------+----------------------+----------
     Total |   321,185    722,926 | 1,044,111 

. 
end of do-file

. regress manager_skill i.first_year if founder & component_id == 1, robust

Linear regression                               Number of obs     =     93,856
                                                F(34, 93821)      =       0.84
                                                Prob > F          =     0.7307
                                                R-squared         =     0.0003
                                                Root MSE          =     .30942

------------------------------------------------------------------------------
             |               Robust
manager_sk~l | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
  first_year |
       1989  |   .1445584   .0968587     1.49   0.136    -.0452836    .3344005
       1990  |   .1405164   .0961276     1.46   0.144    -.0478927    .3289254
       1991  |   .1437119   .0960105     1.50   0.134    -.0444678    .3318915
       1992  |   .1459976   .0959076     1.52   0.128    -.0419804    .3339756
       1993  |   .1432625   .0959537     1.49   0.135    -.0448057    .3313306
       1994  |   .1417898   .0959455     1.48   0.139    -.0462625     .329842
       1995  |   .1380849   .0959763     1.44   0.150    -.0500276    .3261973
       1996  |    .148199   .0959601     1.54   0.122    -.0398817    .3362797
       1997  |   .1358216   .0959497     1.42   0.157    -.0522388    .3238821
       1998  |   .1398274   .0959517     1.46   0.145    -.0482368    .3278916
       1999  |   .1451791   .0959922     1.51   0.130    -.0429646    .3333228
       2000  |   .1465411   .0959676     1.53   0.127    -.0415544    .3346367
       2001  |   .1473213   .0959795     1.53   0.125    -.0407975    .3354401
       2002  |   .1531324   .0959888     1.60   0.111    -.0350046    .3412694
       2003  |    .143098    .096005     1.49   0.136    -.0450709    .3312669
       2004  |   .1427747    .095984     1.49   0.137    -.0453529    .3309023
       2005  |   .1480796   .0960333     1.54   0.123    -.0401446    .3363039
       2006  |   .1478442   .0960188     1.54   0.124    -.0403516      .33604
       2007  |   .1552278   .0960663     1.62   0.106    -.0330611    .3435166
       2008  |   .1450009   .0960234     1.51   0.131     -.043204    .3332059
       2009  |    .144489   .0960507     1.50   0.133    -.0437694    .3327474
       2010  |    .149625   .0960591     1.56   0.119    -.0386499    .3378998
       2011  |   .1525513   .0960864     1.59   0.112    -.0357769    .3408796
       2012  |    .149428   .0960836     1.56   0.120    -.0388947    .3377508
       2013  |   .1455411   .0961368     1.51   0.130     -.042886    .3339683
       2014  |   .1442007   .0962352     1.50   0.134    -.0444193    .3328206
       2015  |   .1448479    .096437     1.50   0.133    -.0441675    .3338633
       2016  |   .1617464   .0964288     1.68   0.093     -.027253    .3507458
       2017  |   .1582625    .096535     1.64   0.101    -.0309451      .34747
       2018  |   .1453573   .0966451     1.50   0.133     -.044066    .3347806
       2019  |   .1600933   .0969109     1.65   0.099    -.0298511    .3500377
       2020  |   .1513765   .0972489     1.56   0.120    -.0392303    .3419833
       2021  |   .1512481   .0971474     1.56   0.119    -.0391598     .341656
       2022  |   .1945701   .1002507     1.94   0.052    -.0019202    .3910604
             |
       _cons |  -.1574563   .0958527    -1.64   0.100    -.3453265     .030414
------------------------------------------------------------------------------

. regress manager_skill i.first_year if !founder & component_id == 1, robust

Linear regression                               Number of obs     =     79,585
                                                F(36, 79548)      =       4.30
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0020
                                                Root MSE          =     .33215

------------------------------------------------------------------------------
             |               Robust
manager_sk~l | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
  first_year |
       1987  |  -.0311953   .0471858    -0.66   0.509    -.1236793    .0612887
       1988  |  -.0329877    .039437    -0.84   0.403     -.110284    .0443085
       1989  |  -.0154437   .0214161    -0.72   0.471    -.0574191    .0265317
       1990  |  -.0261618   .0191645    -1.37   0.172    -.0637242    .0114006
       1991  |  -.0212075    .018948    -1.12   0.263    -.0583454    .0159305
       1992  |  -.0308683    .018247    -1.69   0.091    -.0666322    .0048956
       1993  |  -.0055366    .018443    -0.30   0.764    -.0416849    .0306117
       1994  |  -.0320582   .0182718    -1.75   0.079    -.0678708    .0037544
       1995  |   -.038451   .0182626    -2.11   0.035    -.0742456   -.0026564
       1996  |  -.0259706   .0182238    -1.43   0.154    -.0616892     .009748
       1997  |  -.0504523   .0179984    -2.80   0.005     -.085729   -.0151755
       1998  |  -.0509136   .0180122    -2.83   0.005    -.0862175   -.0156097
       1999  |  -.0378532   .0180393    -2.10   0.036    -.0732102   -.0024962
       2000  |  -.0284855   .0177138    -1.61   0.108    -.0632044    .0062333
       2001  |   -.033631   .0179017    -1.88   0.060    -.0687182    .0014561
       2002  |  -.0289419   .0179616    -1.61   0.107    -.0641466    .0062628
       2003  |  -.0284583   .0179014    -1.59   0.112    -.0635448    .0066283
       2004  |  -.0248192   .0178717    -1.39   0.165    -.0598477    .0102093
       2005  |  -.0262788   .0177063    -1.48   0.138     -.060983    .0084254
       2006  |   -.020731   .0178851    -1.16   0.246    -.0557856    .0143236
       2007  |  -.0193927    .017881    -1.08   0.278    -.0544392    .0156539
       2008  |  -.0245302   .0177488    -1.38   0.167    -.0593178    .0102574
       2009  |   -.020817    .017895    -1.16   0.245    -.0558911    .0142571
       2010  |  -.0048174   .0179718    -0.27   0.789    -.0400421    .0304072
       2011  |  -.0222466   .0180726    -1.23   0.218    -.0576688    .0131755
       2012  |  -.0111542   .0178993    -0.62   0.533    -.0462368    .0239283
       2013  |  -.0250482   .0176089    -1.42   0.155    -.0595615    .0094652
       2014  |  -.0111963   .0180311    -0.62   0.535    -.0465372    .0241446
       2015  |  -.0040854    .018112    -0.23   0.822    -.0395848    .0314141
       2016  |  -.0117345   .0180981    -0.65   0.517    -.0472066    .0237377
       2017  |  -.0106501   .0179332    -0.59   0.553     -.045799    .0244988
       2018  |     .00695   .0183093     0.38   0.704    -.0289361    .0428361
       2019  |  -.0112439   .0183456    -0.61   0.540    -.0472011    .0247133
       2020  |   .0073716   .0181714     0.41   0.685    -.0282442    .0429874
       2021  |   .0099467   .0186245     0.53   0.593    -.0265572    .0464506
       2022  |   .0168109   .0193528     0.87   0.385    -.0211205    .0547423
             |
       _cons |   .0243407   .0167274     1.46   0.146    -.0084448    .0571262
------------------------------------------------------------------------------

. gen cohort = int(first_year / 5)*5

. tab cohort founder 

           |        founder
    cohort |         0          1 |     Total
-----------+----------------------+----------
      1985 |     3,733      1,483 |     5,216 
      1990 |    29,812    131,322 |   161,134 
      1995 |    36,541    144,874 |   181,415 
      2000 |    45,161    138,830 |   183,991 
      2005 |    51,833    109,096 |   160,929 
      2010 |    64,670    101,547 |   166,217 
      2015 |    53,358     55,314 |   108,672 
      2020 |    36,077     40,460 |    76,537 
-----------+----------------------+----------
     Total |   321,185    722,926 | 1,044,111 

. regress manager_skill ib1985.cohort if !founder & component_id == 1, robust

Linear regression                               Number of obs     =     79,585
                                                F(7, 79577)       =      17.48
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0016
                                                Root MSE          =     .33216

------------------------------------------------------------------------------
             |               Robust
manager_sk~l | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      cohort |
       1990  |   -.010552   .0105833    -1.00   0.319    -.0312952    .0101911
       1995  |  -.0284484   .0104262    -2.73   0.006    -.0488837   -.0080132
       2000  |  -.0159963   .0103442    -1.55   0.122    -.0362709    .0042783
       2005  |  -.0096804   .0103286    -0.94   0.349    -.0299244    .0105636
       2010  |  -.0027668   .0103537    -0.27   0.789      -.02306    .0175264
       2015  |   .0064164   .0104426     0.61   0.539     -.014051    .0268838
       2020  |   .0234015   .0110117     2.13   0.034     .0018186    .0449844
             |
       _cons |   .0115382   .0099569     1.16   0.247    -.0079773    .0310537
------------------------------------------------------------------------------

. reghdfe manager_skill ib1985.cohort if !founder , a(component_id )
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =    242,878
Absorbing 1 HDFE group                            F(   7, 242760) =      39.24
                                                  Prob > F        =     0.0000
                                                  R-squared       =     0.0017
                                                  Adj R-squared   =     0.0012
                                                  Within R-sq.    =     0.0011
                                                  Root MSE        =     0.2145

------------------------------------------------------------------------------
manager_sk~l | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      cohort |
       1990  |  -.0089121   .0038375    -2.32   0.020    -.0164336   -.0013907
       1995  |  -.0180533   .0037937    -4.76   0.000     -.025489   -.0106177
       2000  |  -.0130167   .0037587    -3.46   0.001    -.0203836   -.0056498
       2005  |  -.0079675   .0037465    -2.13   0.033    -.0153105   -.0006245
       2010  |  -.0090099     .00373    -2.42   0.016    -.0163206   -.0016992
       2015  |   .0013888   .0037569     0.37   0.712    -.0059746    .0087521
       2020  |   .0072089   .0038706     1.86   0.063    -.0003774    .0147953
             |
       _cons |   .0076432   .0035912     2.13   0.033     .0006045    .0146818
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
 component_id |       111           0         111     |
------------------------------------------------------+

. reghdfe manager_skill ib1985.cohort if founder , a(component_id )
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =    569,974
Absorbing 1 HDFE group                            F(   7, 569856) =       3.44
                                                  Prob > F        =     0.0011
                                                  R-squared       =     0.0008
                                                  Adj R-squared   =     0.0006
                                                  Within R-sq.    =     0.0000
                                                  Root MSE        =     0.1415

------------------------------------------------------------------------------
manager_sk~l | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      cohort |
       1990  |  -.0023731   .0037808    -0.63   0.530    -.0097834    .0050373
       1995  |  -.0033145    .003779    -0.88   0.380    -.0107212    .0040922
       2000  |  -.0026212   .0037814    -0.69   0.488    -.0100326    .0047902
       2005  |  -.0023406   .0037899    -0.62   0.537    -.0097686    .0050875
       2010  |  -.0028683   .0037949    -0.76   0.450    -.0103062    .0045696
       2015  |  -.0008922   .0038269    -0.23   0.816    -.0083927    .0066084
       2020  |   .0010276   .0038769     0.27   0.791    -.0065711    .0086263
             |
       _cons |  -.0023452   .0037579    -0.62   0.533    -.0097106    .0050202
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
 component_id |       111           0         111     |
------------------------------------------------------+

. egen n = total(1), by(first_year)

. table cohort 

--------------------
        |  Frequency
--------+-----------
cohort  |           
  1985  |      5,216
  1990  |    161,134
  1995  |    181,415
  2000  |    183,991
  2005  |    160,929
  2010  |    166,217
  2015  |    108,672
  2020  |     76,537
  Total |  1,044,111
--------------------

. gen ln_n = ln(n)

. reghdfe manager_skill ib1985.cohort if founder & cohort < 2020, a(component_id )
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =    547,547
Absorbing 1 HDFE group                            F(   6, 547430) =       1.64
                                                  Prob > F        =     0.1324
                                                  R-squared       =     0.0008
                                                  Adj R-squared   =     0.0006
                                                  Within R-sq.    =     0.0000
                                                  Root MSE        =     0.1436

------------------------------------------------------------------------------
manager_sk~l | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      cohort |
       1990  |  -.0023592    .003835    -0.62   0.538    -.0098757    .0051573
       1995  |  -.0033043   .0038331    -0.86   0.389    -.0108172    .0042085
       2000  |  -.0026132   .0038356    -0.68   0.496    -.0101308    .0049044
       2005  |  -.0023323   .0038442    -0.61   0.544    -.0098667    .0052022
       2010  |  -.0028634   .0038493    -0.74   0.457    -.0104079    .0046811
       2015  |  -.0008914   .0038817    -0.23   0.818    -.0084995    .0067166
             |
       _cons |  -.0023985   .0038117    -0.63   0.529    -.0098693    .0050723
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
 component_id |       111           0         111     |
------------------------------------------------------+

. reghdfe manager_skill ib1985.cohort if !founder & cohort < 2020, a(component_id )
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =    220,789
Absorbing 1 HDFE group                            F(   6, 220672) =      26.82
                                                  Prob > F        =     0.0000
                                                  R-squared       =     0.0013
                                                  Adj R-squared   =     0.0007
                                                  Within R-sq.    =     0.0007
                                                  Root MSE        =     0.2151

------------------------------------------------------------------------------
manager_sk~l | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      cohort |
       1990  |    -.00886   .0038472    -2.30   0.021    -.0164004   -.0013196
       1995  |  -.0179332   .0038033    -4.72   0.000    -.0253876   -.0104787
       2000  |  -.0128613   .0037682    -3.41   0.001    -.0202468   -.0054757
       2005  |  -.0078685   .0037559    -2.09   0.036      -.01523    -.000507
       2010  |  -.0089724   .0037394    -2.40   0.016    -.0163015   -.0016433
       2015  |   .0014256   .0037663     0.38   0.705    -.0059564    .0088075
             |
       _cons |   .0076183   .0036004     2.12   0.034     .0005617    .0146749
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
 component_id |       111           0         111     |
------------------------------------------------------+

. reghdfe manager_skill ln_n ib1985.cohort if !founder & cohort < 2020, a(component_id )
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =    220,789
Absorbing 1 HDFE group                            F(   7, 220671) =      23.91
                                                  Prob > F        =     0.0000
                                                  R-squared       =     0.0013
                                                  Adj R-squared   =     0.0008
                                                  Within R-sq.    =     0.0008
                                                  Root MSE        =     0.2151

------------------------------------------------------------------------------
manager_sk~l | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        ln_n |  -.0048782   .0019227    -2.54   0.011    -.0086466   -.0011098
             |
      cohort |
       1990  |   .0057364   .0069207     0.83   0.407    -.0078281    .0193009
       1995  |  -.0025434   .0071594    -0.36   0.722    -.0165756    .0114889
       2000  |    .002604   .0071661     0.36   0.716    -.0114414    .0166494
       2005  |   .0069436   .0069418     1.00   0.317    -.0066621    .0205493
       2010  |   .0060634   .0070073     0.87   0.387    -.0076707    .0197975
       2015  |   .0143187   .0063252     2.26   0.024     .0019215    .0267158
             |
       _cons |    .043448   .0145735     2.98   0.003     .0148844    .0720117
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
 component_id |       111           0         111     |
------------------------------------------------------+

. reghdfe manager_skill ln_n cohort if !founder & cohort < 2020, a(component_id )
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =    220,789
Absorbing 1 HDFE group                            F(   2, 220676) =      60.40
                                                  Prob > F        =     0.0000
                                                  R-squared       =     0.0011
                                                  Adj R-squared   =     0.0006
                                                  Within R-sq.    =     0.0005
                                                  Root MSE        =     0.2151

------------------------------------------------------------------------------
manager_sk~l | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        ln_n |  -.0071158   .0009495    -7.49   0.000    -.0089767   -.0052548
      cohort |   .0004439   .0000547     8.12   0.000     .0003367     .000551
       _cons |  -.8170503   .1098876    -7.44   0.000    -1.032427   -.6016734
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
 component_id |       111           0         111     |
------------------------------------------------------+

. reghdfe manager_skill ln_n if !founder & cohort < 2020, a(component_id )
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =    220,789
Absorbing 1 HDFE group                            F(   1, 220677) =      54.90
                                                  Prob > F        =     0.0000
                                                  R-squared       =     0.0008
                                                  Adj R-squared   =     0.0003
                                                  Within R-sq.    =     0.0002
                                                  Root MSE        =     0.2151

------------------------------------------------------------------------------
manager_sk~l | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        ln_n |  -.0070358   .0009496    -7.41   0.000     -.008897   -.0051747
       _cons |   .0714025   .0097994     7.29   0.000     .0521958    .0906091
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
 component_id |       111           0         111     |
------------------------------------------------------+

. reghdfe manager_skill ln_n if !founder & cohort < 2020, a(component_id )
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =    220,789
Absorbing 1 HDFE group                            F(   1, 220677) =      54.90
                                                  Prob > F        =     0.0000
                                                  R-squared       =     0.0008
                                                  Adj R-squared   =     0.0003
                                                  Within R-sq.    =     0.0002
                                                  Root MSE        =     0.2151

------------------------------------------------------------------------------
manager_sk~l | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        ln_n |  -.0070358   .0009496    -7.41   0.000     -.008897   -.0051747
       _cons |   .0714025   .0097994     7.29   0.000     .0521958    .0906091
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
 component_id |       111           0         111     |
------------------------------------------------------+

. do "code/estimate/cohort.do"

. use "temp/unfiltered.dta", clear

. merge m:1 frame_id_numeric person_id using "temp/manager_value.dta", keep(match) nogen

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                        10,224,519  
    -----------------------------------------

. 
. * for babyboom, we measure manager skills in revenue units, not as TFP
. replace manager_skill = manager_skill / chi
(8,688,171 real changes made)

. 
. collapse (mean) manager_skill (min) first_year = year (max) last_year = year (min) component_id (max) compone
> nt_size, by(person_id founder)

. reshape wide manager_skill first_year last_year, i(person_id) j(founder)
(j = 0 1)

Data                               Long   ->   Wide
-----------------------------------------------------------------------------
Number of observations        1,172,521   ->   1,044,111   
Number of variables                   7   ->   9           
j variable (2 values)           founder   ->   (dropped)
xij variables:
                          manager_skill   ->   manager_skill0 manager_skill1
                             first_year   ->   first_year0 first_year1
                              last_year   ->   last_year0 last_year1
-----------------------------------------------------------------------------

. 
. * relatively few overlap, use the first ceo spell
. egen first_year = rowmin(first_year?)

. egen last_year = rowmax(last_year?)

. egen manager_skill = rowmean(manager_skill?)
(231,259 missing values generated)

. 
. generate byte founder = first_year0 > first_year

. tabulate first_year founder

           |        founder
first_year |         0          1 |     Total
-----------+----------------------+----------
      1986 |     1,665          1 |     1,666 
      1987 |       300          0 |       300 
      1988 |       352         25 |       377 
      1989 |     1,416      1,457 |     2,873 
      1990 |     3,687      6,420 |    10,107 
      1991 |     4,724     12,414 |    17,138 
      1992 |     8,530     50,260 |    58,790 
      1993 |     6,518     30,423 |    36,941 
      1994 |     6,353     31,805 |    38,158 
      1995 |     6,072     26,809 |    32,881 
      1996 |     6,825     29,922 |    36,747 
      1997 |     8,024     31,859 |    39,883 
      1998 |     8,156     32,492 |    40,648 
      1999 |     7,464     23,792 |    31,256 
      2000 |    10,220     29,261 |    39,481 
      2001 |     8,740     31,143 |    39,883 
      2002 |     8,346     27,502 |    35,848 
      2003 |     8,204     24,489 |    32,693 
      2004 |     9,651     26,435 |    36,086 
      2005 |     9,536     21,171 |    30,707 
      2006 |     9,503     21,267 |    30,770 
      2007 |    10,120     19,302 |    29,422 
      2008 |    12,036     24,291 |    36,327 
      2009 |    10,638     23,065 |    33,703 
      2010 |    10,468     22,501 |    32,969 
      2011 |    10,513     21,794 |    32,307 
      2012 |    12,936     22,054 |    34,990 
      2013 |    19,392     20,484 |    39,876 
      2014 |    11,361     14,714 |    26,075 
      2015 |    10,705     10,639 |    21,344 
      2016 |    11,491     11,262 |    22,753 
      2017 |    11,149     10,954 |    22,103 
      2018 |    10,359     11,235 |    21,594 
      2019 |     9,654     11,224 |    20,878 
      2020 |    15,041     11,622 |    26,663 
      2021 |    10,170     15,738 |    25,908 
      2022 |    10,866     13,100 |    23,966 
-----------+----------------------+----------
     Total |   321,185    722,926 | 1,044,111 

. 
. generate cohort = int(first_year/5)*5

. tabulate cohort founder

           |        founder
    cohort |         0          1 |     Total
-----------+----------------------+----------
      1985 |     3,733      1,483 |     5,216 
      1990 |    29,812    131,322 |   161,134 
      1995 |    36,541    144,874 |   181,415 
      2000 |    45,161    138,830 |   183,991 
      2005 |    51,833    109,096 |   160,929 
      2010 |    64,670    101,547 |   166,217 
      2015 |    53,358     55,314 |   108,672 
      2020 |    36,077     40,460 |    76,537 
-----------+----------------------+----------
     Total |   321,185    722,926 | 1,044,111 

. 
. egen n = count(person_id), by(cohort founder)

. generate ln_n = ln(n)

. 
end of do-file

. reghdfe manager_skill ib1985.cohort if founder , a(component_id )
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =    569,974
Absorbing 1 HDFE group                            F(   7, 569856) =       2.99
                                                  Prob > F        =     0.0039
                                                  R-squared       =     0.0007
                                                  Adj R-squared   =     0.0005
                                                  Within R-sq.    =     0.0000
                                                  Root MSE        =     1.1764

------------------------------------------------------------------------------
manager_sk~l | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      cohort |
       1990  |  -.0388691   .0314239    -1.24   0.216    -.1004589    .0227207
       1995  |  -.0427147   .0314084    -1.36   0.174    -.1042742    .0188449
       2000  |  -.0357368   .0314285    -1.14   0.256    -.0973356     .025862
       2005  |  -.0348226   .0314988    -1.11   0.269    -.0965593    .0269141
       2010  |  -.0371661   .0315407    -1.18   0.239    -.0989849    .0246527
       2015  |  -.0253115   .0318065    -0.80   0.426    -.0876512    .0370281
       2020  |  -.0092439   .0322226    -0.29   0.774    -.0723992    .0539114
             |
       _cons |   .0013607   .0312332     0.04   0.965    -.0598555    .0625769
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
 component_id |       111           0         111     |
------------------------------------------------------+

. reghdfe manager_skill ib1985.cohort if founder , a(component_id ) cluster(first_year )
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =    569,974
Absorbing 1 HDFE group                            F(   7,     35) =       8.01
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.0007
                                                  Adj R-squared   =     0.0005
                                                  Within R-sq.    =     0.0000
Number of clusters (first_year) =         36      Root MSE        =     1.1764

                            (Std. err. adjusted for 36 clusters in first_year)
------------------------------------------------------------------------------
             |               Robust
manager_sk~l | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      cohort |
       1990  |  -.0388691   .0179631    -2.16   0.037    -.0753362   -.0024021
       1995  |  -.0427147   .0176653    -2.42   0.021    -.0785772   -.0068521
       2000  |  -.0357368   .0173969    -2.05   0.047    -.0710543   -.0004193
       2005  |  -.0348226   .0172787    -2.02   0.052    -.0699002     .000255
       2010  |  -.0371661   .0174605    -2.13   0.040    -.0726128   -.0017194
       2015  |  -.0253115    .017965    -1.41   0.168    -.0617823    .0111593
       2020  |  -.0092439   .0175886    -0.53   0.603    -.0449508    .0264629
             |
       _cons |   .0013607   .0169644     0.08   0.937    -.0330789    .0358003
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
 component_id |       111           0         111     |
------------------------------------------------------+

. reghdfe manager_skill ib1985.cohort if !founder , a(component_id ) cluster(first_year )
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =    242,878
Absorbing 1 HDFE group                            F(   7,     36) =      18.21
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.0016
                                                  Adj R-squared   =     0.0011
                                                  Within R-sq.    =     0.0010
Number of clusters (first_year) =         37      Root MSE        =     1.7445

                            (Std. err. adjusted for 37 clusters in first_year)
------------------------------------------------------------------------------
             |               Robust
manager_sk~l | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      cohort |
       1990  |  -.0663266   .0301376    -2.20   0.034    -.1274485   -.0052047
       1995  |  -.1429205   .0287605    -4.97   0.000    -.2012495   -.0845915
       2000  |  -.0947088   .0282076    -3.36   0.002    -.1519164   -.0375012
       2005  |  -.0668296   .0273616    -2.44   0.020    -.1223215   -.0113377
       2010  |  -.0718893    .028848    -2.49   0.017    -.1303958   -.0133828
       2015  |   .0056147   .0289477     0.19   0.847    -.0530939    .0643234
       2020  |   .0530029   .0335087     1.58   0.122    -.0149557    .1209616
             |
       _cons |    .062771   .0263233     2.38   0.022     .0093849     .116157
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
 component_id |       111           0         111     |
------------------------------------------------------+

. reghdfe ln_n  ib1985.cohort if !founder , a(component_id ) cluster(first_year )
(MWFE estimator converged in 1 iterations)
warning: missing F statistic; dropped variables due to collinearity or too few clusters

HDFE Linear regression                            Number of obs   =    321,185
Absorbing 1 HDFE group                            F(   7,     36) =          .
Statistics robust to heteroskedasticity           Prob > F        =          .
                                                  R-squared       =     1.0000
                                                  Adj R-squared   =     1.0000
                                                  Within R-sq.    =     1.0000
Number of clusters (first_year) =         37      Root MSE        =     0.0000

                            (Std. err. adjusted for 37 clusters in first_year)
------------------------------------------------------------------------------
             |               Robust
        ln_n | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      cohort |
       1990  |   2.077967   1.15e-11  1.8e+11   0.000     2.077967    2.077967
       1995  |    2.28149   5.71e-12  4.0e+11   0.000      2.28149     2.28149
       2000  |   2.493289   1.01e-11  2.5e+11   0.000     2.493289    2.493289
       2005  |   2.631083   8.81e-12  3.0e+11   0.000     2.631083    2.631083
       2010  |   2.852353   1.10e-11  2.6e+11   0.000     2.852353    2.852353
       2015  |   2.660079   1.07e-11  2.5e+11   0.000     2.660079    2.660079
       2020  |   2.268711   1.03e-11  2.2e+11   0.000     2.268711    2.268711
             |
       _cons |     8.2247   5.17e-12  1.6e+12   0.000       8.2247      8.2247
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
 component_id |       111           0         111     |
------------------------------------------------------+

. do "code/estimate/cohort.do"

. use "temp/unfiltered.dta", clear

. merge m:1 frame_id_numeric person_id using "temp/manager_value.dta", keep(match) nogen

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                        10,224,519  
    -----------------------------------------

. 
. * for babyboom, we measure manager skills in revenue units, not as TFP
. replace manager_skill = manager_skill / chi
(8,688,171 real changes made)

. 
. BRK
command BRK is unrecognized
r(199);

end of do-file

r(199);

. su birth_year , d

                        Year of birth
-------------------------------------------------------------
      Percentiles      Smallest
 1%         1938           1915
 5%         1945           1915
10%         1949           1915       Obs          10,098,281
25%         1955           1915       Sum of wgt.    10098281

50%         1964                      Mean           1964.025
                        Largest       Std. dev.      11.67983
75%         1973           2017
90%         1979           2017       Variance       136.4183
95%         1983           2017       Skewness       .0482702
99%         1991           2017       Kurtosis       2.712018

. count if birth_year != year - age
age not found
r(111);

. count if birth_year != year - ceo_age 
  0

. do "code/estimate/cohort.do"

. use "temp/unfiltered.dta", clear

. merge m:1 frame_id_numeric person_id using "temp/manager_value.dta", keep(match) nogen

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                        10,224,519  
    -----------------------------------------

. 
. * for babyboom, we measure manager skills in revenue units, not as TFP
. replace manager_skill = manager_skill / chi
(8,688,171 real changes made)

. 
. collapse (mean) manager_skill (min) birth_year first_year = year (max) last_year = year (min) component_id (m
> ax) component_size, by(person_id founder)

. reshape wide manager_skill first_year last_year, i(person_id) j(founder)
(j = 0 1)
variable birth_year not constant within person_id
    Your data are currently long. You are performing a reshape wide. You typed something like

        . reshape wide a b, i(person_id) j(founder)

    There are variables other than a, b, person_id, founder in your data. They must be constant within
    person_id because that is the only way they can fit into wide data without loss of information.

    The variable or variables listed above are not constant within person_id. Perhaps the values are in
    error. Type reshape error for a list of the problem observations.

    Either that, or the values vary because they should vary, in which case you must either add the variables
    to the list of xij variables to be reshaped, or drop them.
r(9);

end of do-file

r(9);

. do "code/estimate/cohort.do"

. use "temp/unfiltered.dta", clear

. merge m:1 frame_id_numeric person_id using "temp/manager_value.dta", keep(match) nogen

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                        10,224,519  
    -----------------------------------------

. 
. * for babyboom, we measure manager skills in revenue units, not as TFP
. replace manager_skill = manager_skill / chi
(8,688,171 real changes made)

. 
. keep if component_id > 0
(7,505,526 observations deleted)

. 
. collapse (mean) manager_skill (min) birth_year first_year = year (max) last_year = year (min) component_id (m
> ax) component_size, by(person_id founder)

. reshape wide manager_skill first_year last_year birth_year, i(person_id) j(founder)
(j = 0 1)

Data                               Long   ->   Wide
-----------------------------------------------------------------------------
Number of observations          272,001   ->   207,279     
Number of variables                   8   ->   11          
j variable (2 values)           founder   ->   (dropped)
xij variables:
                          manager_skill   ->   manager_skill0 manager_skill1
                             first_year   ->   first_year0 first_year1
                              last_year   ->   last_year0 last_year1
                             birth_year   ->   birth_year0 birth_year1
-----------------------------------------------------------------------------

. 
. * relatively few overlap, use the first ceo spell
. egen first_year = rowmin(first_year?)

. egen last_year = rowmax(last_year?)

. egen manager_skill = rowmean(manager_skill?)
(30,044 missing values generated)

. egen birth_year = rowmin(birth_year?)

. 
. generate byte founder = first_year0 > first_year

. tabulate first_year founder

           |        founder
first_year |         0          1 |     Total
-----------+----------------------+----------
      1986 |       379          0 |       379 
      1987 |        77          0 |        77 
      1988 |       100         14 |       114 
      1989 |       485        487 |       972 
      1990 |     1,215      1,962 |     3,177 
      1991 |     1,534      3,450 |     4,984 
      1992 |     2,373      9,955 |    12,328 
      1993 |     2,044      5,405 |     7,449 
      1994 |     2,135      5,625 |     7,760 
      1995 |     2,072      4,720 |     6,792 
      1996 |     2,358      5,035 |     7,393 
      1997 |     2,667      5,399 |     8,066 
      1998 |     2,760      5,555 |     8,315 
      1999 |     2,679      3,720 |     6,399 
      2000 |     3,607      4,745 |     8,352 
      2001 |     3,096      4,583 |     7,679 
      2002 |     3,042      4,195 |     7,237 
      2003 |     3,032      3,739 |     6,771 
      2004 |     3,350      4,014 |     7,364 
      2005 |     3,497      3,223 |     6,720 
      2006 |     3,452      3,267 |     6,719 
      2007 |     3,219      2,743 |     5,962 
      2008 |     3,794      3,423 |     7,217 
      2009 |     3,377      3,356 |     6,733 
      2010 |     3,357      3,080 |     6,437 
      2011 |     3,362      2,907 |     6,269 
      2012 |     3,764      2,847 |     6,611 
      2013 |     4,995      2,661 |     7,656 
      2014 |     3,381      1,631 |     5,012 
      2015 |     3,287      1,145 |     4,432 
      2016 |     3,554      1,082 |     4,636 
      2017 |     3,454      1,036 |     4,490 
      2018 |     2,941        851 |     3,792 
      2019 |     2,760        697 |     3,457 
      2020 |     3,248        574 |     3,822 
      2021 |     2,522        513 |     3,035 
      2022 |     2,323        348 |     2,671 
-----------+----------------------+----------
     Total |    99,292    107,987 |   207,279 

. 
. generate cohort = int(first_year/5)*5

. tabulate cohort founder

           |        founder
    cohort |         0          1 |     Total
-----------+----------------------+----------
      1985 |     1,041        501 |     1,542 
      1990 |     9,301     26,397 |    35,698 
      1995 |    12,536     24,429 |    36,965 
      2000 |    16,127     21,276 |    37,403 
      2005 |    17,339     16,012 |    33,351 
      2010 |    18,859     13,126 |    31,985 
      2015 |    15,996      4,811 |    20,807 
      2020 |     8,093      1,435 |     9,528 
-----------+----------------------+----------
     Total |    99,292    107,987 |   207,279 

. 
. egen n = count(person_id), by(first_year birth_year founder)

. generate ln_n = ln(n)

. 
. * different components may have different means
. reghdfe manager_skill ib1985.cohort if founder , a(component_id ) cluster(first_year )
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =     95,957
Absorbing 1 HDFE group                            F(   7,     34) =       2.06
Statistics robust to heteroskedasticity           Prob > F        =     0.0756
                                                  R-squared       =     0.0005
                                                  Adj R-squared   =    -0.0007
                                                  Within R-sq.    =     0.0001
Number of clusters (first_year) =         35      Root MSE        =     2.5991

                            (Std. err. adjusted for 35 clusters in first_year)
------------------------------------------------------------------------------
             |               Robust
manager_sk~l | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      cohort |
       1990  |  -.0397775   .0481915    -0.83   0.415    -.1377144    .0581594
       1995  |  -.0466482   .0503585    -0.93   0.361     -.148989    .0556927
       2000  |  -.0005042   .0487426    -0.01   0.992    -.0995611    .0985527
       2005  |  -.0010522   .0486171    -0.02   0.983     -.099854    .0977496
       2010  |   .0135868   .0493403     0.28   0.785    -.0866847    .1138583
       2015  |   .0193495    .057569     0.34   0.739    -.0976448    .1363437
       2020  |   .0797014   .0813929     0.98   0.334    -.0857089    .2451117
             |
       _cons |  -.0618856   .0464518    -1.33   0.192     -.156287    .0325157
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
 component_id |       110           0         110     |
------------------------------------------------------+

. reghdfe manager_skill ib1985.cohort if !founder , a(component_id ) cluster(first_year )
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =     81,278
Absorbing 1 HDFE group                            F(   7,     36) =      31.77
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.0019
                                                  Adj R-squared   =     0.0005
                                                  Within R-sq.    =     0.0013
Number of clusters (first_year) =         37      Root MSE        =     2.7260

                            (Std. err. adjusted for 37 clusters in first_year)
------------------------------------------------------------------------------
             |               Robust
manager_sk~l | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      cohort |
       1990  |  -.0724413   .0436491    -1.66   0.106    -.1609658    .0160832
       1995  |  -.2308893   .0456896    -5.05   0.000    -.3235521   -.1382266
       2000  |  -.1182907   .0342554    -3.45   0.001    -.1877638   -.0488176
       2005  |   -.093122   .0316909    -2.94   0.006    -.1573941   -.0288499
       2010  |  -.0379074   .0410692    -0.92   0.362    -.1211997    .0453849
       2015  |   .0299762   .0375464     0.80   0.430    -.0461715    .1061239
       2020  |   .1788674   .0360863     4.96   0.000      .105681    .2520538
             |
       _cons |    .103714   .0303381     3.42   0.002     .0421855    .1652425
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
 component_id |       110           0         110     |
------------------------------------------------------+

. 
end of do-file

. reghdfe manager_skill ib1985.cohort birth_year if !founder , a(component_id ) cluster(first_year )
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =     81,278
Absorbing 1 HDFE group                            F(   8,     36) =      59.19
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.0022
                                                  Adj R-squared   =     0.0008
                                                  Within R-sq.    =     0.0017
Number of clusters (first_year) =         37      Root MSE        =     2.7256

                            (Std. err. adjusted for 37 clusters in first_year)
------------------------------------------------------------------------------
             |               Robust
manager_sk~l | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      cohort |
       1990  |  -.0963582   .0469117    -2.05   0.047    -.1914995   -.0012168
       1995  |  -.2815277   .0517591    -5.44   0.000    -.3865001   -.1765553
       2000  |  -.1922654   .0429509    -4.48   0.000     -.279374   -.1051569
       2005  |   -.187117   .0436788    -4.28   0.000    -.2757018   -.0985322
       2010  |  -.1446529   .0508996    -2.84   0.007    -.2478821   -.0414238
       2015  |  -.0984131   .0544093    -1.81   0.079    -.2087602    .0119341
       2020  |   .0441618   .0529612     0.83   0.410    -.0632486    .1515721
             |
  birth_year |   .0047947   .0012448     3.85   0.000     .0022702    .0073193
       _cons |   -9.24318   2.427357    -3.81   0.001    -14.16609   -4.320272
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
 component_id |       110           0         110     |
------------------------------------------------------+

. 
. reghdfe manager_skill ib1985.cohort i.birth_year if !founder , a(component_id ) cluster(first_year )
(MWFE estimator converged in 1 iterations)
warning: missing F statistic; dropped variables due to collinearity or too few clusters

HDFE Linear regression                            Number of obs   =     81,278
Absorbing 1 HDFE group                            F(  95,     36) =          .
Statistics robust to heteroskedasticity           Prob > F        =          .
                                                  R-squared       =     0.0034
                                                  Adj R-squared   =     0.0009
                                                  Within R-sq.    =     0.0028
Number of clusters (first_year) =         37      Root MSE        =     2.7255

                            (Std. err. adjusted for 37 clusters in first_year)
------------------------------------------------------------------------------
             |               Robust
manager_sk~l | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      cohort |
       1990  |  -.0920035    .052298    -1.76   0.087    -.1980687    .0140618
       1995  |  -.2686867   .0501349    -5.36   0.000     -.370365   -.1670084
       2000  |  -.1877275    .043983    -4.27   0.000    -.2769291    -.098526
       2005  |   -.174055   .0482118    -3.61   0.001    -.2718331   -.0762769
       2010  |  -.1281774   .0467634    -2.74   0.009    -.2230179   -.0333368
       2015  |  -.0731328   .0519987    -1.41   0.168    -.1785912    .0323255
       2020  |   .0798764   .0543029     1.47   0.150    -.0302549    .1900078
             |
  birth_year |
       1920  |   5.469758   2.199444     2.49   0.018     1.009078    9.930437
       1922  |   .6366663   2.685947     0.24   0.814    -4.810688     6.08402
       1923  |   5.404356   2.380093     2.27   0.029     .5773036    10.23141
       1924  |   4.261736   2.213831     1.93   0.062    -.2281222    8.751594
       1925  |   2.546643   2.383293     1.07   0.292    -2.286899    7.380186
       1926  |   3.393953   2.237422     1.52   0.138    -1.143749    7.931654
       1927  |   3.293919   2.253837     1.46   0.153    -1.277074    7.864912
       1928  |   3.124936   2.248938     1.39   0.173    -1.436121    7.685993
       1929  |   3.228755   2.365305     1.37   0.181    -1.568305    8.025816
       1930  |    3.36136   2.231948     1.51   0.141    -1.165241    7.887961
       1931  |   2.554732   2.218662     1.15   0.257    -1.944922    7.054386
       1932  |   2.899486   2.212317     1.31   0.198    -1.587302    7.386273
       1933  |   3.111489   2.236374     1.39   0.173    -1.424087    7.647066
       1934  |   3.248318   2.196559     1.48   0.148     -1.20651    7.703147
       1935  |   3.069276   2.152086     1.43   0.162    -1.295356    7.433909
       1936  |   3.127492   2.194832     1.42   0.163    -1.323835    7.578818
       1937  |   3.054621   2.185137     1.40   0.171    -1.377042    7.486284
       1938  |   3.200428   2.199026     1.46   0.154    -1.259402    7.660259
       1939  |   2.847447   2.245889     1.27   0.213    -1.707427    7.402322
       1940  |    2.73428   2.189904     1.25   0.220    -1.707051    7.175612
       1941  |   3.031207   2.182091     1.39   0.173    -1.394279    7.456694
       1942  |   3.234721   2.229718     1.45   0.156    -1.287357      7.7568
       1943  |   3.146721   2.235358     1.41   0.168    -1.386795    7.680238
       1944  |   3.030437   2.202734     1.38   0.177    -1.436915    7.497788
       1945  |   3.159096   2.197148     1.44   0.159    -1.296926    7.615118
       1946  |   3.010751   2.218942     1.36   0.183    -1.489472    7.510973
       1947  |   3.099203   2.209214     1.40   0.169    -1.381289    7.579696
       1948  |   3.075681   2.177678     1.41   0.166    -1.340855    7.492216
       1949  |   3.266323   2.207721     1.48   0.148    -1.211143     7.74379
       1950  |   3.211843   2.204725     1.46   0.154    -1.259546    7.683232
       1951  |   3.299011   2.206696     1.50   0.144    -1.176375    7.774397
       1952  |   3.219767   2.199076     1.46   0.152    -1.240165      7.6797
       1953  |   3.264673   2.210252     1.48   0.148    -1.217926    7.747271
       1954  |   3.208596   2.213364     1.45   0.156    -1.280314    7.697507
       1955  |   3.279915   2.205781     1.49   0.146    -1.193616    7.753446
       1956  |   3.278397   2.209026     1.48   0.146    -1.201717     7.75851
       1957  |   3.306564   2.206564     1.50   0.143    -1.168556    7.781684
       1958  |   3.362429   2.201019     1.53   0.135    -1.101444    7.826302
       1959  |   3.200915   2.210486     1.45   0.156    -1.282159    7.683989
       1960  |    3.16457   2.219198     1.43   0.162    -1.336172    7.665311
       1961  |   3.208753   2.203346     1.46   0.154    -1.259841    7.677346
       1962  |   3.322276   2.202111     1.51   0.140    -1.143812    7.788363
       1963  |    3.22398   2.195015     1.47   0.151    -1.227717    7.675677
       1964  |   3.204729   2.208976     1.45   0.156    -1.275282     7.68474
       1965  |   3.362245   2.195992     1.53   0.134    -1.091433    7.815923
       1966  |   3.289336   2.202471     1.49   0.144    -1.177483    7.756155
       1967  |    3.27914   2.184385     1.50   0.142    -1.150998    7.709278
       1968  |   3.172982   2.202947     1.44   0.158    -1.294801    7.640766
       1969  |   3.303883   2.215482     1.49   0.145    -1.189322    7.797088
       1970  |   3.298139   2.200984     1.50   0.143    -1.165663    7.761942
       1971  |     3.3147   2.196488     1.51   0.140    -1.139984    7.769383
       1972  |    3.34013   2.220853     1.50   0.141    -1.163969     7.84423
       1973  |   3.233555   2.185169     1.48   0.148    -1.198174    7.665284
       1974  |   3.287581   2.204445     1.49   0.145    -1.183241    7.758403
       1975  |   3.324175   2.205843     1.51   0.141    -1.149482    7.797832
       1976  |   3.403109   2.200594     1.55   0.131    -1.059902    7.866121
       1977  |   3.417357   2.197391     1.56   0.129    -1.039157    7.873872
       1978  |   3.488606   2.205586     1.58   0.122    -.9845303    7.961743
       1979  |   3.352163   2.205677     1.52   0.137    -1.121157    7.825484
       1980  |    3.33316   2.218637     1.50   0.142    -1.166444    7.832764
       1981  |   3.309414    2.19481     1.51   0.140    -1.141866    7.760695
       1982  |   3.296551   2.213413     1.49   0.145    -1.192459    7.785561
       1983  |    3.32331   2.204814     1.51   0.140     -1.14826    7.794879
       1984  |   3.449255   2.186561     1.58   0.123     -.985296    7.883805
       1985  |   3.408518   2.194597     1.55   0.129    -1.042331    7.859367
       1986  |   3.371961   2.175398     1.55   0.130    -1.039951    7.783873
       1987  |   3.303087   2.192247     1.51   0.141    -1.142997     7.74917
       1988  |   3.178377   2.205937     1.44   0.158    -1.295471    7.652226
       1989  |   3.276241   2.220241     1.48   0.149    -1.226616    7.779098
       1990  |   3.309651   2.204563     1.50   0.142    -1.161409    7.780711
       1991  |   3.403795   2.207695     1.54   0.132    -1.073618    7.881208
       1992  |   3.110853   2.198177     1.42   0.166    -1.347256    7.568962
       1993  |   3.315019    2.18573     1.52   0.138    -1.117848    7.747886
       1994  |   3.205637   2.271672     1.41   0.167    -1.401526    7.812801
       1995  |   3.657739   2.217205     1.65   0.108    -.8389618     8.15444
       1996  |   3.238244   2.200091     1.47   0.150    -1.223748    7.700235
       1997  |   3.433443   2.204335     1.56   0.128    -1.037155    7.904041
       1998  |   3.496634   2.200495     1.59   0.121    -.9661758    7.959445
       1999  |    3.39861   2.209206     1.54   0.133    -1.081868    7.879088
       2000  |   3.667231   2.220157     1.65   0.107     -.835455    8.169918
       2001  |   3.271474   2.205843     1.48   0.147    -1.202183     7.74513
       2002  |   2.465366    2.26225     1.09   0.283     -2.12269    7.053421
       2003  |   2.289522   2.205037     1.04   0.306    -2.182501    6.761545
       2004  |   2.523034   2.201486     1.15   0.259    -1.941787    6.987854
       2007  |   3.446058   2.199444     1.57   0.126    -1.014621    7.906738
       2008  |   4.006721   2.244422     1.79   0.083    -.5451782    8.558619
       2009  |   3.865989   2.201725     1.76   0.088    -.5993156    8.331293
       2015  |   3.698731   2.201423     1.68   0.102     -.765961    8.163424
             |
       _cons |  -3.105649   2.207027    -1.41   0.168    -7.581707    1.370408
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
 component_id |       110           0         110     |
------------------------------------------------------+

. reghdfe manager_skill ib1985.first_year  i.birth_year if !founder , a(component_id ) cluster(first_year )
(MWFE estimator converged in 1 iterations)
note: 2022.first_year omitted because of collinearity
warning: missing F statistic; dropped variables due to collinearity or too few clusters

HDFE Linear regression                            Number of obs   =     81,278
Absorbing 1 HDFE group                            F( 124,     36) =          .
Statistics robust to heteroskedasticity           Prob > F        =          .
                                                  R-squared       =     0.0037
                                                  Adj R-squared   =     0.0008
                                                  Within R-sq.    =     0.0032
Number of clusters (first_year) =         37      Root MSE        =     2.7255

                            (Std. err. adjusted for 37 clusters in first_year)
------------------------------------------------------------------------------
             |               Robust
manager_sk~l | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
  first_year |
       1985  |          0  (empty)
       1986  |  -.0357506   .0729982    -0.49   0.627    -.1837978    .1122967
       1987  |  -.3374938   .0409429    -8.24   0.000    -.4205299   -.2544577
       1988  |  -.2205415   .0430622    -5.12   0.000    -.3078757   -.1332072
       1989  |  -.1434482   .0455748    -3.15   0.003    -.2358781   -.0510183
       1990  |  -.2083017   .0488742    -4.26   0.000    -.3074232   -.1091801
       1991  |  -.1833686   .0538872    -3.40   0.002    -.2926568   -.0740803
       1992  |  -.2490325   .0455224    -5.47   0.000    -.3413561   -.1567089
       1993  |  -.1029676   .0537668    -1.92   0.063    -.2120118    .0060767
       1994  |  -.3349034   .0491531    -6.81   0.000    -.4345906   -.2352162
       1995  |  -.3853792   .0398518    -9.67   0.000    -.4662025    -.304556
       1996  |  -.2867016   .0466865    -6.14   0.000    -.3813863   -.1920169
       1997  |  -.4531124   .0504497    -8.98   0.000    -.5554291   -.3507956
       1998  |  -.4595247   .0416202   -11.04   0.000    -.5439343    -.375115
       1999  |  -.3855592   .0314169   -12.27   0.000    -.4492756   -.3218428
       2000  |  -.3277951   .0404716    -8.10   0.000    -.4098754   -.2457148
       2001  |  -.3567915   .0448191    -7.96   0.000     -.447689   -.2658941
       2002  |  -.2776135   .0355628    -7.81   0.000    -.3497382   -.2054889
       2003  |   -.359693   .0370694    -9.70   0.000    -.4348732   -.2845127
       2004  |  -.2644208   .0306819    -8.62   0.000    -.3266466   -.2021951
       2005  |  -.3435412   .0308464   -11.14   0.000    -.4061006   -.2809819
       2006  |  -.2472847   .0396416    -6.24   0.000    -.3276817   -.1668877
       2007  |  -.2874308   .0310338    -9.26   0.000    -.3503702   -.2244915
       2008  |  -.3093879   .0262581   -11.78   0.000    -.3626418   -.2561339
       2009  |  -.3223378    .024442   -13.19   0.000    -.3719084   -.2727671
       2010  |  -.1719076   .0214829    -8.00   0.000     -.215477   -.1283383
       2011  |  -.2770693   .0193893   -14.29   0.000    -.3163926    -.237746
       2012  |  -.2259811   .0195939   -11.53   0.000    -.2657193   -.1862429
       2013  |  -.3321712   .0196792   -16.88   0.000    -.3720824     -.29226
       2014  |   -.247684   .0155142   -15.96   0.000    -.2791483   -.2162197
       2015  |  -.1754939   .0151071   -11.62   0.000    -.2061324   -.1448554
       2016  |  -.2459551   .0124846   -19.70   0.000    -.2712751    -.220635
       2017  |  -.2152823    .010098   -21.32   0.000     -.235762   -.1948027
       2018  |  -.1083026   .0088056   -12.30   0.000    -.1261612    -.090444
       2019  |   -.258426    .007285   -35.47   0.000    -.2732006   -.2436514
       2020  |  -.0766998   .0097951    -7.83   0.000    -.0965653   -.0568344
       2021  |  -.0481849   .0047378   -10.17   0.000    -.0577936   -.0385762
       2022  |          0  (omitted)
             |
  birth_year |
       1920  |   5.416691   2.224796     2.43   0.020     .9045964    9.928786
       1922  |   .6033415   2.716676     0.22   0.826    -4.906333    6.113016
       1923  |   5.423703   2.399085     2.26   0.030     .5581342    10.28927
       1924  |   4.219719   2.241999     1.88   0.068    -.3272651    8.766703
       1925  |    2.49474   2.405593     1.04   0.307    -2.384029     7.37351
       1926  |   3.385152   2.261003     1.50   0.143    -1.200375    7.970679
       1927  |   3.262061   2.281339     1.43   0.161    -1.364709    7.888831
       1928  |   3.121787    2.27452     1.37   0.178    -1.491152    7.734727
       1929  |   3.196951   2.388539     1.34   0.189    -1.647231    8.041133
       1930  |   3.355787   2.254236     1.49   0.145    -1.216015     7.92759
       1931  |    2.53273    2.24536     1.13   0.267    -2.021072    7.086531
       1932  |   2.874824   2.237738     1.28   0.207    -1.663519    7.413167
       1933  |   3.099547   2.260439     1.37   0.179    -1.484835    7.683929
       1934  |   3.234626   2.222393     1.46   0.154    -1.272597    7.741848
       1935  |    3.04393   2.175817     1.40   0.170    -1.368831    7.456692
       1936  |   3.103261   2.217523     1.40   0.170    -1.394085    7.600607
       1937  |     3.0329   2.208891     1.37   0.178    -1.446939    7.512739
       1938  |   3.180666   2.221523     1.43   0.161    -1.324792    7.686124
       1939  |    2.82381   2.269982     1.24   0.222    -1.779926    7.427546
       1940  |   2.707143   2.214722     1.22   0.230    -1.784521    7.198807
       1941  |    3.00433   2.205905     1.36   0.182    -1.469453    7.478113
       1942  |    3.19209   2.254453     1.42   0.165    -1.380153    7.764332
       1943  |   3.121916   2.260041     1.38   0.176     -1.46166    7.705493
       1944  |   3.007387   2.227733     1.35   0.185    -1.510665    7.525438
       1945  |   3.130163   2.221955     1.41   0.167    -1.376172    7.636497
       1946  |   2.989726   2.243081     1.33   0.191    -1.559454    7.538905
       1947  |   3.076873   2.234073     1.38   0.177    -1.454038    7.607783
       1948  |   3.051936   2.201946     1.39   0.174    -1.413817    7.517689
       1949  |   3.250675   2.232356     1.46   0.154    -1.276752    7.778102
       1950  |   3.197186   2.229239     1.43   0.160    -1.323919    7.718292
       1951  |   3.280518   2.231109     1.47   0.150    -1.244381    7.805418
       1952  |   3.193773    2.22227     1.44   0.159    -1.313199    7.700745
       1953  |   3.229765   2.235247     1.44   0.157    -1.303526    7.763056
       1954  |   3.198098   2.239043     1.43   0.162    -1.342892    7.739088
       1955  |   3.207844   2.230227     1.44   0.159    -1.315267    7.730955
       1956  |   3.308811   2.234661     1.48   0.147    -1.223292    7.840915
       1957  |   3.278457   2.236061     1.47   0.151    -1.256484    7.813398
       1958  |   3.287283   2.228791     1.47   0.149    -1.232914     7.80748
       1959  |   3.208969    2.24122     1.43   0.161    -1.336436    7.754374
       1960  |   3.173256   2.236967     1.42   0.165    -1.363524    7.710036
       1961  |   3.181507   2.230997     1.43   0.162    -1.343166    7.706179
       1962  |   3.307169   2.226887     1.49   0.146    -1.209167    7.823506
       1963  |   3.221577   2.218642     1.45   0.155    -1.278039    7.721192
       1964  |   3.165406   2.234928     1.42   0.165    -1.367237    7.698049
       1965  |   3.360933   2.219671     1.51   0.139     -1.14077    7.862635
       1966  |   3.246382   2.226757     1.46   0.154    -1.269691    7.762454
       1967  |   3.273306   2.206345     1.48   0.147     -1.20137    7.747981
       1968  |   3.133161   2.227637     1.41   0.168    -1.384697    7.651019
       1969  |   3.278919   2.240886     1.46   0.152    -1.265809    7.823647
       1970  |   3.277576   2.225284     1.47   0.149    -1.235509    7.790661
       1971  |   3.295413   2.220447     1.48   0.146    -1.207863    7.798688
       1972  |   3.315117   2.244898     1.48   0.148    -1.237747    7.867981
       1973  |   3.210451   2.209123     1.45   0.155    -1.269858    7.690759
       1974  |   3.263071    2.22857     1.46   0.152    -1.256678    7.782821
       1975  |   3.301486   2.230009     1.48   0.147    -1.221182    7.824155
       1976  |   3.379626   2.224729     1.52   0.137    -1.132333    7.891586
       1977  |   3.394413    2.22158     1.53   0.135    -1.111161    7.899986
       1978  |   3.464467   2.229708     1.55   0.129    -1.057591    7.986525
       1979  |   3.329251   2.230184     1.49   0.144    -1.193772    7.852273
       1980  |   3.310187   2.242768     1.48   0.149    -1.238357    7.858731
       1981  |   3.284288   2.219541     1.48   0.148     -1.21715    7.785726
       1982  |   3.274053   2.238081     1.46   0.152    -1.264985    7.813091
       1983  |   3.301753   2.229434     1.48   0.147    -1.219748    7.823254
       1984  |   3.426197   2.210831     1.55   0.130    -1.057577     7.90997
       1985  |    3.38618   2.218708     1.53   0.136    -1.113568    7.885929
       1986  |   3.350497   2.199675     1.52   0.136     -1.11065    7.811645
       1987  |   3.279037   2.216585     1.48   0.148    -1.216406    7.774481
       1988  |   3.155046   2.230307     1.41   0.166    -1.368226    7.678318
       1989  |    3.25675   2.244596     1.45   0.155    -1.295501    7.809001
       1990  |    3.28954   2.228617     1.48   0.149    -1.230305    7.809386
       1991  |    3.38511   2.231712     1.52   0.138    -1.141012    7.911231
       1992  |   3.089298   2.222196     1.39   0.173    -1.417525     7.59612
       1993  |   3.291849    2.20968     1.49   0.145    -1.189588    7.773287
       1994  |   3.189158   2.295166     1.39   0.173    -1.465654    7.843971
       1995  |   3.632125   2.241104     1.62   0.114    -.9130444    8.177295
       1996  |   3.213439   2.223936     1.44   0.157    -1.296913    7.723791
       1997  |   3.411708   2.229127     1.53   0.135    -1.109172    7.932587
       1998  |   3.470713   2.225228     1.56   0.128    -1.042259    7.983685
       1999  |   3.358563   2.233136     1.50   0.141    -1.170447    7.887573
       2000  |   3.642709   2.245448     1.62   0.113    -.9112708    8.196689
       2001  |   3.250346   2.230528     1.46   0.154    -1.273374    7.774066
       2002  |   2.425443   2.284794     1.06   0.296    -2.208334     7.05922
       2003  |   2.227706   2.228574     1.00   0.324    -2.292053    6.747464
       2004  |    2.45204   2.224895     1.10   0.278    -2.060257    6.964336
       2007  |    3.44408   2.225072     1.55   0.130    -1.068576    7.956735
       2008  |   4.013087   2.266297     1.77   0.085    -.5831778    8.609351
       2009  |   3.887084   2.224397     1.75   0.089    -.6242025    8.398371
       2015  |   3.720683   2.225232     1.67   0.103    -.7922966    8.233663
             |
       _cons |  -2.954799   2.225198    -1.33   0.193    -7.467709    1.558111
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
 component_id |       110           0         110     |
------------------------------------------------------+

. reghdfe manager_skill ib1986.first_year  i.birth_year if !founder , a(component_id ) cluster(first_year )
(MWFE estimator converged in 1 iterations)
warning: missing F statistic; dropped variables due to collinearity or too few clusters

HDFE Linear regression                            Number of obs   =     81,278
Absorbing 1 HDFE group                            F( 124,     36) =          .
Statistics robust to heteroskedasticity           Prob > F        =          .
                                                  R-squared       =     0.0037
                                                  Adj R-squared   =     0.0008
                                                  Within R-sq.    =     0.0032
Number of clusters (first_year) =         37      Root MSE        =     2.7255

                            (Std. err. adjusted for 37 clusters in first_year)
------------------------------------------------------------------------------
             |               Robust
manager_sk~l | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
  first_year |
       1987  |  -.3017432   .0681849    -4.43   0.000    -.4400287   -.1634578
       1988  |  -.1847909   .0730868    -2.53   0.016    -.3330178    -.036564
       1989  |  -.1076976   .0741044    -1.45   0.155    -.2579883    .0425931
       1990  |  -.1725511   .0651098    -2.65   0.012       -.3046   -.0405022
       1991  |   -.147618   .0599979    -2.46   0.019    -.2692994   -.0259366
       1992  |  -.2132819   .0684394    -3.12   0.004    -.3520834   -.0744805
       1993  |   -.067217    .068073    -0.99   0.330    -.2052755    .0708415
       1994  |  -.2991528   .0729804    -4.10   0.000    -.4471639   -.1511417
       1995  |  -.3496287   .0767715    -4.55   0.000    -.5053286   -.1939288
       1996  |   -.250951    .071292    -3.52   0.001    -.3955378   -.1063642
       1997  |  -.4173618   .0749404    -5.57   0.000    -.5693481   -.2653755
       1998  |  -.4237741    .066013    -6.42   0.000    -.5576546   -.2898936
       1999  |  -.3498086   .0703328    -4.97   0.000    -.4924501   -.2071671
       2000  |  -.2920445   .0727563    -4.01   0.000    -.4396011   -.1444879
       2001  |   -.321041   .0769893    -4.17   0.000    -.4771825   -.1648994
       2002  |   -.241863   .0724696    -3.34   0.002    -.3888381   -.0948878
       2003  |  -.3239424   .0731766    -4.43   0.000    -.4723515   -.1755334
       2004  |  -.2286703    .061723    -3.70   0.001    -.3538504   -.1034902
       2005  |  -.3077907   .0727709    -4.23   0.000     -.455377   -.1602044
       2006  |  -.2115342   .0733059    -2.89   0.007    -.3602054   -.0628629
       2007  |  -.2516803   .0695812    -3.62   0.001    -.3927975   -.1105631
       2008  |  -.2736373   .0703355    -3.89   0.000    -.4162843   -.1309903
       2009  |  -.2865872   .0642792    -4.46   0.000    -.4169514    -.156223
       2010  |  -.1361571   .0666409    -2.04   0.048    -.2713112    -.001003
       2011  |  -.2413187   .0674017    -3.58   0.001    -.3780157   -.1046217
       2012  |  -.1902305     .06627    -2.87   0.007    -.3246323   -.0558288
       2013  |  -.2964207   .0663388    -4.47   0.000    -.4309619   -.1618794
       2014  |  -.2119334   .0677979    -3.13   0.003     -.349434   -.0744328
       2015  |  -.1397433   .0681301    -2.05   0.048    -.2779175   -.0015691
       2016  |  -.2102045   .0685594    -3.07   0.004    -.3492493   -.0711597
       2017  |  -.1795318   .0687126    -2.61   0.013    -.3188873   -.0401762
       2018  |  -.0725521   .0697074    -1.04   0.305    -.2139252    .0688211
       2019  |  -.2226755   .0696226    -3.20   0.003    -.3638766   -.0814743
       2020  |  -.0409493   .0689457    -0.59   0.556    -.1807776    .0988791
       2021  |  -.0124343   .0714628    -0.17   0.863    -.1573675    .1324989
       2022  |   .0357506   .0729982     0.49   0.627    -.1122967    .1837978
             |
  birth_year |
       1920  |   5.416691   2.224796     2.43   0.020     .9045964    9.928786
       1922  |   .6033415   2.716676     0.22   0.826    -4.906333    6.113016
       1923  |   5.423703   2.399085     2.26   0.030     .5581342    10.28927
       1924  |   4.219719   2.241999     1.88   0.068    -.3272651    8.766703
       1925  |    2.49474   2.405593     1.04   0.307    -2.384029     7.37351
       1926  |   3.385152   2.261003     1.50   0.143    -1.200375    7.970679
       1927  |   3.262061   2.281339     1.43   0.161    -1.364709    7.888831
       1928  |   3.121787    2.27452     1.37   0.178    -1.491152    7.734727
       1929  |   3.196951   2.388539     1.34   0.189    -1.647231    8.041133
       1930  |   3.355787   2.254236     1.49   0.145    -1.216015     7.92759
       1931  |    2.53273    2.24536     1.13   0.267    -2.021072    7.086531
       1932  |   2.874824   2.237738     1.28   0.207    -1.663519    7.413167
       1933  |   3.099547   2.260439     1.37   0.179    -1.484835    7.683929
       1934  |   3.234626   2.222393     1.46   0.154    -1.272597    7.741848
       1935  |    3.04393   2.175817     1.40   0.170    -1.368831    7.456692
       1936  |   3.103261   2.217523     1.40   0.170    -1.394085    7.600607
       1937  |     3.0329   2.208891     1.37   0.178    -1.446939    7.512739
       1938  |   3.180666   2.221523     1.43   0.161    -1.324792    7.686124
       1939  |    2.82381   2.269982     1.24   0.222    -1.779926    7.427546
       1940  |   2.707143   2.214722     1.22   0.230    -1.784521    7.198807
       1941  |    3.00433   2.205905     1.36   0.182    -1.469453    7.478113
       1942  |    3.19209   2.254453     1.42   0.165    -1.380153    7.764332
       1943  |   3.121916   2.260041     1.38   0.176     -1.46166    7.705493
       1944  |   3.007387   2.227733     1.35   0.185    -1.510665    7.525438
       1945  |   3.130163   2.221955     1.41   0.167    -1.376172    7.636497
       1946  |   2.989726   2.243081     1.33   0.191    -1.559454    7.538905
       1947  |   3.076873   2.234073     1.38   0.177    -1.454038    7.607783
       1948  |   3.051936   2.201946     1.39   0.174    -1.413817    7.517689
       1949  |   3.250675   2.232356     1.46   0.154    -1.276752    7.778102
       1950  |   3.197186   2.229239     1.43   0.160    -1.323919    7.718292
       1951  |   3.280518   2.231109     1.47   0.150    -1.244381    7.805418
       1952  |   3.193773    2.22227     1.44   0.159    -1.313199    7.700745
       1953  |   3.229765   2.235247     1.44   0.157    -1.303526    7.763056
       1954  |   3.198098   2.239043     1.43   0.162    -1.342892    7.739088
       1955  |   3.207844   2.230227     1.44   0.159    -1.315267    7.730955
       1956  |   3.308811   2.234661     1.48   0.147    -1.223292    7.840915
       1957  |   3.278457   2.236061     1.47   0.151    -1.256484    7.813398
       1958  |   3.287283   2.228791     1.47   0.149    -1.232914     7.80748
       1959  |   3.208969    2.24122     1.43   0.161    -1.336436    7.754374
       1960  |   3.173256   2.236967     1.42   0.165    -1.363524    7.710036
       1961  |   3.181507   2.230997     1.43   0.162    -1.343166    7.706179
       1962  |   3.307169   2.226887     1.49   0.146    -1.209167    7.823506
       1963  |   3.221577   2.218642     1.45   0.155    -1.278039    7.721192
       1964  |   3.165406   2.234928     1.42   0.165    -1.367237    7.698049
       1965  |   3.360933   2.219671     1.51   0.139     -1.14077    7.862635
       1966  |   3.246382   2.226757     1.46   0.154    -1.269691    7.762454
       1967  |   3.273306   2.206345     1.48   0.147     -1.20137    7.747981
       1968  |   3.133161   2.227637     1.41   0.168    -1.384697    7.651019
       1969  |   3.278919   2.240886     1.46   0.152    -1.265809    7.823647
       1970  |   3.277576   2.225284     1.47   0.149    -1.235509    7.790661
       1971  |   3.295413   2.220447     1.48   0.146    -1.207863    7.798688
       1972  |   3.315117   2.244898     1.48   0.148    -1.237747    7.867981
       1973  |   3.210451   2.209123     1.45   0.155    -1.269858    7.690759
       1974  |   3.263071    2.22857     1.46   0.152    -1.256678    7.782821
       1975  |   3.301486   2.230009     1.48   0.147    -1.221182    7.824155
       1976  |   3.379626   2.224729     1.52   0.137    -1.132333    7.891586
       1977  |   3.394413    2.22158     1.53   0.135    -1.111161    7.899986
       1978  |   3.464467   2.229708     1.55   0.129    -1.057591    7.986525
       1979  |   3.329251   2.230184     1.49   0.144    -1.193772    7.852273
       1980  |   3.310187   2.242768     1.48   0.149    -1.238357    7.858731
       1981  |   3.284288   2.219541     1.48   0.148     -1.21715    7.785726
       1982  |   3.274053   2.238081     1.46   0.152    -1.264985    7.813091
       1983  |   3.301753   2.229434     1.48   0.147    -1.219748    7.823254
       1984  |   3.426197   2.210831     1.55   0.130    -1.057577     7.90997
       1985  |    3.38618   2.218708     1.53   0.136    -1.113568    7.885929
       1986  |   3.350497   2.199675     1.52   0.136     -1.11065    7.811645
       1987  |   3.279037   2.216585     1.48   0.148    -1.216406    7.774481
       1988  |   3.155046   2.230307     1.41   0.166    -1.368226    7.678318
       1989  |    3.25675   2.244596     1.45   0.155    -1.295501    7.809001
       1990  |    3.28954   2.228617     1.48   0.149    -1.230305    7.809386
       1991  |    3.38511   2.231712     1.52   0.138    -1.141012    7.911231
       1992  |   3.089298   2.222196     1.39   0.173    -1.417525     7.59612
       1993  |   3.291849    2.20968     1.49   0.145    -1.189588    7.773287
       1994  |   3.189158   2.295166     1.39   0.173    -1.465654    7.843971
       1995  |   3.632125   2.241104     1.62   0.114    -.9130444    8.177295
       1996  |   3.213439   2.223936     1.44   0.157    -1.296913    7.723791
       1997  |   3.411708   2.229127     1.53   0.135    -1.109172    7.932587
       1998  |   3.470713   2.225228     1.56   0.128    -1.042259    7.983685
       1999  |   3.358563   2.233136     1.50   0.141    -1.170447    7.887573
       2000  |   3.642709   2.245448     1.62   0.113    -.9112708    8.196689
       2001  |   3.250346   2.230528     1.46   0.154    -1.273374    7.774066
       2002  |   2.425443   2.284794     1.06   0.296    -2.208334     7.05922
       2003  |   2.227706   2.228574     1.00   0.324    -2.292053    6.747464
       2004  |    2.45204   2.224895     1.10   0.278    -2.060257    6.964336
       2007  |    3.44408   2.225072     1.55   0.130    -1.068576    7.956735
       2008  |   4.013087   2.266297     1.77   0.085    -.5831778    8.609351
       2009  |   3.887084   2.224397     1.75   0.089    -.6242025    8.398371
       2015  |   3.720683   2.225232     1.67   0.103    -.7922966    8.233663
             |
       _cons |   -2.99055   2.236444    -1.34   0.190    -7.526268    1.545168
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
 component_id |       110           0         110     |
------------------------------------------------------+

. reghdfe ln_n  ib1986.first_year  i.birth_year if !founder , a(component_id ) cluster(first_year )
(MWFE estimator converged in 1 iterations)
warning: missing F statistic; dropped variables due to collinearity or too few clusters
warning: variance matrix is nonsymmetric or highly singular.

HDFE Linear regression                            Number of obs   =     99,292
Absorbing 1 HDFE group                            F( 126,     36) =          .
Statistics robust to heteroskedasticity           Prob > F        =          .
                                                  R-squared       =     0.3534
                                                  Adj R-squared   =     0.3518
                                                  Within R-sq.    =     0.3524
Number of clusters (first_year) =         37      Root MSE        =     1.1514

                            (Std. err. adjusted for 37 clusters in first_year)
------------------------------------------------------------------------------
             |               Robust
        ln_n | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
  first_year |
       1987  |  -2.035587          .        .       .            .           .
       1988  |  -1.869122          .        .       .            .           .
       1989  |  -.2072658          .        .       .            .           .
       1990  |   .3828993          .        .       .            .           .
       1991  |   .6270623          .        .       .            .           .
       1992  |   .6314862          .        .       .            .           .
       1993  |   .6936685          .        .       .            .           .
       1994  |   .4983568          .        .       .            .           .
       1995  |   .3508564          .        .       .            .           .
       1996  |   .3427223          .        .       .            .           .
       1997  |   .4161174          .        .       .            .           .
       1998  |   .3054953          .        .       .            .           .
       1999  |    .233973          .        .       .            .           .
       2000  |   .3584192          .        .       .            .           .
       2001  |   .2724972          .        .       .            .           .
       2002  |   .2348031          .        .       .            .           .
       2003  |   .2073846          .        .       .            .           .
       2004  |    .264547          .        .       .            .           .
       2005  |    .298111          .        .       .            .           .
       2006  |   .2014667          .        .       .            .           .
       2007  |   .1159034          .        .       .            .           .
       2008  |   .1602294          .        .       .            .           .
       2009  |  -.0506673          .        .       .            .           .
       2010  |  -.3244516          .        .       .            .           .
       2011  |  -.3589301          .        .       .            .           .
       2012  |  -.2527041          .        .       .            .           .
       2013  |  -.0090978          .        .       .            .           .
       2014  |  -.3688187          .        .       .            .           .
       2015  |  -.4114966          .        .       .            .           .
       2016  |  -.3322505          .        .       .            .           .
       2017  |  -.3865685          .        .       .            .           .
       2018  |  -.5384965          .        .       .            .           .
       2019  |  -.6034741          .        .       .            .           .
       2020  |  -.5184817          .        .       .            .           .
       2021  |  -.6679618          .        .       .            .           .
       2022  |  -.7702023          .        .       .            .           .
             |
  birth_year |
       1919  |  -.0491945          .        .       .            .           .
       1920  |   .6213996          .        .       .            .           .
       1921  |  -.1404377          .        .       .            .           .
       1922  |  -.0071231          .        .       .            .           .
       1923  |  -.3751036          .        .       .            .           .
       1924  |   .0736381          .        .       .            .           .
       1925  |  -.0600479          .        .       .            .           .
       1926  |   .0747618          .        .       .            .           .
       1927  |   .4244417          .        .       .            .           .
       1928  |   .0859689          .        .       .            .           .
       1929  |   .2989251          .        .       .            .           .
       1930  |   .4711645          .        .       .            .           .
       1931  |   .8134875          .        .       .            .           .
       1932  |   .6794895          .        .       .            .           .
       1933  |   .7762037          .        .       .            .           .
       1934  |   .9139188          .        .       .            .           .
       1935  |   .9725601          .        .       .            .           .
       1936  |   1.210107          .        .       .            .           .
       1937  |   1.334168          .        .       .            .           .
       1938  |   1.421861          .        .       .            .           .
       1939  |   1.602718          .        .       .            .           .
       1940  |   1.847475          .        .       .            .           .
       1941  |   2.022734          .        .       .            .           .
       1942  |   2.968447          .        .       .            .           .
       1943  |   2.271732          .        .       .            .           .
       1944  |   2.554732          .        .       .            .           .
       1945  |    2.45615          .        .       .            .           .
       1946  |   2.738034          .        .       .            .           .
       1947  |   2.844716          .        .       .            .           .
       1948  |   2.876519          .        .       .            .           .
       1949  |   2.976878          .        .       .            .           .
       1950  |   3.100294          .        .       .            .           .
       1951  |   3.402802          .        .       .            .           .
       1952  |   3.966141          .        .       .            .           .
       1953  |   4.192723          .        .       .            .           .
       1954  |   4.471568          .        .       .            .           .
       1955  |      4.565          .        .       .            .           .
       1956  |   4.617249          .        .       .            .           .
       1957  |   4.671553          .        .       .            .           .
       1958  |   4.809628          .        .       .            .           .
       1959  |   4.959774          .        .       .            .           .
       1960  |   4.875831          .        .       .            .           .
       1961  |   4.812887          .        .       .            .           .
       1962  |   5.190844          .        .       .            .           .
       1963  |   4.965987          .        .       .            .           .
       1964  |   4.955825          .        .       .            .           .
       1965  |   4.910683          .        .       .            .           .
       1966  |   4.968883          .        .       .            .           .
       1967  |   5.022944          .        .       .            .           .
       1968  |   4.897546          .        .       .            .           .
       1969  |   4.870853          .        .       .            .           .
       1970  |   4.897453          .        .       .            .           .
       1971  |   4.703636          .        .       .            .           .
       1972  |   4.204209          .        .       .            .           .
       1973  |   4.218666          .        .       .            .           .
       1974  |   4.363292          .        .       .            .           .
       1975  |    4.43648          .        .       .            .           .
       1976  |   4.446613          .        .       .            .           .
       1977  |   4.396557          .        .       .            .           .
       1978  |   4.397517          .        .       .            .           .
       1979  |   4.335539          .        .       .            .           .
       1980  |   4.380739          .        .       .            .           .
       1981  |   4.376823          .        .       .            .           .
       1982  |   4.300302          .        .       .            .           .
       1983  |   4.252402          .        .       .            .           .
       1984  |   4.272072          .        .       .            .           .
       1985  |   4.332601          .        .       .            .           .
       1986  |   4.271206          .        .       .            .           .
       1987  |   4.231612          .        .       .            .           .
       1988  |   4.171302          .        .       .            .           .
       1989  |    4.23414          .        .       .            .           .
       1990  |   4.222181          .        .       .            .           .
       1991  |   4.160731          .        .       .            .           .
       1992  |   4.100937          .        .       .            .           .
       1993  |   3.999584          .        .       .            .           .
       1994  |    3.95242          .        .       .            .           .
       1995  |   3.973819          .        .       .            .           .
       1996  |   3.837374          .        .       .            .           .
       1997  |   3.980268          .        .       .            .           .
       1998  |   3.761752          .        .       .            .           .
       1999  |   3.543228          .        .       .            .           .
       2000  |    3.95316          .        .       .            .           .
       2001  |   3.532047          .        .       .            .           .
       2002  |   3.333486          .        .       .            .           .
       2003  |   3.482003          .        .       .            .           .
       2004  |   1.138898          .        .       .            .           .
       2007  |   .0344785          .        .       .            .           .
       2008  |  -.4003056          .        .       .            .           .
       2009  |  -.5318362          .        .       .            .           .
       2015  |   .0077989          .        .       .            .           .
             |
       _cons |   .3247667          .        .       .            .           .
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
 component_id |       110           0         110     |
------------------------------------------------------+

. reghdfe manager_skill ib1985.cohort if !founder , a(component_id birth_year ) cluster(first_year )
(dropped 4 singleton observations)
(MWFE estimator converged in 5 iterations)

HDFE Linear regression                            Number of obs   =     81,274
Absorbing 2 HDFE groups                           F(   7,     36) =      17.28
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.0034
                                                  Adj R-squared   =     0.0009
                                                  Within R-sq.    =     0.0008
Number of clusters (first_year) =         37      Root MSE        =     2.7255

                            (Std. err. adjusted for 37 clusters in first_year)
------------------------------------------------------------------------------
             |               Robust
manager_sk~l | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      cohort |
       1990  |  -.0920035   .0522967    -1.76   0.087    -.1980661    .0140592
       1995  |  -.2686867   .0501337    -5.36   0.000    -.3703625   -.1670109
       2000  |  -.1877275   .0439819    -4.27   0.000    -.2769269   -.0985282
       2005  |   -.174055   .0482106    -3.61   0.001    -.2718307   -.0762793
       2010  |  -.1281774   .0467622    -2.74   0.009    -.2230156   -.0333392
       2015  |  -.0731328   .0519975    -1.41   0.168    -.1785886    .0323229
       2020  |   .0798764   .0543015     1.47   0.150    -.0302522    .1900051
             |
       _cons |    .175185   .0409314     4.28   0.000     .0921722    .2581977
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
 component_id |       110           0         110     |
   birth_year |        85           1          84     |
------------------------------------------------------+

. reghdfe ln_n  ib1985.cohort if !founder , a(component_id birth_year ) cluster(first_year )
(dropped 5 singleton observations)
(MWFE estimator converged in 5 iterations)

HDFE Linear regression                            Number of obs   =     99,287
Absorbing 2 HDFE groups                           F(   7,     36) =      11.41
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.3457
                                                  Adj R-squared   =     0.3444
                                                  Within R-sq.    =     0.0656
Number of clusters (first_year) =         37      Root MSE        =     1.1577

                            (Std. err. adjusted for 37 clusters in first_year)
------------------------------------------------------------------------------
             |               Robust
        ln_n | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      cohort |
       1990  |   1.028317   .2760185     3.73   0.001     .4685259    1.588109
       1995  |   .7782674   .3053437     2.55   0.015     .1590016    1.397533
       2000  |   .7252508   .2864273     2.53   0.016     .1443494    1.306152
       2005  |   .6014989   .2578497     2.33   0.025     .0785555    1.124442
       2010  |   .2193549   .2463359     0.89   0.379    -.2802375    .7189473
       2015  |   .0181517   .2347202     0.08   0.939     -.457883    .4941864
       2020  |  -.1712807   .2434193    -0.70   0.486    -.6649579    .3223964
             |
       _cons |   4.242325   .2265298    18.73   0.000     3.782901    4.701749
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
 component_id |       110           0         110     |
   birth_year |        86           1          85     |
------------------------------------------------------+

. reghdfe manager_skill ln_n  ib1985.cohort if !founder , a(component_id birth_year ) cluster(first_year )
(dropped 4 singleton observations)
(MWFE estimator converged in 5 iterations)

HDFE Linear regression                            Number of obs   =     81,274
Absorbing 2 HDFE groups                           F(   8,     36) =      15.77
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.0035
                                                  Adj R-squared   =     0.0010
                                                  Within R-sq.    =     0.0009
Number of clusters (first_year) =         37      Root MSE        =     2.7254

                            (Std. err. adjusted for 37 clusters in first_year)
------------------------------------------------------------------------------
             |               Robust
manager_sk~l | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        ln_n |   -.023283   .0107328    -2.17   0.037    -.0450501   -.0015158
             |
      cohort |
       1990  |  -.0692573   .0578603    -1.20   0.239    -.1866034    .0480887
       1995  |   -.251535   .0521606    -4.82   0.000    -.3573217   -.1457484
       2000  |  -.1708861   .0462487    -3.69   0.001    -.2646828   -.0770895
       2005  |  -.1598571   .0519962    -3.07   0.004    -.2653102    -.054404
       2010  |  -.1206042   .0493499    -2.44   0.020    -.2206905    -.020518
       2015  |  -.0694896   .0551288    -1.26   0.216    -.1812959    .0423167
       2020  |   .0790402   .0565854     1.40   0.171    -.0357202    .1938006
             |
       _cons |   .2718942   .0649435     4.19   0.000     .1401827    .4036057
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
 component_id |       110           0         110     |
   birth_year |        85           1          84     |
------------------------------------------------------+

. reghdfe manager_skill ln_n if !founder , a(component_id birth_year ) cluster(first_year )
(dropped 4 singleton observations)
(MWFE estimator converged in 4 iterations)

HDFE Linear regression                            Number of obs   =     81,274
Absorbing 2 HDFE groups                           F(   1,     36) =       9.45
Statistics robust to heteroskedasticity           Prob > F        =     0.0040
                                                  R-squared       =     0.0028
                                                  Adj R-squared   =     0.0004
                                                  Within R-sq.    =     0.0002
Number of clusters (first_year) =         37      Root MSE        =     2.7262

                            (Std. err. adjusted for 37 clusters in first_year)
------------------------------------------------------------------------------
             |               Robust
manager_sk~l | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        ln_n |  -.0305974   .0099513    -3.07   0.004    -.0507795   -.0104153
       _cons |   .1793828   .0513734     3.49   0.001     .0751928    .2835728
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
 component_id |       110           0         110     |
   birth_year |        85           1          84     |
------------------------------------------------------+

. reghdfe manager_skill ln_n if founder , a(component_id birth_year ) cluster(first_year )
(dropped 4 singleton observations)
(MWFE estimator converged in 5 iterations)

HDFE Linear regression                            Number of obs   =     95,953
Absorbing 2 HDFE groups                           F(   1,     34) =      11.35
Statistics robust to heteroskedasticity           Prob > F        =     0.0019
                                                  R-squared       =     0.0016
                                                  Adj R-squared   =    -0.0004
                                                  Within R-sq.    =     0.0002
Number of clusters (first_year) =         35      Root MSE        =     2.5987

                            (Std. err. adjusted for 35 clusters in first_year)
------------------------------------------------------------------------------
             |               Robust
manager_sk~l | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        ln_n |  -.0305301   .0090603    -3.37   0.002    -.0489428   -.0121174
       _cons |   .0735573   .0485468     1.52   0.139    -.0251017    .1722164
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
 component_id |       110           0         110     |
   birth_year |        82           1          81     |
------------------------------------------------------+

. reghdfe manager_skill i.founder##c.ln_n, a(component_id birth_year ) cluster(first_year )
(dropped 3 singleton observations)
(MWFE estimator converged in 4 iterations)

HDFE Linear regression                            Number of obs   =    177,232
Absorbing 2 HDFE groups                           F(   3,     36) =      17.98
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.0020
                                                  Adj R-squared   =     0.0009
                                                  Within R-sq.    =     0.0005
Number of clusters (first_year) =         37      Root MSE        =     2.6573

                              (Std. err. adjusted for 37 clusters in first_year)
--------------------------------------------------------------------------------
               |               Robust
 manager_skill | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
---------------+----------------------------------------------------------------
     1.founder |  -.1018696   .0526139    -1.94   0.061    -.2085756    .0048363
          ln_n |  -.0285422   .0091835    -3.11   0.004    -.0471672   -.0099172
               |
founder#c.ln_n |
            1  |   .0008282   .0103992     0.08   0.937    -.0202623    .0219188
               |
         _cons |   .1651364   .0459584     3.59   0.001     .0719285    .2583444
--------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
 component_id |       110           0         110     |
   birth_year |        88           1          87     |
------------------------------------------------------+

. reghdfe manager_skill i.founder##c.ln_n if component_id ==1, a(component_id birth_year ) cluster(first_year )
(dropped 3 singleton observations)
(MWFE estimator converged in 2 iterations)

HDFE Linear regression                            Number of obs   =    173,438
Absorbing 2 HDFE groups                           F(   3,     36) =      17.90
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.0018
                                                  Adj R-squared   =     0.0013
                                                  Within R-sq.    =     0.0005
Number of clusters (first_year) =         37      Root MSE        =     2.6760

                              (Std. err. adjusted for 37 clusters in first_year)
--------------------------------------------------------------------------------
               |               Robust
 manager_skill | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
---------------+----------------------------------------------------------------
     1.founder |  -.1054239   .0541775    -1.95   0.060    -.2153009     .004453
          ln_n |  -.0297551   .0093302    -3.19   0.003    -.0486775   -.0108326
               |
founder#c.ln_n |
            1  |   .0015391   .0106887     0.14   0.886    -.0201385    .0232167
               |
         _cons |   .1710935   .0468206     3.65   0.001      .076137    .2660501
--------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
 component_id |         1           0           1     |
   birth_year |        87           1          86     |
------------------------------------------------------+

. local controls male hungarian_name

. local FEs component_id birth_cohort

. 
. * different components may have different means

. reghdfe manager_skill ib1985.cohort `controls' if founder, a(`FEs') cluster(first_year )
variable male not found
r(111);

. reghdfe manager_skill ib1985.cohort `controls' if !founder, a(`FEs') cluster(first_year )
variable male not found
r(111);

. 
. reghdfe manager_skill ln_n `controls' if !founder, a(`FEs') cluster(first_year )
variable male not found
r(111);

. reghdfe manager_skill ln_n `controls' if founder, a(`FEs') cluster(first_year )
variable male not found
r(111);

. reghdfe manager_skill i.founder##c.ln_n `controls', a(`FEs') cluster(first_year )
variable male not found
r(111);

. 
. do "code/estimate/cohort.do"

. use "temp/unfiltered.dta", clear

. merge m:1 frame_id_numeric person_id using "temp/manager_value.dta", keep(match) nogen

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                        10,224,519  
    -----------------------------------------

. 
. * for babyboom, we measure manager skills in revenue units, not as TFP
. replace manager_skill = manager_skill / chi
(8,688,171 real changes made)

. 
. keep if component_id > 0
(7,505,526 observations deleted)

. 
. collapse (mean) manager_skill (min) birth_year first_year = year (max) male hungarian_name last_year = year (
> min) component_id (max) component_size, by(person_id founder)
variable hungarian_name not found
r(111);

end of do-file

r(111);

. d

Contains data from temp/unfiltered.dta
 Observations:     2,718,993                  
    Variables:            52                  25 Sep 2025 16:34
                                              (_dta has notes)
---------------------------------------------------------------------------------------------------------------
Variable      Storage   Display    Value
    name         type    format    label      Variable label
---------------------------------------------------------------------------------------------------------------
frame_id_nume~c long    %12.0g                Numeric frame ID
originalid      long    %10.0g              * Given year Taxid. Minus if taxid not valid
foundyear       int     %8.0g                 Year of foundation
year            int     %9.0g                 Year
teaor08_2d      byte    %9.0g                 2 digit TEAOR08
teaor08_1d      str1    %9s                   1 digit TEAOR08 Letter
sales           double  %12.0g                Sales
export          double  %12.0g                Export
employment      long    %9.0f                 Employment
tangible_assets double  %12.0g              * Tangible assets
materials       double  %12.0g                Materials
wagebill        double  %12.0g                Wagebill
personnel_exp~s double  %12.0g                Personnel expenses
intangible_as~s double  %12.0g              * Intangible assets
state_owned     byte    %9.0g                 State owned
foreign_owned   byte    %8.0g                 Foreign owned
person_id       long    %12.0g                Person ID
male            byte    %8.0g                 Male CEO
birth_year      int     %8.0g                 Year of birth
manager_categ~y byte    %14.0g     mc         Manager category
owner           byte    %8.0g                 Non-founding owner
cf              byte    %80.0g     cf         
n_ceo           byte    %9.0g                 Number of CEOs in a year
sector          byte    %34.0g     sector     
EBITDA          float   %9.0g                 
lnR             float   %9.0g                 Sales (log)
lnEBITDA        float   %9.0g                 EBITDA (log)
lnL             float   %9.0g                 Employment (log)
lnK             float   %9.0g                 Fixed assets (log)
lnM             float   %9.0g                 Materials (log)
lnWL            float   %9.0g                 Wagebill (log)
intangible_sh~e float   %9.0g                 Intangible assets share
has_intangible  byte    %8.0g                 Has intangible assets
max_employment  float   %9.0g                 
ceo_tenure      byte    %8.0g                 CEO tenure (years)
ceo_spell       float   %9.0g                 CEO spell
max_ceo_spell   float   %9.0g                 
exit            byte    %8.0g                 
expat           float   %9.0g                 Expatriate CEO
firm_age        float   %9.0g                 Firm age (years)
ceo_age         float   %9.0g                 CEO age (years)
second_ceo      byte    %8.0g                 Second CEO
third_ceo       byte    %8.0g                 Third or later CEO
founder         byte    %8.0g                 Founding owner
ceo_age_sq      float   %9.0g                 CEO age squared
firm_age_sq     float   %9.0g                 Firm age squared
ceo_tenure_sq   float   %9.0g                 CEO tenure squared
firm_fixed_ef~t double  %10.0g                (firstnm) firm_fixed_effect
manager_skill   double  %10.0g                (firstnm) manager_skill
chi             double  %10.0g                (firstnm) chi
component_id    int     %8.0g                 (firstnm) component_id
component_size  long    %12.0g                (firstnm) component_size
                                            * indicated variables have notes
---------------------------------------------------------------------------------------------------------------
Sorted by: 
     Note: Dataset has changed since last saved.

. tab male, miss

   Male CEO |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    713,912       26.26       26.26
          1 |  1,877,822       69.06       95.32
          . |    127,259        4.68      100.00
------------+-----------------------------------
      Total |  2,718,993      100.00

. do "code/estimate/cohort.do"

. use "temp/unfiltered.dta", clear

. merge m:1 frame_id_numeric person_id using "temp/manager_value.dta", keep(match) nogen

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                        10,224,519  
    -----------------------------------------

. 
. * for babyboom, we measure manager skills in revenue units, not as TFP
. replace manager_skill = manager_skill / chi
(8,688,171 real changes made)

. keep if component_id > 0
(7,505,526 observations deleted)

. generate byte hungarian_name = !missing(male)

. replace male = 1 if missing(male)
(127,259 real changes made)

. 
. collapse (mean) manager_skill (min) birth_year first_year = year (max) male hungarian_name last_year = year (
> min) component_id (max) component_size, by(person_id founder)

. reshape wide manager_skill first_year last_year birth_year male hungarian_name, i(person_id) j(founder)
(j = 0 1)

Data                               Long   ->   Wide
-----------------------------------------------------------------------------
Number of observations          272,001   ->   207,279     
Number of variables                  10   ->   15          
j variable (2 values)           founder   ->   (dropped)
xij variables:
                          manager_skill   ->   manager_skill0 manager_skill1
                             first_year   ->   first_year0 first_year1
                              last_year   ->   last_year0 last_year1
                             birth_year   ->   birth_year0 birth_year1
                                   male   ->   male0 male1
                         hungarian_name   ->   hungarian_name0 hungarian_name1
-----------------------------------------------------------------------------

. 
. * relatively few overlap, use the first ceo spell
. egen first_year = rowmin(first_year?)

. egen last_year = rowmax(last_year?)

. egen manager_skill = rowmean(manager_skill?)
(30,044 missing values generated)

. egen birth_year = rowmin(birth_year?)

. egen male = rowmax(male?)

. egen hungarian_name = rowmax(hungarian_name?)

. 
. generate byte founder = first_year0 > first_year

. tabulate first_year founder

           |        founder
first_year |         0          1 |     Total
-----------+----------------------+----------
      1986 |       379          0 |       379 
      1987 |        77          0 |        77 
      1988 |       100         14 |       114 
      1989 |       485        487 |       972 
      1990 |     1,215      1,962 |     3,177 
      1991 |     1,534      3,450 |     4,984 
      1992 |     2,373      9,955 |    12,328 
      1993 |     2,044      5,405 |     7,449 
      1994 |     2,135      5,625 |     7,760 
      1995 |     2,072      4,720 |     6,792 
      1996 |     2,358      5,035 |     7,393 
      1997 |     2,667      5,399 |     8,066 
      1998 |     2,760      5,555 |     8,315 
      1999 |     2,679      3,720 |     6,399 
      2000 |     3,607      4,745 |     8,352 
      2001 |     3,096      4,583 |     7,679 
      2002 |     3,042      4,195 |     7,237 
      2003 |     3,032      3,739 |     6,771 
      2004 |     3,350      4,014 |     7,364 
      2005 |     3,497      3,223 |     6,720 
      2006 |     3,452      3,267 |     6,719 
      2007 |     3,219      2,743 |     5,962 
      2008 |     3,794      3,423 |     7,217 
      2009 |     3,377      3,356 |     6,733 
      2010 |     3,357      3,080 |     6,437 
      2011 |     3,362      2,907 |     6,269 
      2012 |     3,764      2,847 |     6,611 
      2013 |     4,995      2,661 |     7,656 
      2014 |     3,381      1,631 |     5,012 
      2015 |     3,287      1,145 |     4,432 
      2016 |     3,554      1,082 |     4,636 
      2017 |     3,454      1,036 |     4,490 
      2018 |     2,941        851 |     3,792 
      2019 |     2,760        697 |     3,457 
      2020 |     3,248        574 |     3,822 
      2021 |     2,522        513 |     3,035 
      2022 |     2,323        348 |     2,671 
-----------+----------------------+----------
     Total |    99,292    107,987 |   207,279 

. 
. generate cohort = int(first_year/5)*5

. tabulate cohort founder

           |        founder
    cohort |         0          1 |     Total
-----------+----------------------+----------
      1985 |     1,041        501 |     1,542 
      1990 |     9,301     26,397 |    35,698 
      1995 |    12,536     24,429 |    36,965 
      2000 |    16,127     21,276 |    37,403 
      2005 |    17,339     16,012 |    33,351 
      2010 |    18,859     13,126 |    31,985 
      2015 |    15,996      4,811 |    20,807 
      2020 |     8,093      1,435 |     9,528 
-----------+----------------------+----------
     Total |    99,292    107,987 |   207,279 

. 
. generate birth_cohort = int(birth_year/5)*5

. 
. egen n = count(person_id), by(first_year birth_year founder)

. generate ln_n = ln(n)

. 
. local controls male hungarian_name

. local FEs component_id birth_cohort

. 
. * different components may have different means
. reghdfe manager_skill ib1985.cohort `controls' if founder, a(`FEs') cluster(first_year )
(dropped 1 singleton observations)
(MWFE estimator converged in 4 iterations)

HDFE Linear regression                            Number of obs   =     95,956
Absorbing 2 HDFE groups                           F(   9,     34) =       7.18
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.0012
                                                  Adj R-squared   =    -0.0002
                                                  Within R-sq.    =     0.0004
Number of clusters (first_year) =         35      Root MSE        =     2.5984

                              (Std. err. adjusted for 35 clusters in first_year)
--------------------------------------------------------------------------------
               |               Robust
 manager_skill | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
---------------+----------------------------------------------------------------
        cohort |
         1990  |  -.0359816   .0482451    -0.75   0.461    -.1340274    .0620642
         1995  |  -.0481961   .0506429    -0.95   0.348    -.1511149    .0547227
         2000  |   -.015291   .0510409    -0.30   0.766    -.1190187    .0884367
         2005  |  -.0273315   .0531134    -0.51   0.610    -.1352708    .0806079
         2010  |  -.0121183     .05338    -0.23   0.822    -.1205995    .0963629
         2015  |  -.0092141   .0617217    -0.15   0.882    -.1346477    .1162194
         2020  |   .0220376   .0808949     0.27   0.787    -.1423606    .1864359
               |
          male |   .0955728   .0164353     5.82   0.000     .0621722    .1289733
hungarian_name |   .1869154   .0494542     3.78   0.001     .0864125    .2874184
         _cons |  -.2960862    .071524    -4.14   0.000    -.4414403    -.150732
--------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
 component_id |       110           0         110     |
 birth_cohort |        18           1          17     |
------------------------------------------------------+

. reghdfe manager_skill ib1985.cohort `controls' if !founder, a(`FEs') cluster(first_year )
(dropped 1 singleton observations)
(MWFE estimator converged in 4 iterations)

HDFE Linear regression                            Number of obs   =     81,277
Absorbing 2 HDFE groups                           F(   9,     36) =      27.38
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.0033
                                                  Adj R-squared   =     0.0017
                                                  Within R-sq.    =     0.0015
Number of clusters (first_year) =         37      Root MSE        =     2.7244

                              (Std. err. adjusted for 37 clusters in first_year)
--------------------------------------------------------------------------------
               |               Robust
 manager_skill | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
---------------+----------------------------------------------------------------
        cohort |
         1990  |  -.1132996   .0510351    -2.22   0.033    -.2168035   -.0097956
         1995  |  -.2735444   .0542803    -5.04   0.000    -.3836299   -.1634588
         2000  |  -.1620279   .0483206    -3.35   0.002    -.2600267   -.0640292
         2005  |  -.1563515    .049064    -3.19   0.003    -.2558579   -.0568451
         2010  |  -.0977393    .049362    -1.98   0.055    -.1978501    .0023714
         2015  |    -.03937   .0564173    -0.70   0.490    -.1537896    .0750496
         2020  |   .1145836   .0580935     1.97   0.056    -.0032355    .2324027
               |
          male |   .1488538   .0198635     7.49   0.000     .1085687    .1891389
hungarian_name |   .1604843   .0305643     5.25   0.000      .098497    .2224716
         _cons |  -.0822154   .0517977    -1.59   0.121     -.187266    .0228353
--------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
 component_id |       110           0         110     |
 birth_cohort |        19           1          18     |
------------------------------------------------------+

. 
. reghdfe manager_skill ln_n `controls' if !founder, a(`FEs') cluster(first_year )
(dropped 1 singleton observations)
(MWFE estimator converged in 5 iterations)

HDFE Linear regression                            Number of obs   =     81,277
Absorbing 2 HDFE groups                           F(   3,     36) =      25.39
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.0026
                                                  Adj R-squared   =     0.0010
                                                  Within R-sq.    =     0.0008
Number of clusters (first_year) =         37      Root MSE        =     2.7254

                              (Std. err. adjusted for 37 clusters in first_year)
--------------------------------------------------------------------------------
               |               Robust
 manager_skill | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
---------------+----------------------------------------------------------------
          ln_n |  -.0250804   .0106142    -2.36   0.024    -.0466069   -.0035539
          male |   .1352966   .0204744     6.61   0.000     .0937725    .1768206
hungarian_name |    .131593   .0315232     4.17   0.000      .067661     .195525
         _cons |  -.0515799   .0636756    -0.81   0.423    -.1807199    .0775601
--------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
 component_id |       110           0         110     |
 birth_cohort |        19           1          18     |
------------------------------------------------------+

. reghdfe manager_skill ln_n `controls' if founder, a(`FEs') cluster(first_year )
(dropped 1 singleton observations)
(MWFE estimator converged in 4 iterations)

HDFE Linear regression                            Number of obs   =     95,956
Absorbing 2 HDFE groups                           F(   3,     34) =      20.66
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.0014
                                                  Adj R-squared   =     0.0000
                                                  Within R-sq.    =     0.0005
Number of clusters (first_year) =         35      Root MSE        =     2.5982

                              (Std. err. adjusted for 35 clusters in first_year)
--------------------------------------------------------------------------------
               |               Robust
 manager_skill | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
---------------+----------------------------------------------------------------
          ln_n |  -.0258738   .0090173    -2.87   0.007    -.0441992   -.0075485
          male |   .0925729   .0163251     5.67   0.000     .0593963    .1257495
hungarian_name |   .1763162   .0495025     3.56   0.001     .0757151    .2769173
         _cons |  -.1823509   .0702576    -2.60   0.014    -.3251315   -.0395703
--------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
 component_id |       110           0         110     |
 birth_cohort |        18           1          17     |
------------------------------------------------------+

. reghdfe manager_skill i.founder##c.ln_n `controls', a(`FEs') cluster(first_year )
(dropped 1 singleton observations)
(MWFE estimator converged in 4 iterations)

HDFE Linear regression                            Number of obs   =    177,234
Absorbing 2 HDFE groups                           F(   5,     36) =      34.00
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.0020
                                                  Adj R-squared   =     0.0013
                                                  Within R-sq.    =     0.0010
Number of clusters (first_year) =         37      Root MSE        =     2.6568

                              (Std. err. adjusted for 37 clusters in first_year)
--------------------------------------------------------------------------------
               |               Robust
 manager_skill | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
---------------+----------------------------------------------------------------
     1.founder |  -.1069133   .0529194    -2.02   0.051    -.2142388    .0004121
          ln_n |  -.0230502   .0096389    -2.39   0.022    -.0425989   -.0035016
               |
founder#c.ln_n |
            1  |  -.0011597     .01049    -0.11   0.913    -.0224345    .0201151
               |
          male |   .1129053   .0124336     9.08   0.000     .0876889    .1381218
hungarian_name |   .1472266   .0278141     5.29   0.000      .090817    .2036362
         _cons |  -.0659002   .0555985    -1.19   0.244    -.1786591    .0468588
--------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
 component_id |       110           0         110     |
 birth_cohort |        19           1          18     |
------------------------------------------------------+

. 
end of do-file

. do "code/estimate/cohort.do"

. use "temp/unfiltered.dta", clear

. merge m:1 frame_id_numeric person_id using "temp/manager_value.dta", keep(match) nogen

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                        10,224,519  
    -----------------------------------------

. 
. * for babyboom, we measure manager skills in revenue units, not as TFP
. replace manager_skill = manager_skill / chi
(8,688,171 real changes made)

. keep if component_id > 0
(7,505,526 observations deleted)

. generate byte hungarian_name = !missing(male)

. 
. keep if hungarian_name
(127,259 observations deleted)

. 
. collapse (mean) manager_skill (min) birth_year first_year = year (max) male last_year = year (min) component_
> id (max) component_size, by(person_id founder)

. reshape wide manager_skill first_year last_year birth_year male, i(person_id) j(founder)
(j = 0 1)

Data                               Long   ->   Wide
-----------------------------------------------------------------------------
Number of observations          254,875   ->   192,073     
Number of variables                   9   ->   13          
j variable (2 values)           founder   ->   (dropped)
xij variables:
                          manager_skill   ->   manager_skill0 manager_skill1
                             first_year   ->   first_year0 first_year1
                              last_year   ->   last_year0 last_year1
                             birth_year   ->   birth_year0 birth_year1
                                   male   ->   male0 male1
-----------------------------------------------------------------------------

. 
. * relatively few overlap, use the first ceo spell
. egen first_year = rowmin(first_year?)

. egen last_year = rowmax(last_year?)

. egen manager_skill = rowmean(manager_skill?)
(26,002 missing values generated)

. egen birth_year = rowmin(birth_year?)

. egen male = rowmax(male?)

. 
. generate byte founder = first_year0 > first_year

. tabulate first_year founder

           |        founder
first_year |         0          1 |     Total
-----------+----------------------+----------
      1986 |       379          0 |       379 
      1987 |        76          0 |        76 
      1988 |        97         14 |       111 
      1989 |       454        484 |       938 
      1990 |     1,139      1,933 |     3,072 
      1991 |     1,397      3,363 |     4,760 
      1992 |     2,168      9,746 |    11,914 
      1993 |     1,836      5,234 |     7,070 
      1994 |     1,897      5,375 |     7,272 
      1995 |     1,827      4,514 |     6,341 
      1996 |     2,133      4,813 |     6,946 
      1997 |     2,402      5,133 |     7,535 
      1998 |     2,484      5,263 |     7,747 
      1999 |     2,421      3,523 |     5,944 
      2000 |     3,222      4,470 |     7,692 
      2001 |     2,728      4,322 |     7,050 
      2002 |     2,726      3,992 |     6,718 
      2003 |     2,732      3,509 |     6,241 
      2004 |     3,006      3,771 |     6,777 
      2005 |     3,136      3,019 |     6,155 
      2006 |     3,101      3,059 |     6,160 
      2007 |     2,837      2,581 |     5,418 
      2008 |     3,397      3,251 |     6,648 
      2009 |     3,002      3,190 |     6,192 
      2010 |     3,048      2,925 |     5,973 
      2011 |     3,029      2,736 |     5,765 
      2012 |     3,455      2,713 |     6,168 
      2013 |     4,565      2,511 |     7,076 
      2014 |     3,073      1,510 |     4,583 
      2015 |     2,954      1,040 |     3,994 
      2016 |     3,180        997 |     4,177 
      2017 |     3,101        949 |     4,050 
      2018 |     2,635        767 |     3,402 
      2019 |     2,466        612 |     3,078 
      2020 |     2,925        514 |     3,439 
      2021 |     2,296        466 |     2,762 
      2022 |     2,121        329 |     2,450 
-----------+----------------------+----------
     Total |    89,445    102,628 |   192,073 

. 
. generate cohort = int(first_year/5)*5

. tabulate cohort founder

           |        founder
    cohort |         0          1 |     Total
-----------+----------------------+----------
      1985 |     1,006        498 |     1,504 
      1990 |     8,437     25,651 |    34,088 
      1995 |    11,267     23,246 |    34,513 
      2000 |    14,414     20,064 |    34,478 
      2005 |    15,473     15,100 |    30,573 
      2010 |    17,170     12,395 |    29,565 
      2015 |    14,336      4,365 |    18,701 
      2020 |     7,342      1,309 |     8,651 
-----------+----------------------+----------
     Total |    89,445    102,628 |   192,073 

. 
. generate birth_cohort = int(birth_year/5)*5

. 
. egen n = count(person_id), by(first_year birth_year founder male)

. generate ln_n = ln(n)

. 
. local controls male

. local FEs component_id birth_cohort

. 
. * different components may have different means
. reghdfe manager_skill ib1985.cohort `controls' if founder, a(`FEs') cluster(first_year )
(dropped 1 singleton observations)
(MWFE estimator converged in 4 iterations)

HDFE Linear regression                            Number of obs   =     91,986
Absorbing 2 HDFE groups                           F(   8,     34) =       5.75
Statistics robust to heteroskedasticity           Prob > F        =     0.0001
                                                  R-squared       =     0.0011
                                                  Adj R-squared   =    -0.0003
                                                  Within R-sq.    =     0.0003
Number of clusters (first_year) =         35      Root MSE        =     2.5982

                            (Std. err. adjusted for 35 clusters in first_year)
------------------------------------------------------------------------------
             |               Robust
manager_sk~l | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      cohort |
       1990  |  -.0365859   .0485239    -0.75   0.456    -.1351984    .0620266
       1995  |  -.0344858   .0516169    -0.67   0.509    -.1393839    .0704124
       2000  |  -.0095834   .0521712    -0.18   0.855    -.1156081    .0964412
       2005  |  -.0260274   .0537519    -0.48   0.631    -.1352644    .0832096
       2010  |  -.0233536   .0535237    -0.44   0.665    -.1321268    .0854196
       2015  |   .0069092    .061627     0.11   0.911     -.118332    .1321504
       2020  |   .0117523   .0882882     0.13   0.895    -.1676709    .1911754
             |
        male |   .0955129   .0163938     5.83   0.000     .0621967    .1288292
       _cons |  -.1128263   .0524407    -2.15   0.039    -.2193986   -.0062539
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
 component_id |       108           0         108     |
 birth_cohort |        18           1          17     |
------------------------------------------------------+

. reghdfe manager_skill ib1985.cohort `controls' if !founder, a(`FEs') cluster(first_year )
(dropped 2 singleton observations)
(MWFE estimator converged in 5 iterations)

HDFE Linear regression                            Number of obs   =     74,082
Absorbing 2 HDFE groups                           F(   8,     36) =      34.37
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.0034
                                                  Adj R-squared   =     0.0016
                                                  Within R-sq.    =     0.0016
Number of clusters (first_year) =         37      Root MSE        =     2.7111

                            (Std. err. adjusted for 37 clusters in first_year)
------------------------------------------------------------------------------
             |               Robust
manager_sk~l | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      cohort |
       1990  |  -.1675235   .0462675    -3.62   0.001    -.2613583   -.0736887
       1995  |  -.3246808   .0462586    -7.02   0.000    -.4184977   -.2308639
       2000  |  -.2266323   .0414112    -5.47   0.000    -.3106181   -.1426465
       2005  |  -.2121101   .0392491    -5.40   0.000     -.291711   -.1325091
       2010  |  -.1643334    .040068    -4.10   0.000    -.2455951   -.0830718
       2015  |  -.0851962   .0486231    -1.75   0.088    -.1838085    .0134161
       2020  |   .0638779   .0501514     1.27   0.211    -.0378338    .1655896
             |
        male |   .1480399   .0195693     7.56   0.000     .1083516    .1877283
       _cons |   .1351719   .0380854     3.55   0.001     .0579312    .2124126
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
 component_id |       108           0         108     |
 birth_cohort |        18           1          17     |
------------------------------------------------------+

. 
. reghdfe manager_skill ln_n `controls' if !founder, a(`FEs') cluster(first_year )
(dropped 2 singleton observations)
(MWFE estimator converged in 5 iterations)

HDFE Linear regression                            Number of obs   =     74,082
Absorbing 2 HDFE groups                           F(   2,     36) =      30.44
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.0025
                                                  Adj R-squared   =     0.0008
                                                  Within R-sq.    =     0.0007
Number of clusters (first_year) =         37      Root MSE        =     2.7122

                            (Std. err. adjusted for 37 clusters in first_year)
------------------------------------------------------------------------------
             |               Robust
manager_sk~l | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        ln_n |  -.0232981   .0100848    -2.31   0.027    -.0437511   -.0028451
        male |   .1438717   .0198163     7.26   0.000     .1036825    .1840609
       _cons |   .0509115   .0453863     1.12   0.269    -.0411361    .1429591
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
 component_id |       108           0         108     |
 birth_cohort |        18           1          17     |
------------------------------------------------------+

. reghdfe manager_skill ln_n `controls' if founder, a(`FEs') cluster(first_year )
(dropped 1 singleton observations)
(MWFE estimator converged in 4 iterations)

HDFE Linear regression                            Number of obs   =     91,986
Absorbing 2 HDFE groups                           F(   2,     34) =      27.50
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.0012
                                                  Adj R-squared   =    -0.0001
                                                  Within R-sq.    =     0.0004
Number of clusters (first_year) =         35      Root MSE        =     2.5979

                            (Std. err. adjusted for 35 clusters in first_year)
------------------------------------------------------------------------------
             |               Robust
manager_sk~l | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        ln_n |  -.0252427   .0087241    -2.89   0.007    -.0429722   -.0075132
        male |   .1095245   .0157682     6.95   0.000     .0774797    .1415693
       _cons |  -.0370106   .0409685    -0.90   0.373    -.1202686    .0462474
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
 component_id |       108           0         108     |
 birth_cohort |        18           1          17     |
------------------------------------------------------+

. reghdfe manager_skill i.founder##c.ln_n `controls', a(`FEs') cluster(first_year )
(dropped 1 singleton observations)
(MWFE estimator converged in 4 iterations)

HDFE Linear regression                            Number of obs   =    166,070
Absorbing 2 HDFE groups                           F(   4,     36) =      34.05
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.0020
                                                  Adj R-squared   =     0.0012
                                                  Within R-sq.    =     0.0009
Number of clusters (first_year) =         37      Root MSE        =     2.6490

                              (Std. err. adjusted for 37 clusters in first_year)
--------------------------------------------------------------------------------
               |               Robust
 manager_skill | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
---------------+----------------------------------------------------------------
     1.founder |   -.096125   .0464071    -2.07   0.046    -.1902429    -.002007
          ln_n |  -.0212288   .0091331    -2.32   0.026    -.0397517   -.0027059
               |
founder#c.ln_n |
            1  |  -.0031322   .0106777    -0.29   0.771    -.0247877    .0185232
               |
          male |   .1249634   .0118838    10.52   0.000     .1008619    .1490648
         _cons |   .0490082   .0397836     1.23   0.226    -.0316768    .1296931
--------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
 component_id |       108           0         108     |
 birth_cohort |        19           1          18     |
------------------------------------------------------+

. 
end of do-file

. do "code/estimate/cohort.do"

. use "temp/unfiltered.dta", clear

. merge m:1 frame_id_numeric person_id using "temp/manager_value.dta", keep(match) nogen

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                        10,224,519  
    -----------------------------------------

. 
. * for babyboom, we measure manager skills in revenue units, not as TFP
. replace manager_skill = manager_skill / chi
(8,688,171 real changes made)

. keep if component_id > 0
(7,505,526 observations deleted)

. generate byte hungarian_name = !missing(male)

. 
. keep if hungarian_name
(127,259 observations deleted)

. 
. collapse (mean) manager_skill (min) birth_year first_year = year (max) male last_year = year (min) component_
> id (max) component_size, by(person_id founder)

. reshape wide manager_skill first_year last_year birth_year male, i(person_id) j(founder)
(j = 0 1)

Data                               Long   ->   Wide
-----------------------------------------------------------------------------
Number of observations          254,875   ->   192,073     
Number of variables                   9   ->   13          
j variable (2 values)           founder   ->   (dropped)
xij variables:
                          manager_skill   ->   manager_skill0 manager_skill1
                             first_year   ->   first_year0 first_year1
                              last_year   ->   last_year0 last_year1
                             birth_year   ->   birth_year0 birth_year1
                                   male   ->   male0 male1
-----------------------------------------------------------------------------

. 
. * relatively few overlap, use the first ceo spell
. egen first_year = rowmin(first_year?)

. egen last_year = rowmax(last_year?)

. egen manager_skill = rowmean(manager_skill?)
(26,002 missing values generated)

. egen birth_year = rowmin(birth_year?)

. egen male = rowmax(male?)

. 
. generate byte founder = first_year0 > first_year

. tabulate first_year founder

           |        founder
first_year |         0          1 |     Total
-----------+----------------------+----------
      1986 |       379          0 |       379 
      1987 |        76          0 |        76 
      1988 |        97         14 |       111 
      1989 |       454        484 |       938 
      1990 |     1,139      1,933 |     3,072 
      1991 |     1,397      3,363 |     4,760 
      1992 |     2,168      9,746 |    11,914 
      1993 |     1,836      5,234 |     7,070 
      1994 |     1,897      5,375 |     7,272 
      1995 |     1,827      4,514 |     6,341 
      1996 |     2,133      4,813 |     6,946 
      1997 |     2,402      5,133 |     7,535 
      1998 |     2,484      5,263 |     7,747 
      1999 |     2,421      3,523 |     5,944 
      2000 |     3,222      4,470 |     7,692 
      2001 |     2,728      4,322 |     7,050 
      2002 |     2,726      3,992 |     6,718 
      2003 |     2,732      3,509 |     6,241 
      2004 |     3,006      3,771 |     6,777 
      2005 |     3,136      3,019 |     6,155 
      2006 |     3,101      3,059 |     6,160 
      2007 |     2,837      2,581 |     5,418 
      2008 |     3,397      3,251 |     6,648 
      2009 |     3,002      3,190 |     6,192 
      2010 |     3,048      2,925 |     5,973 
      2011 |     3,029      2,736 |     5,765 
      2012 |     3,455      2,713 |     6,168 
      2013 |     4,565      2,511 |     7,076 
      2014 |     3,073      1,510 |     4,583 
      2015 |     2,954      1,040 |     3,994 
      2016 |     3,180        997 |     4,177 
      2017 |     3,101        949 |     4,050 
      2018 |     2,635        767 |     3,402 
      2019 |     2,466        612 |     3,078 
      2020 |     2,925        514 |     3,439 
      2021 |     2,296        466 |     2,762 
      2022 |     2,121        329 |     2,450 
-----------+----------------------+----------
     Total |    89,445    102,628 |   192,073 

. 
. generate cohort = int(first_year/5)*5

. tabulate cohort founder

           |        founder
    cohort |         0          1 |     Total
-----------+----------------------+----------
      1985 |     1,006        498 |     1,504 
      1990 |     8,437     25,651 |    34,088 
      1995 |    11,267     23,246 |    34,513 
      2000 |    14,414     20,064 |    34,478 
      2005 |    15,473     15,100 |    30,573 
      2010 |    17,170     12,395 |    29,565 
      2015 |    14,336      4,365 |    18,701 
      2020 |     7,342      1,309 |     8,651 
-----------+----------------------+----------
     Total |    89,445    102,628 |   192,073 

. 
. generate birth_cohort = int(birth_year/5)*5

. 
. egen n = count(person_id), by(cohort birth_cohort founder male)

. generate ln_n = ln(n)

. 
. local controls male

. local FEs component_id birth_cohort

. 
. * different components may have different means
. reghdfe manager_skill ib1985.cohort `controls' if founder, a(`FEs') cluster(first_year )
(dropped 1 singleton observations)
(MWFE estimator converged in 4 iterations)

HDFE Linear regression                            Number of obs   =     91,986
Absorbing 2 HDFE groups                           F(   8,     34) =       5.75
Statistics robust to heteroskedasticity           Prob > F        =     0.0001
                                                  R-squared       =     0.0011
                                                  Adj R-squared   =    -0.0003
                                                  Within R-sq.    =     0.0003
Number of clusters (first_year) =         35      Root MSE        =     2.5982

                            (Std. err. adjusted for 35 clusters in first_year)
------------------------------------------------------------------------------
             |               Robust
manager_sk~l | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      cohort |
       1990  |  -.0365859   .0485239    -0.75   0.456    -.1351984    .0620266
       1995  |  -.0344858   .0516169    -0.67   0.509    -.1393839    .0704124
       2000  |  -.0095834   .0521712    -0.18   0.855    -.1156081    .0964412
       2005  |  -.0260274   .0537519    -0.48   0.631    -.1352644    .0832096
       2010  |  -.0233536   .0535237    -0.44   0.665    -.1321268    .0854196
       2015  |   .0069092    .061627     0.11   0.911     -.118332    .1321504
       2020  |   .0117523   .0882882     0.13   0.895    -.1676709    .1911754
             |
        male |   .0955129   .0163938     5.83   0.000     .0621967    .1288292
       _cons |  -.1128263   .0524407    -2.15   0.039    -.2193986   -.0062539
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
 component_id |       108           0         108     |
 birth_cohort |        18           1          17     |
------------------------------------------------------+

. reghdfe manager_skill ib1985.cohort `controls' if !founder, a(`FEs') cluster(first_year )
(dropped 2 singleton observations)
(MWFE estimator converged in 5 iterations)

HDFE Linear regression                            Number of obs   =     74,082
Absorbing 2 HDFE groups                           F(   8,     36) =      34.37
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.0034
                                                  Adj R-squared   =     0.0016
                                                  Within R-sq.    =     0.0016
Number of clusters (first_year) =         37      Root MSE        =     2.7111

                            (Std. err. adjusted for 37 clusters in first_year)
------------------------------------------------------------------------------
             |               Robust
manager_sk~l | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      cohort |
       1990  |  -.1675235   .0462675    -3.62   0.001    -.2613583   -.0736887
       1995  |  -.3246808   .0462586    -7.02   0.000    -.4184977   -.2308639
       2000  |  -.2266323   .0414112    -5.47   0.000    -.3106181   -.1426465
       2005  |  -.2121101   .0392491    -5.40   0.000     -.291711   -.1325091
       2010  |  -.1643334    .040068    -4.10   0.000    -.2455951   -.0830718
       2015  |  -.0851962   .0486231    -1.75   0.088    -.1838085    .0134161
       2020  |   .0638779   .0501514     1.27   0.211    -.0378338    .1655896
             |
        male |   .1480399   .0195693     7.56   0.000     .1083516    .1877283
       _cons |   .1351719   .0380854     3.55   0.001     .0579312    .2124126
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
 component_id |       108           0         108     |
 birth_cohort |        18           1          17     |
------------------------------------------------------+

. 
. reghdfe manager_skill ln_n `controls' if !founder, a(`FEs') cluster(first_year )
(dropped 2 singleton observations)
(MWFE estimator converged in 5 iterations)

HDFE Linear regression                            Number of obs   =     74,082
Absorbing 2 HDFE groups                           F(   2,     36) =      26.55
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.0024
                                                  Adj R-squared   =     0.0007
                                                  Within R-sq.    =     0.0007
Number of clusters (first_year) =         37      Root MSE        =     2.7123

                            (Std. err. adjusted for 37 clusters in first_year)
------------------------------------------------------------------------------
             |               Robust
manager_sk~l | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        ln_n |  -.0253688    .019091    -1.33   0.192    -.0640871    .0133495
        male |   .1460606   .0200443     7.29   0.000     .1054089    .1867124
       _cons |   .1296211   .1340911     0.97   0.340    -.1423283    .4015704
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
 component_id |       108           0         108     |
 birth_cohort |        18           1          17     |
------------------------------------------------------+

. reghdfe manager_skill ln_n `controls' if founder, a(`FEs') cluster(first_year )
(dropped 1 singleton observations)
(MWFE estimator converged in 4 iterations)

HDFE Linear regression                            Number of obs   =     91,986
Absorbing 2 HDFE groups                           F(   2,     34) =      17.91
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.0011
                                                  Adj R-squared   =    -0.0003
                                                  Within R-sq.    =     0.0003
Number of clusters (first_year) =         35      Root MSE        =     2.5981

                            (Std. err. adjusted for 35 clusters in first_year)
------------------------------------------------------------------------------
             |               Robust
manager_sk~l | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        ln_n |  -.0086809   .0104842    -0.83   0.413    -.0299873    .0126255
        male |   .1000918   .0169297     5.91   0.000     .0656865    .1344972
       _cons |  -.0784933   .0749956    -1.05   0.303    -.2309026     .073916
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
 component_id |       108           0         108     |
 birth_cohort |        18           1          17     |
------------------------------------------------------+

. reghdfe manager_skill i.founder##c.ln_n `controls', a(`FEs') cluster(first_year )
(dropped 1 singleton observations)
(MWFE estimator converged in 4 iterations)

HDFE Linear regression                            Number of obs   =    166,070
Absorbing 2 HDFE groups                           F(   4,     36) =      26.67
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.0019
                                                  Adj R-squared   =     0.0011
                                                  Within R-sq.    =     0.0008
Number of clusters (first_year) =         37      Root MSE        =     2.6491

                              (Std. err. adjusted for 37 clusters in first_year)
--------------------------------------------------------------------------------
               |               Robust
 manager_skill | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
---------------+----------------------------------------------------------------
     1.founder |  -.0970922   .1169844    -0.83   0.412    -.3343476    .1401633
          ln_n |   -.011066   .0160331    -0.69   0.494    -.0435827    .0214507
               |
founder#c.ln_n |
            1  |   -.002095   .0170147    -0.12   0.903    -.0366024    .0324123
               |
          male |    .120982   .0131374     9.21   0.000     .0943382    .1476259
         _cons |   .0421847   .1125482     0.37   0.710    -.1860735    .2704429
--------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
 component_id |       108           0         108     |
 birth_cohort |        19           1          18     |
------------------------------------------------------+

. 
end of do-file

. do "code/estimate/cohort.do"

. use "temp/unfiltered.dta", clear

. merge m:1 frame_id_numeric person_id using "temp/manager_value.dta", keep(match) nogen

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                        10,224,519  
    -----------------------------------------

. 
. * for babyboom, we measure manager skills in revenue units, not as TFP
. replace manager_skill = manager_skill / chi
(8,688,171 real changes made)

. keep if component_id > 0
(7,505,526 observations deleted)

. generate byte hungarian_name = !missing(male)

. 
. keep if hungarian_name
(127,259 observations deleted)

. 
. collapse (mean) manager_skill (min) birth_year first_year = year (max) male last_year = year (min) component_
> id (max) component_size, by(person_id founder)

. reshape wide manager_skill first_year last_year birth_year male, i(person_id) j(founder)
(j = 0 1)

Data                               Long   ->   Wide
-----------------------------------------------------------------------------
Number of observations          254,875   ->   192,073     
Number of variables                   9   ->   13          
j variable (2 values)           founder   ->   (dropped)
xij variables:
                          manager_skill   ->   manager_skill0 manager_skill1
                             first_year   ->   first_year0 first_year1
                              last_year   ->   last_year0 last_year1
                             birth_year   ->   birth_year0 birth_year1
                                   male   ->   male0 male1
-----------------------------------------------------------------------------

. 
. * relatively few overlap, use the first ceo spell
. egen first_year = rowmin(first_year?)

. egen last_year = rowmax(last_year?)

. egen manager_skill = rowmean(manager_skill?)
(26,002 missing values generated)

. egen birth_year = rowmin(birth_year?)

. egen male = rowmax(male?)

. 
. generate byte founder = first_year0 > first_year

. tabulate first_year founder

           |        founder
first_year |         0          1 |     Total
-----------+----------------------+----------
      1986 |       379          0 |       379 
      1987 |        76          0 |        76 
      1988 |        97         14 |       111 
      1989 |       454        484 |       938 
      1990 |     1,139      1,933 |     3,072 
      1991 |     1,397      3,363 |     4,760 
      1992 |     2,168      9,746 |    11,914 
      1993 |     1,836      5,234 |     7,070 
      1994 |     1,897      5,375 |     7,272 
      1995 |     1,827      4,514 |     6,341 
      1996 |     2,133      4,813 |     6,946 
      1997 |     2,402      5,133 |     7,535 
      1998 |     2,484      5,263 |     7,747 
      1999 |     2,421      3,523 |     5,944 
      2000 |     3,222      4,470 |     7,692 
      2001 |     2,728      4,322 |     7,050 
      2002 |     2,726      3,992 |     6,718 
      2003 |     2,732      3,509 |     6,241 
      2004 |     3,006      3,771 |     6,777 
      2005 |     3,136      3,019 |     6,155 
      2006 |     3,101      3,059 |     6,160 
      2007 |     2,837      2,581 |     5,418 
      2008 |     3,397      3,251 |     6,648 
      2009 |     3,002      3,190 |     6,192 
      2010 |     3,048      2,925 |     5,973 
      2011 |     3,029      2,736 |     5,765 
      2012 |     3,455      2,713 |     6,168 
      2013 |     4,565      2,511 |     7,076 
      2014 |     3,073      1,510 |     4,583 
      2015 |     2,954      1,040 |     3,994 
      2016 |     3,180        997 |     4,177 
      2017 |     3,101        949 |     4,050 
      2018 |     2,635        767 |     3,402 
      2019 |     2,466        612 |     3,078 
      2020 |     2,925        514 |     3,439 
      2021 |     2,296        466 |     2,762 
      2022 |     2,121        329 |     2,450 
-----------+----------------------+----------
     Total |    89,445    102,628 |   192,073 

. 
. generate cohort = int(first_year/5)*5

. tabulate cohort founder

           |        founder
    cohort |         0          1 |     Total
-----------+----------------------+----------
      1985 |     1,006        498 |     1,504 
      1990 |     8,437     25,651 |    34,088 
      1995 |    11,267     23,246 |    34,513 
      2000 |    14,414     20,064 |    34,478 
      2005 |    15,473     15,100 |    30,573 
      2010 |    17,170     12,395 |    29,565 
      2015 |    14,336      4,365 |    18,701 
      2020 |     7,342      1,309 |     8,651 
-----------+----------------------+----------
     Total |    89,445    102,628 |   192,073 

. 
. generate birth_cohort = int(birth_year/5)*5

. 
. egen n = count(person_id), by(first_year founder male)

. generate ln_n = ln(n)

. 
. local controls male

. local FEs component_id birth_cohort

. 
. * different components may have different means
. reghdfe manager_skill ib1985.cohort `controls' if founder, a(`FEs') cluster(first_year )
(dropped 1 singleton observations)
(MWFE estimator converged in 4 iterations)

HDFE Linear regression                            Number of obs   =     91,986
Absorbing 2 HDFE groups                           F(   8,     34) =       5.75
Statistics robust to heteroskedasticity           Prob > F        =     0.0001
                                                  R-squared       =     0.0011
                                                  Adj R-squared   =    -0.0003
                                                  Within R-sq.    =     0.0003
Number of clusters (first_year) =         35      Root MSE        =     2.5982

                            (Std. err. adjusted for 35 clusters in first_year)
------------------------------------------------------------------------------
             |               Robust
manager_sk~l | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      cohort |
       1990  |  -.0365859   .0485239    -0.75   0.456    -.1351984    .0620266
       1995  |  -.0344858   .0516169    -0.67   0.509    -.1393839    .0704124
       2000  |  -.0095834   .0521712    -0.18   0.855    -.1156081    .0964412
       2005  |  -.0260274   .0537519    -0.48   0.631    -.1352644    .0832096
       2010  |  -.0233536   .0535237    -0.44   0.665    -.1321268    .0854196
       2015  |   .0069092    .061627     0.11   0.911     -.118332    .1321504
       2020  |   .0117523   .0882882     0.13   0.895    -.1676709    .1911754
             |
        male |   .0955129   .0163938     5.83   0.000     .0621967    .1288292
       _cons |  -.1128263   .0524407    -2.15   0.039    -.2193986   -.0062539
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
 component_id |       108           0         108     |
 birth_cohort |        18           1          17     |
------------------------------------------------------+

. reghdfe manager_skill ib1985.cohort `controls' if !founder, a(`FEs') cluster(first_year )
(dropped 2 singleton observations)
(MWFE estimator converged in 5 iterations)

HDFE Linear regression                            Number of obs   =     74,082
Absorbing 2 HDFE groups                           F(   8,     36) =      34.37
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.0034
                                                  Adj R-squared   =     0.0016
                                                  Within R-sq.    =     0.0016
Number of clusters (first_year) =         37      Root MSE        =     2.7111

                            (Std. err. adjusted for 37 clusters in first_year)
------------------------------------------------------------------------------
             |               Robust
manager_sk~l | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      cohort |
       1990  |  -.1675235   .0462675    -3.62   0.001    -.2613583   -.0736887
       1995  |  -.3246808   .0462586    -7.02   0.000    -.4184977   -.2308639
       2000  |  -.2266323   .0414112    -5.47   0.000    -.3106181   -.1426465
       2005  |  -.2121101   .0392491    -5.40   0.000     -.291711   -.1325091
       2010  |  -.1643334    .040068    -4.10   0.000    -.2455951   -.0830718
       2015  |  -.0851962   .0486231    -1.75   0.088    -.1838085    .0134161
       2020  |   .0638779   .0501514     1.27   0.211    -.0378338    .1655896
             |
        male |   .1480399   .0195693     7.56   0.000     .1083516    .1877283
       _cons |   .1351719   .0380854     3.55   0.001     .0579312    .2124126
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
 component_id |       108           0         108     |
 birth_cohort |        18           1          17     |
------------------------------------------------------+

. 
. reghdfe manager_skill ln_n `controls' if !founder, a(`FEs') cluster(first_year )
(dropped 2 singleton observations)
(MWFE estimator converged in 4 iterations)

HDFE Linear regression                            Number of obs   =     74,082
Absorbing 2 HDFE groups                           F(   2,     36) =      23.71
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.0025
                                                  Adj R-squared   =     0.0008
                                                  Within R-sq.    =     0.0007
Number of clusters (first_year) =         37      Root MSE        =     2.7122

                            (Std. err. adjusted for 37 clusters in first_year)
------------------------------------------------------------------------------
             |               Robust
manager_sk~l | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        ln_n |   -.075305   .0291135    -2.59   0.014    -.1343499   -.0162602
        male |   .1561979   .0231795     6.74   0.000     .1091878     .203208
       _cons |   .4973558   .2074373     2.40   0.022     .0766534    .9180581
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
 component_id |       108           0         108     |
 birth_cohort |        18           1          17     |
------------------------------------------------------+

. reghdfe manager_skill ln_n `controls' if founder, a(`FEs') cluster(first_year )
(dropped 1 singleton observations)
(MWFE estimator converged in 4 iterations)

HDFE Linear regression                            Number of obs   =     91,986
Absorbing 2 HDFE groups                           F(   2,     34) =      16.52
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.0011
                                                  Adj R-squared   =    -0.0003
                                                  Within R-sq.    =     0.0003
Number of clusters (first_year) =         35      Root MSE        =     2.5981

                            (Std. err. adjusted for 35 clusters in first_year)
------------------------------------------------------------------------------
             |               Robust
manager_sk~l | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        ln_n |   .0033651   .0169101     0.20   0.843    -.0310004    .0377305
        male |   .0911962   .0197994     4.61   0.000      .050959    .1314334
       _cons |  -.1612133   .1209524    -1.33   0.191    -.4070182    .0845917
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
 component_id |       108           0         108     |
 birth_cohort |        18           1          17     |
------------------------------------------------------+

. reghdfe manager_skill i.founder##c.ln_n `controls', a(`FEs') cluster(first_year )
(dropped 1 singleton observations)
(MWFE estimator converged in 4 iterations)

HDFE Linear regression                            Number of obs   =    166,070
Absorbing 2 HDFE groups                           F(   4,     36) =      26.67
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.0019
                                                  Adj R-squared   =     0.0011
                                                  Within R-sq.    =     0.0008
Number of clusters (first_year) =         37      Root MSE        =     2.6491

                              (Std. err. adjusted for 37 clusters in first_year)
--------------------------------------------------------------------------------
               |               Robust
 manager_skill | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
---------------+----------------------------------------------------------------
     1.founder |  -.4436155   .1931028    -2.30   0.028    -.8352461    -.051985
          ln_n |  -.0446891    .025699    -1.74   0.091    -.0968091    .0074309
               |
founder#c.ln_n |
            1  |   .0452777   .0259291     1.75   0.089    -.0073091    .0978644
               |
          male |   .1190811   .0154275     7.72   0.000     .0877927    .1503695
         _cons |   .2908382   .1866907     1.56   0.128     -.087788    .6694645
--------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
 component_id |       108           0         108     |
 birth_cohort |        19           1          18     |
------------------------------------------------------+

. 
end of do-file

. do "code/estimate/cohort.do"

. use "temp/unfiltered.dta", clear

. merge m:1 frame_id_numeric person_id using "temp/manager_value.dta", keep(match) nogen

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                        10,224,519  
    -----------------------------------------

. 
. * for babyboom, we measure manager skills in revenue units, not as TFP
. replace manager_skill = manager_skill / chi
(8,688,171 real changes made)

. keep if component_id > 0
(7,505,526 observations deleted)

. generate byte hungarian_name = !missing(male)

. 
. keep if hungarian_name
(127,259 observations deleted)

. 
. collapse (mean) manager_skill (min) birth_year first_year = year (max) male last_year = year (min) component_
> id (max) component_size, by(person_id founder)

. reshape wide manager_skill first_year last_year birth_year male, i(person_id) j(founder)
(j = 0 1)

Data                               Long   ->   Wide
-----------------------------------------------------------------------------
Number of observations          254,875   ->   192,073     
Number of variables                   9   ->   13          
j variable (2 values)           founder   ->   (dropped)
xij variables:
                          manager_skill   ->   manager_skill0 manager_skill1
                             first_year   ->   first_year0 first_year1
                              last_year   ->   last_year0 last_year1
                             birth_year   ->   birth_year0 birth_year1
                                   male   ->   male0 male1
-----------------------------------------------------------------------------

. 
. * relatively few overlap, use the first ceo spell
. egen first_year = rowmin(first_year?)

. egen last_year = rowmax(last_year?)

. egen manager_skill = rowmean(manager_skill?)
(26,002 missing values generated)

. egen birth_year = rowmin(birth_year?)

. egen male = rowmax(male?)

. 
. generate byte founder = first_year0 > first_year

. tabulate first_year founder

           |        founder
first_year |         0          1 |     Total
-----------+----------------------+----------
      1986 |       379          0 |       379 
      1987 |        76          0 |        76 
      1988 |        97         14 |       111 
      1989 |       454        484 |       938 
      1990 |     1,139      1,933 |     3,072 
      1991 |     1,397      3,363 |     4,760 
      1992 |     2,168      9,746 |    11,914 
      1993 |     1,836      5,234 |     7,070 
      1994 |     1,897      5,375 |     7,272 
      1995 |     1,827      4,514 |     6,341 
      1996 |     2,133      4,813 |     6,946 
      1997 |     2,402      5,133 |     7,535 
      1998 |     2,484      5,263 |     7,747 
      1999 |     2,421      3,523 |     5,944 
      2000 |     3,222      4,470 |     7,692 
      2001 |     2,728      4,322 |     7,050 
      2002 |     2,726      3,992 |     6,718 
      2003 |     2,732      3,509 |     6,241 
      2004 |     3,006      3,771 |     6,777 
      2005 |     3,136      3,019 |     6,155 
      2006 |     3,101      3,059 |     6,160 
      2007 |     2,837      2,581 |     5,418 
      2008 |     3,397      3,251 |     6,648 
      2009 |     3,002      3,190 |     6,192 
      2010 |     3,048      2,925 |     5,973 
      2011 |     3,029      2,736 |     5,765 
      2012 |     3,455      2,713 |     6,168 
      2013 |     4,565      2,511 |     7,076 
      2014 |     3,073      1,510 |     4,583 
      2015 |     2,954      1,040 |     3,994 
      2016 |     3,180        997 |     4,177 
      2017 |     3,101        949 |     4,050 
      2018 |     2,635        767 |     3,402 
      2019 |     2,466        612 |     3,078 
      2020 |     2,925        514 |     3,439 
      2021 |     2,296        466 |     2,762 
      2022 |     2,121        329 |     2,450 
-----------+----------------------+----------
     Total |    89,445    102,628 |   192,073 

. 
. generate cohort = int(first_year/5)*5

. tabulate cohort founder

           |        founder
    cohort |         0          1 |     Total
-----------+----------------------+----------
      1985 |     1,006        498 |     1,504 
      1990 |     8,437     25,651 |    34,088 
      1995 |    11,267     23,246 |    34,513 
      2000 |    14,414     20,064 |    34,478 
      2005 |    15,473     15,100 |    30,573 
      2010 |    17,170     12,395 |    29,565 
      2015 |    14,336      4,365 |    18,701 
      2020 |     7,342      1,309 |     8,651 
-----------+----------------------+----------
     Total |    89,445    102,628 |   192,073 

. 
. generate birth_cohort = int(birth_year/5)*5

. 
. egen n = count(person_id), by(first_year birth_cohort founder male)

. generate ln_n = ln(n)

. 
. local controls male

. local FEs component_id birth_cohort

. 
. * different components may have different means
. reghdfe manager_skill ib1985.cohort `controls' if founder, a(`FEs') cluster(first_year )
(dropped 1 singleton observations)
(MWFE estimator converged in 4 iterations)

HDFE Linear regression                            Number of obs   =     91,986
Absorbing 2 HDFE groups                           F(   8,     34) =       5.75
Statistics robust to heteroskedasticity           Prob > F        =     0.0001
                                                  R-squared       =     0.0011
                                                  Adj R-squared   =    -0.0003
                                                  Within R-sq.    =     0.0003
Number of clusters (first_year) =         35      Root MSE        =     2.5982

                            (Std. err. adjusted for 35 clusters in first_year)
------------------------------------------------------------------------------
             |               Robust
manager_sk~l | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      cohort |
       1990  |  -.0365859   .0485239    -0.75   0.456    -.1351984    .0620266
       1995  |  -.0344858   .0516169    -0.67   0.509    -.1393839    .0704124
       2000  |  -.0095834   .0521712    -0.18   0.855    -.1156081    .0964412
       2005  |  -.0260274   .0537519    -0.48   0.631    -.1352644    .0832096
       2010  |  -.0233536   .0535237    -0.44   0.665    -.1321268    .0854196
       2015  |   .0069092    .061627     0.11   0.911     -.118332    .1321504
       2020  |   .0117523   .0882882     0.13   0.895    -.1676709    .1911754
             |
        male |   .0955129   .0163938     5.83   0.000     .0621967    .1288292
       _cons |  -.1128263   .0524407    -2.15   0.039    -.2193986   -.0062539
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
 component_id |       108           0         108     |
 birth_cohort |        18           1          17     |
------------------------------------------------------+

. reghdfe manager_skill ib1985.cohort `controls' if !founder, a(`FEs') cluster(first_year )
(dropped 2 singleton observations)
(MWFE estimator converged in 5 iterations)

HDFE Linear regression                            Number of obs   =     74,082
Absorbing 2 HDFE groups                           F(   8,     36) =      34.37
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.0034
                                                  Adj R-squared   =     0.0016
                                                  Within R-sq.    =     0.0016
Number of clusters (first_year) =         37      Root MSE        =     2.7111

                            (Std. err. adjusted for 37 clusters in first_year)
------------------------------------------------------------------------------
             |               Robust
manager_sk~l | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      cohort |
       1990  |  -.1675235   .0462675    -3.62   0.001    -.2613583   -.0736887
       1995  |  -.3246808   .0462586    -7.02   0.000    -.4184977   -.2308639
       2000  |  -.2266323   .0414112    -5.47   0.000    -.3106181   -.1426465
       2005  |  -.2121101   .0392491    -5.40   0.000     -.291711   -.1325091
       2010  |  -.1643334    .040068    -4.10   0.000    -.2455951   -.0830718
       2015  |  -.0851962   .0486231    -1.75   0.088    -.1838085    .0134161
       2020  |   .0638779   .0501514     1.27   0.211    -.0378338    .1655896
             |
        male |   .1480399   .0195693     7.56   0.000     .1083516    .1877283
       _cons |   .1351719   .0380854     3.55   0.001     .0579312    .2124126
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
 component_id |       108           0         108     |
 birth_cohort |        18           1          17     |
------------------------------------------------------+

. 
. reghdfe manager_skill ln_n `controls' if !founder, a(`FEs') cluster(first_year )
(dropped 2 singleton observations)
(MWFE estimator converged in 5 iterations)

HDFE Linear regression                            Number of obs   =     74,082
Absorbing 2 HDFE groups                           F(   2,     36) =      26.71
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.0024
                                                  Adj R-squared   =     0.0007
                                                  Within R-sq.    =     0.0006
Number of clusters (first_year) =         37      Root MSE        =     2.7123

                            (Std. err. adjusted for 37 clusters in first_year)
------------------------------------------------------------------------------
             |               Robust
manager_sk~l | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        ln_n |  -.0200811   .0152349    -1.32   0.196    -.0509788    .0108166
        male |   .1436374     .01982     7.25   0.000     .1034407    .1838342
       _cons |    .065851   .0844115     0.78   0.440    -.1053434    .2370455
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
 component_id |       108           0         108     |
 birth_cohort |        18           1          17     |
------------------------------------------------------+

. reghdfe manager_skill ln_n `controls' if founder, a(`FEs') cluster(first_year )
(dropped 1 singleton observations)
(MWFE estimator converged in 4 iterations)

HDFE Linear regression                            Number of obs   =     91,986
Absorbing 2 HDFE groups                           F(   2,     34) =      18.22
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.0011
                                                  Adj R-squared   =    -0.0003
                                                  Within R-sq.    =     0.0003
Number of clusters (first_year) =         35      Root MSE        =     2.5981

                            (Std. err. adjusted for 35 clusters in first_year)
------------------------------------------------------------------------------
             |               Robust
manager_sk~l | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        ln_n |  -.0106408   .0098931    -1.08   0.290     -.030746    .0094644
        male |    .101219    .016833     6.01   0.000     .0670103    .1354277
       _cons |  -.0808322     .05697    -1.42   0.165    -.1966092    .0349448
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
 component_id |       108           0         108     |
 birth_cohort |        18           1          17     |
------------------------------------------------------+

. reghdfe manager_skill i.founder##c.ln_n `controls', a(`FEs') cluster(first_year )
(dropped 1 singleton observations)
(MWFE estimator converged in 4 iterations)

HDFE Linear regression                            Number of obs   =    166,070
Absorbing 2 HDFE groups                           F(   4,     36) =      29.31
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.0019
                                                  Adj R-squared   =     0.0011
                                                  Within R-sq.    =     0.0008
Number of clusters (first_year) =         37      Root MSE        =     2.6491

                              (Std. err. adjusted for 37 clusters in first_year)
--------------------------------------------------------------------------------
               |               Robust
 manager_skill | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
---------------+----------------------------------------------------------------
     1.founder |  -.0981158   .0815544    -1.20   0.237    -.2635158    .0672842
          ln_n |  -.0106044   .0134084    -0.79   0.434    -.0377979    .0165891
               |
founder#c.ln_n |
            1  |  -.0025125   .0153396    -0.16   0.871    -.0336226    .0285976
               |
          male |   .1205439   .0126143     9.56   0.000     .0949609    .1461269
         _cons |   .0236802   .0734245     0.32   0.749    -.1252316     .172592
--------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
 component_id |       108           0         108     |
 birth_cohort |        19           1          18     |
------------------------------------------------------+

. 
end of do-file

. do "code/estimate/cohort.do"

. use "temp/unfiltered.dta", clear

. merge m:1 frame_id_numeric person_id using "temp/manager_value.dta", keep(match) nogen

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                        10,224,519  
    -----------------------------------------

. 
. * for babyboom, we measure manager skills in revenue units, not as TFP
. replace manager_skill = manager_skill / chi
(8,688,171 real changes made)

. keep if component_id > 0
(7,505,526 observations deleted)

. generate byte hungarian_name = !missing(male)

. 
. keep if hungarian_name
(127,259 observations deleted)

. 
. collapse (mean) manager_skill (min) birth_year first_year = year (max) male last_year = year (min) component_
> id (max) component_size, by(person_id founder)

. reshape wide manager_skill first_year last_year birth_year male, i(person_id) j(founder)
(j = 0 1)

Data                               Long   ->   Wide
-----------------------------------------------------------------------------
Number of observations          254,875   ->   192,073     
Number of variables                   9   ->   13          
j variable (2 values)           founder   ->   (dropped)
xij variables:
                          manager_skill   ->   manager_skill0 manager_skill1
                             first_year   ->   first_year0 first_year1
                              last_year   ->   last_year0 last_year1
                             birth_year   ->   birth_year0 birth_year1
                                   male   ->   male0 male1
-----------------------------------------------------------------------------

. 
. * relatively few overlap, use the first ceo spell
. egen first_year = rowmin(first_year?)

. egen last_year = rowmax(last_year?)

. egen manager_skill = rowmean(manager_skill?)
(26,002 missing values generated)

. egen birth_year = rowmin(birth_year?)

. egen male = rowmax(male?)

. 
. generate byte founder = first_year0 > first_year

. tabulate first_year founder

           |        founder
first_year |         0          1 |     Total
-----------+----------------------+----------
      1986 |       379          0 |       379 
      1987 |        76          0 |        76 
      1988 |        97         14 |       111 
      1989 |       454        484 |       938 
      1990 |     1,139      1,933 |     3,072 
      1991 |     1,397      3,363 |     4,760 
      1992 |     2,168      9,746 |    11,914 
      1993 |     1,836      5,234 |     7,070 
      1994 |     1,897      5,375 |     7,272 
      1995 |     1,827      4,514 |     6,341 
      1996 |     2,133      4,813 |     6,946 
      1997 |     2,402      5,133 |     7,535 
      1998 |     2,484      5,263 |     7,747 
      1999 |     2,421      3,523 |     5,944 
      2000 |     3,222      4,470 |     7,692 
      2001 |     2,728      4,322 |     7,050 
      2002 |     2,726      3,992 |     6,718 
      2003 |     2,732      3,509 |     6,241 
      2004 |     3,006      3,771 |     6,777 
      2005 |     3,136      3,019 |     6,155 
      2006 |     3,101      3,059 |     6,160 
      2007 |     2,837      2,581 |     5,418 
      2008 |     3,397      3,251 |     6,648 
      2009 |     3,002      3,190 |     6,192 
      2010 |     3,048      2,925 |     5,973 
      2011 |     3,029      2,736 |     5,765 
      2012 |     3,455      2,713 |     6,168 
      2013 |     4,565      2,511 |     7,076 
      2014 |     3,073      1,510 |     4,583 
      2015 |     2,954      1,040 |     3,994 
      2016 |     3,180        997 |     4,177 
      2017 |     3,101        949 |     4,050 
      2018 |     2,635        767 |     3,402 
      2019 |     2,466        612 |     3,078 
      2020 |     2,925        514 |     3,439 
      2021 |     2,296        466 |     2,762 
      2022 |     2,121        329 |     2,450 
-----------+----------------------+----------
     Total |    89,445    102,628 |   192,073 

. 
. generate cohort = int(first_year/5)*5

. tabulate cohort founder

           |        founder
    cohort |         0          1 |     Total
-----------+----------------------+----------
      1985 |     1,006        498 |     1,504 
      1990 |     8,437     25,651 |    34,088 
      1995 |    11,267     23,246 |    34,513 
      2000 |    14,414     20,064 |    34,478 
      2005 |    15,473     15,100 |    30,573 
      2010 |    17,170     12,395 |    29,565 
      2015 |    14,336      4,365 |    18,701 
      2020 |     7,342      1,309 |     8,651 
-----------+----------------------+----------
     Total |    89,445    102,628 |   192,073 

. 
. generate birth_cohort = int(birth_year/5)*5

. 
. egen n = count(person_id), by(first_year founder male)

. generate ln_n = ln(n)

. 
. local controls male

. local FEs component_id 

. 
. * different components may have different means
. reghdfe manager_skill ib1985.cohort `controls' if founder, a(`FEs') cluster(first_year )
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =     91,987
Absorbing 1 HDFE group                            F(   8,     34) =       8.03
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.0008
                                                  Adj R-squared   =    -0.0004
                                                  Within R-sq.    =     0.0004
Number of clusters (first_year) =         35      Root MSE        =     2.5982

                            (Std. err. adjusted for 35 clusters in first_year)
------------------------------------------------------------------------------
             |               Robust
manager_sk~l | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      cohort |
       1990  |  -.0255756   .0492642    -0.52   0.607    -.1256926    .0745413
       1995  |  -.0099235   .0524768    -0.19   0.851    -.1165693    .0967222
       2000  |   .0283848   .0499329     0.57   0.573     -.073091    .1298607
       2005  |   .0260705   .0500889     0.52   0.606    -.0757224    .1278633
       2010  |   .0353116   .0497461     0.71   0.483    -.0657845    .1364078
       2015  |   .0736584   .0575827     1.28   0.209    -.0433637    .1906805
       2020  |   .1047268   .0873692     1.20   0.239    -.0728288    .2822823
             |
        male |   .1009558   .0163833     6.16   0.000      .067661    .1342506
       _cons |  -.1496115   .0503831    -2.97   0.005    -.2520024   -.0472207
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
 component_id |       108           0         108     |
------------------------------------------------------+

. reghdfe manager_skill ib1985.cohort `controls' if !founder, a(`FEs') cluster(first_year )
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =     74,084
Absorbing 1 HDFE group                            F(   8,     36) =      51.75
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.0027
                                                  Adj R-squared   =     0.0012
                                                  Within R-sq.    =     0.0022
Number of clusters (first_year) =         37      Root MSE        =     2.7116

                            (Std. err. adjusted for 37 clusters in first_year)
------------------------------------------------------------------------------
             |               Robust
manager_sk~l | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      cohort |
       1990  |  -.1023543   .0448883    -2.28   0.029     -.193392   -.0113166
       1995  |  -.2351255   .0403102    -5.83   0.000    -.3168784   -.1533726
       2000  |  -.1265936   .0305916    -4.14   0.000    -.1886362    -.064551
       2005  |  -.0933329    .026054    -3.58   0.001    -.1461728    -.040493
       2010  |  -.0423597   .0361934    -1.17   0.250    -.1157634     .031044
       2015  |   .0453645   .0314321     1.44   0.158    -.0183829    .1091118
       2020  |   .1929246   .0278337     6.93   0.000     .1364752    .2493739
             |
        male |   .1560785   .0206941     7.54   0.000     .1141088    .1980481
       _cons |    .023252   .0296694     0.78   0.438    -.0369204    .0834244
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
 component_id |       108           0         108     |
------------------------------------------------------+

. 
. reghdfe manager_skill ln_n `controls' if !founder, a(`FEs') cluster(first_year )
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =     74,084
Absorbing 1 HDFE group                            F(   2,     36) =      21.71
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.0012
                                                  Adj R-squared   =    -0.0002
                                                  Within R-sq.    =     0.0006
Number of clusters (first_year) =         37      Root MSE        =     2.7136

                            (Std. err. adjusted for 37 clusters in first_year)
------------------------------------------------------------------------------
             |               Robust
manager_sk~l | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        ln_n |  -.0174438   .0291028    -0.60   0.553     -.076467    .0415794
        male |   .1428384   .0237827     6.01   0.000     .0946048     .191072
       _cons |   .0872602   .2088337     0.42   0.679    -.3362742    .5107945
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
 component_id |       108           0         108     |
------------------------------------------------------+

. reghdfe manager_skill ln_n `controls' if founder, a(`FEs') cluster(first_year )
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =     91,987
Absorbing 1 HDFE group                            F(   2,     34) =      16.70
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.0008
                                                  Adj R-squared   =    -0.0004
                                                  Within R-sq.    =     0.0003
Number of clusters (first_year) =         35      Root MSE        =     2.5983

                            (Std. err. adjusted for 35 clusters in first_year)
------------------------------------------------------------------------------
             |               Robust
manager_sk~l | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        ln_n |  -.0249692   .0139916    -1.78   0.083    -.0534037    .0034652
        male |   .1131873   .0205456     5.51   0.000     .0714336     .154941
       _cons |   .0403663   .0986402     0.41   0.685    -.1600946    .2408273
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
 component_id |       108           0         108     |
------------------------------------------------------+

. reghdfe manager_skill i.founder##c.ln_n `controls', a(`FEs') cluster(first_year )
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =    166,071
Absorbing 1 HDFE group                            F(   4,     36) =      28.67
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.0012
                                                  Adj R-squared   =     0.0006
                                                  Within R-sq.    =     0.0010
Number of clusters (first_year) =         37      Root MSE        =     2.6498

                              (Std. err. adjusted for 37 clusters in first_year)
--------------------------------------------------------------------------------
               |               Robust
 manager_skill | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
---------------+----------------------------------------------------------------
     1.founder |   .0225821   .2058545     0.11   0.913    -.3949102    .4400745
          ln_n |  -.0111074   .0287484    -0.39   0.701    -.0694118    .0471969
               |
founder#c.ln_n |
            1  |   -.019441    .027823    -0.70   0.489    -.0758688    .0369867
               |
          male |   .1287089   .0156868     8.20   0.000     .0968946    .1605231
         _cons |   .0499288   .2081494     0.24   0.812    -.3722178    .4720753
--------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
 component_id |       108           0         108     |
------------------------------------------------------+

. 
end of do-file

. do "code/estimate/cohort.do"

. use "temp/unfiltered.dta", clear

. merge m:1 frame_id_numeric person_id using "temp/manager_value.dta", keep(match) nogen

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                        10,224,519  
    -----------------------------------------

. 
. * for babyboom, we measure manager skills in revenue units, not as TFP
. replace manager_skill = manager_skill / chi
(8,688,171 real changes made)

. keep if component_id > 0
(7,505,526 observations deleted)

. generate byte hungarian_name = !missing(male)

. 
. keep if hungarian_name
(127,259 observations deleted)

. 
. collapse (mean) manager_skill (min) birth_year first_year = year (max) male last_year = year (min) component_
> id (max) component_size, by(person_id founder)

. reshape wide manager_skill first_year last_year birth_year male, i(person_id) j(founder)
(j = 0 1)

Data                               Long   ->   Wide
-----------------------------------------------------------------------------
Number of observations          254,875   ->   192,073     
Number of variables                   9   ->   13          
j variable (2 values)           founder   ->   (dropped)
xij variables:
                          manager_skill   ->   manager_skill0 manager_skill1
                             first_year   ->   first_year0 first_year1
                              last_year   ->   last_year0 last_year1
                             birth_year   ->   birth_year0 birth_year1
                                   male   ->   male0 male1
-----------------------------------------------------------------------------

. 
. * relatively few overlap, use the first ceo spell
. egen first_year = rowmin(first_year?)

. egen last_year = rowmax(last_year?)

. egen manager_skill = rowmean(manager_skill?)
(26,002 missing values generated)

. egen birth_year = rowmin(birth_year?)

. egen male = rowmax(male?)

. 
. generate byte founder = first_year0 > first_year

. tabulate first_year founder

           |        founder
first_year |         0          1 |     Total
-----------+----------------------+----------
      1986 |       379          0 |       379 
      1987 |        76          0 |        76 
      1988 |        97         14 |       111 
      1989 |       454        484 |       938 
      1990 |     1,139      1,933 |     3,072 
      1991 |     1,397      3,363 |     4,760 
      1992 |     2,168      9,746 |    11,914 
      1993 |     1,836      5,234 |     7,070 
      1994 |     1,897      5,375 |     7,272 
      1995 |     1,827      4,514 |     6,341 
      1996 |     2,133      4,813 |     6,946 
      1997 |     2,402      5,133 |     7,535 
      1998 |     2,484      5,263 |     7,747 
      1999 |     2,421      3,523 |     5,944 
      2000 |     3,222      4,470 |     7,692 
      2001 |     2,728      4,322 |     7,050 
      2002 |     2,726      3,992 |     6,718 
      2003 |     2,732      3,509 |     6,241 
      2004 |     3,006      3,771 |     6,777 
      2005 |     3,136      3,019 |     6,155 
      2006 |     3,101      3,059 |     6,160 
      2007 |     2,837      2,581 |     5,418 
      2008 |     3,397      3,251 |     6,648 
      2009 |     3,002      3,190 |     6,192 
      2010 |     3,048      2,925 |     5,973 
      2011 |     3,029      2,736 |     5,765 
      2012 |     3,455      2,713 |     6,168 
      2013 |     4,565      2,511 |     7,076 
      2014 |     3,073      1,510 |     4,583 
      2015 |     2,954      1,040 |     3,994 
      2016 |     3,180        997 |     4,177 
      2017 |     3,101        949 |     4,050 
      2018 |     2,635        767 |     3,402 
      2019 |     2,466        612 |     3,078 
      2020 |     2,925        514 |     3,439 
      2021 |     2,296        466 |     2,762 
      2022 |     2,121        329 |     2,450 
-----------+----------------------+----------
     Total |    89,445    102,628 |   192,073 

. 
. generate cohort = int(first_year/5)*5

. tabulate cohort founder

           |        founder
    cohort |         0          1 |     Total
-----------+----------------------+----------
      1985 |     1,006        498 |     1,504 
      1990 |     8,437     25,651 |    34,088 
      1995 |    11,267     23,246 |    34,513 
      2000 |    14,414     20,064 |    34,478 
      2005 |    15,473     15,100 |    30,573 
      2010 |    17,170     12,395 |    29,565 
      2015 |    14,336      4,365 |    18,701 
      2020 |     7,342      1,309 |     8,651 
-----------+----------------------+----------
     Total |    89,445    102,628 |   192,073 

. 
. generate birth_cohort = int(birth_year/5)*5

. 
. egen n = count(person_id), by(first_year founder male)

. generate ln_n = ln(n)

. 
. local controls male

. local FEs component_id birth_cohort

. 
. * different components may have different means
. reghdfe manager_skill ib1985.cohort `controls' if founder, a(`FEs') cluster(first_year )
(dropped 1 singleton observations)
(MWFE estimator converged in 4 iterations)

HDFE Linear regression                            Number of obs   =     91,986
Absorbing 2 HDFE groups                           F(   8,     34) =       5.75
Statistics robust to heteroskedasticity           Prob > F        =     0.0001
                                                  R-squared       =     0.0011
                                                  Adj R-squared   =    -0.0003
                                                  Within R-sq.    =     0.0003
Number of clusters (first_year) =         35      Root MSE        =     2.5982

                            (Std. err. adjusted for 35 clusters in first_year)
------------------------------------------------------------------------------
             |               Robust
manager_sk~l | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      cohort |
       1990  |  -.0365859   .0485239    -0.75   0.456    -.1351984    .0620266
       1995  |  -.0344858   .0516169    -0.67   0.509    -.1393839    .0704124
       2000  |  -.0095834   .0521712    -0.18   0.855    -.1156081    .0964412
       2005  |  -.0260274   .0537519    -0.48   0.631    -.1352644    .0832096
       2010  |  -.0233536   .0535237    -0.44   0.665    -.1321268    .0854196
       2015  |   .0069092    .061627     0.11   0.911     -.118332    .1321504
       2020  |   .0117523   .0882882     0.13   0.895    -.1676709    .1911754
             |
        male |   .0955129   .0163938     5.83   0.000     .0621967    .1288292
       _cons |  -.1128263   .0524407    -2.15   0.039    -.2193986   -.0062539
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
 component_id |       108           0         108     |
 birth_cohort |        18           1          17     |
------------------------------------------------------+

. reghdfe manager_skill ib1985.cohort `controls' if !founder, a(`FEs') cluster(first_year )
(dropped 2 singleton observations)
(MWFE estimator converged in 5 iterations)

HDFE Linear regression                            Number of obs   =     74,082
Absorbing 2 HDFE groups                           F(   8,     36) =      34.37
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.0034
                                                  Adj R-squared   =     0.0016
                                                  Within R-sq.    =     0.0016
Number of clusters (first_year) =         37      Root MSE        =     2.7111

                            (Std. err. adjusted for 37 clusters in first_year)
------------------------------------------------------------------------------
             |               Robust
manager_sk~l | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      cohort |
       1990  |  -.1675235   .0462675    -3.62   0.001    -.2613583   -.0736887
       1995  |  -.3246808   .0462586    -7.02   0.000    -.4184977   -.2308639
       2000  |  -.2266323   .0414112    -5.47   0.000    -.3106181   -.1426465
       2005  |  -.2121101   .0392491    -5.40   0.000     -.291711   -.1325091
       2010  |  -.1643334    .040068    -4.10   0.000    -.2455951   -.0830718
       2015  |  -.0851962   .0486231    -1.75   0.088    -.1838085    .0134161
       2020  |   .0638779   .0501514     1.27   0.211    -.0378338    .1655896
             |
        male |   .1480399   .0195693     7.56   0.000     .1083516    .1877283
       _cons |   .1351719   .0380854     3.55   0.001     .0579312    .2124126
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
 component_id |       108           0         108     |
 birth_cohort |        18           1          17     |
------------------------------------------------------+

. 
. reghdfe manager_skill ln_n `controls' if !founder, a(`FEs') cluster(first_year )
(dropped 2 singleton observations)
(MWFE estimator converged in 4 iterations)

HDFE Linear regression                            Number of obs   =     74,082
Absorbing 2 HDFE groups                           F(   2,     36) =      23.71
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.0025
                                                  Adj R-squared   =     0.0008
                                                  Within R-sq.    =     0.0007
Number of clusters (first_year) =         37      Root MSE        =     2.7122

                            (Std. err. adjusted for 37 clusters in first_year)
------------------------------------------------------------------------------
             |               Robust
manager_sk~l | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        ln_n |   -.075305   .0291135    -2.59   0.014    -.1343499   -.0162602
        male |   .1561979   .0231795     6.74   0.000     .1091878     .203208
       _cons |   .4973558   .2074373     2.40   0.022     .0766534    .9180581
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
 component_id |       108           0         108     |
 birth_cohort |        18           1          17     |
------------------------------------------------------+

. reghdfe manager_skill ln_n `controls' if founder, a(`FEs') cluster(first_year )
(dropped 1 singleton observations)
(MWFE estimator converged in 4 iterations)

HDFE Linear regression                            Number of obs   =     91,986
Absorbing 2 HDFE groups                           F(   2,     34) =      16.52
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.0011
                                                  Adj R-squared   =    -0.0003
                                                  Within R-sq.    =     0.0003
Number of clusters (first_year) =         35      Root MSE        =     2.5981

                            (Std. err. adjusted for 35 clusters in first_year)
------------------------------------------------------------------------------
             |               Robust
manager_sk~l | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        ln_n |   .0033651   .0169101     0.20   0.843    -.0310004    .0377305
        male |   .0911962   .0197994     4.61   0.000      .050959    .1314334
       _cons |  -.1612133   .1209524    -1.33   0.191    -.4070182    .0845917
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
 component_id |       108           0         108     |
 birth_cohort |        18           1          17     |
------------------------------------------------------+

. reghdfe manager_skill i.founder##c.ln_n `controls', a(`FEs') cluster(first_year )
(dropped 1 singleton observations)
(MWFE estimator converged in 4 iterations)

HDFE Linear regression                            Number of obs   =    166,070
Absorbing 2 HDFE groups                           F(   4,     36) =      26.67
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.0019
                                                  Adj R-squared   =     0.0011
                                                  Within R-sq.    =     0.0008
Number of clusters (first_year) =         37      Root MSE        =     2.6491

                              (Std. err. adjusted for 37 clusters in first_year)
--------------------------------------------------------------------------------
               |               Robust
 manager_skill | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
---------------+----------------------------------------------------------------
     1.founder |  -.4436155   .1931028    -2.30   0.028    -.8352461    -.051985
          ln_n |  -.0446891    .025699    -1.74   0.091    -.0968091    .0074309
               |
founder#c.ln_n |
            1  |   .0452777   .0259291     1.75   0.089    -.0073091    .0978644
               |
          male |   .1190811   .0154275     7.72   0.000     .0877927    .1503695
         _cons |   .2908382   .1866907     1.56   0.128     -.087788    .6694645
--------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
 component_id |       108           0         108     |
 birth_cohort |        19           1          18     |
------------------------------------------------------+

. 
end of do-file

. tab birth_year 

 birth_year |      Freq.     Percent        Cum.
------------+-----------------------------------
       1915 |          1        0.00        0.00
       1918 |          2        0.00        0.00
       1919 |          1        0.00        0.00
       1920 |          2        0.00        0.00
       1921 |          4        0.00        0.01
       1922 |         10        0.01        0.01
       1923 |         14        0.01        0.02
       1924 |          6        0.00        0.02
       1925 |         17        0.01        0.03
       1926 |         29        0.02        0.04
       1927 |         46        0.02        0.07
       1928 |         44        0.02        0.09
       1929 |         61        0.03        0.12
       1930 |         96        0.05        0.17
       1931 |        107        0.06        0.23
       1932 |        120        0.06        0.29
       1933 |        137        0.07        0.36
       1934 |        148        0.08        0.44
       1935 |        200        0.10        0.54
       1936 |        240        0.12        0.67
       1937 |        275        0.14        0.81
       1938 |        324        0.17        0.98
       1939 |        425        0.22        1.20
       1940 |        554        0.29        1.49
       1941 |        650        0.34        1.83
       1942 |      1,172        0.61        2.44
       1943 |        937        0.49        2.93
       1944 |      1,258        0.65        3.58
       1945 |      1,140        0.59        4.18
       1946 |      1,497        0.78        4.95
       1947 |      1,725        0.90        5.85
       1948 |      1,873        0.98        6.83
       1949 |      1,951        1.02        7.84
       1950 |      2,181        1.14        8.98
       1951 |      2,700        1.41       10.39
       1952 |      3,936        2.05       12.43
       1953 |      5,379        2.80       15.23
       1954 |      6,550        3.41       18.64
       1955 |      5,703        2.97       21.61
       1956 |      5,479        2.85       24.47
       1957 |      4,913        2.56       27.02
       1958 |      5,022        2.61       29.64
       1959 |      5,259        2.74       32.38
       1960 |      5,055        2.63       35.01
       1961 |      4,469        2.33       37.34
       1962 |      4,782        2.49       39.83
       1963 |      4,705        2.45       42.28
       1964 |      4,823        2.51       44.79
       1965 |      4,806        2.50       47.29
       1966 |      5,375        2.80       50.09
       1967 |      5,736        2.99       53.07
       1968 |      5,918        3.08       56.15
       1969 |      5,826        3.03       59.19
       1970 |      5,856        3.05       62.24
       1971 |      5,507        2.87       65.10
       1972 |      4,788        2.49       67.60
       1973 |      4,829        2.51       70.11
       1974 |      5,516        2.87       72.98
       1975 |      5,772        3.01       75.99
       1976 |      5,314        2.77       78.75
       1977 |      4,879        2.54       81.29
       1978 |      4,296        2.24       83.53
       1979 |      3,850        2.00       85.54
       1980 |      3,433        1.79       87.32
       1981 |      3,125        1.63       88.95
       1982 |      2,648        1.38       90.33
       1983 |      2,312        1.20       91.53
       1984 |      2,091        1.09       92.62
       1985 |      2,044        1.06       93.68
       1986 |      1,761        0.92       94.60
       1987 |      1,546        0.80       95.41
       1988 |      1,359        0.71       96.11
       1989 |      1,214        0.63       96.75
       1990 |      1,117        0.58       97.33
       1991 |      1,011        0.53       97.85
       1992 |        859        0.45       98.30
       1993 |        679        0.35       98.65
       1994 |        593        0.31       98.96
       1995 |        478        0.25       99.21
       1996 |        368        0.19       99.40
       1997 |        347        0.18       99.58
       1998 |        254        0.13       99.72
       1999 |        163        0.08       99.80
       2000 |        184        0.10       99.90
       2001 |        100        0.05       99.95
       2002 |         58        0.03       99.98
       2003 |         32        0.02      100.00
       2004 |          2        0.00      100.00
       2007 |          1        0.00      100.00
       2008 |          1        0.00      100.00
       2009 |          2        0.00      100.00
       2015 |          1        0.00      100.00
------------+-----------------------------------
      Total |    192,073      100.00

. do "code/estimate/cohort.do"

. use "temp/unfiltered.dta", clear

. merge m:1 frame_id_numeric person_id using "temp/manager_value.dta", keep(match) nogen

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                        10,224,519  
    -----------------------------------------

. 
. * for babyboom, we measure manager skills in revenue units, not as TFP
. replace manager_skill = manager_skill / chi
(8,688,171 real changes made)

. keep if component_id > 0
(7,505,526 observations deleted)

. generate byte hungarian_name = !missing(male)

. 
. keep if hungarian_name
(127,259 observations deleted)

. 
. collapse (mean) manager_skill (min) birth_year first_year = year (max) male last_year = year (min) component_
> id (max) component_size, by(person_id founder)

. reshape wide manager_skill first_year last_year birth_year male, i(person_id) j(founder)
(j = 0 1)

Data                               Long   ->   Wide
-----------------------------------------------------------------------------
Number of observations          254,875   ->   192,073     
Number of variables                   9   ->   13          
j variable (2 values)           founder   ->   (dropped)
xij variables:
                          manager_skill   ->   manager_skill0 manager_skill1
                             first_year   ->   first_year0 first_year1
                              last_year   ->   last_year0 last_year1
                             birth_year   ->   birth_year0 birth_year1
                                   male   ->   male0 male1
-----------------------------------------------------------------------------

. 
. * relatively few overlap, use the first ceo spell
. egen first_year = rowmin(first_year?)

. egen last_year = rowmax(last_year?)

. egen manager_skill = rowmean(manager_skill?)
(26,002 missing values generated)

. egen birth_year = rowmin(birth_year?)

. egen male = rowmax(male?)

. 
. generate byte founder = first_year0 > first_year

. tabulate first_year founder

           |        founder
first_year |         0          1 |     Total
-----------+----------------------+----------
      1986 |       379          0 |       379 
      1987 |        76          0 |        76 
      1988 |        97         14 |       111 
      1989 |       454        484 |       938 
      1990 |     1,139      1,933 |     3,072 
      1991 |     1,397      3,363 |     4,760 
      1992 |     2,168      9,746 |    11,914 
      1993 |     1,836      5,234 |     7,070 
      1994 |     1,897      5,375 |     7,272 
      1995 |     1,827      4,514 |     6,341 
      1996 |     2,133      4,813 |     6,946 
      1997 |     2,402      5,133 |     7,535 
      1998 |     2,484      5,263 |     7,747 
      1999 |     2,421      3,523 |     5,944 
      2000 |     3,222      4,470 |     7,692 
      2001 |     2,728      4,322 |     7,050 
      2002 |     2,726      3,992 |     6,718 
      2003 |     2,732      3,509 |     6,241 
      2004 |     3,006      3,771 |     6,777 
      2005 |     3,136      3,019 |     6,155 
      2006 |     3,101      3,059 |     6,160 
      2007 |     2,837      2,581 |     5,418 
      2008 |     3,397      3,251 |     6,648 
      2009 |     3,002      3,190 |     6,192 
      2010 |     3,048      2,925 |     5,973 
      2011 |     3,029      2,736 |     5,765 
      2012 |     3,455      2,713 |     6,168 
      2013 |     4,565      2,511 |     7,076 
      2014 |     3,073      1,510 |     4,583 
      2015 |     2,954      1,040 |     3,994 
      2016 |     3,180        997 |     4,177 
      2017 |     3,101        949 |     4,050 
      2018 |     2,635        767 |     3,402 
      2019 |     2,466        612 |     3,078 
      2020 |     2,925        514 |     3,439 
      2021 |     2,296        466 |     2,762 
      2022 |     2,121        329 |     2,450 
-----------+----------------------+----------
     Total |    89,445    102,628 |   192,073 

. 
. generate cohort = int(first_year/5)*5

. tabulate cohort founder

           |        founder
    cohort |         0          1 |     Total
-----------+----------------------+----------
      1985 |     1,006        498 |     1,504 
      1990 |     8,437     25,651 |    34,088 
      1995 |    11,267     23,246 |    34,513 
      2000 |    14,414     20,064 |    34,478 
      2005 |    15,473     15,100 |    30,573 
      2010 |    17,170     12,395 |    29,565 
      2015 |    14,336      4,365 |    18,701 
      2020 |     7,342      1,309 |     8,651 
-----------+----------------------+----------
     Total |    89,445    102,628 |   192,073 

. 
. generate birth_cohort = int(birth_year/5)*5

. 
. egen n = count(person_id), by(first_year founder male)

. generate ln_n = ln(n)

. 
. local controls male

. local FEs component_id birth_cohort

. local sample birth_year <= 2000

. 
. * different components may have different means
. reghdfe manager_skill ib1985.cohort `controls' if founder & `sample', a(`FEs') cluster(first_year )
(MWFE estimator converged in 4 iterations)

HDFE Linear regression                            Number of obs   =     91,979
Absorbing 2 HDFE groups                           F(   8,     34) =       5.73
Statistics robust to heteroskedasticity           Prob > F        =     0.0001
                                                  R-squared       =     0.0011
                                                  Adj R-squared   =    -0.0003
                                                  Within R-sq.    =     0.0003
Number of clusters (first_year) =         35      Root MSE        =     2.5982

                            (Std. err. adjusted for 35 clusters in first_year)
------------------------------------------------------------------------------
             |               Robust
manager_sk~l | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      cohort |
       1990  |   -.036576   .0485224    -0.75   0.456    -.1351854    .0620334
       1995  |  -.0345076   .0516172    -0.67   0.508    -.1394063     .070391
       2000  |   -.009623   .0521701    -0.18   0.855    -.1156454    .0963993
       2005  |  -.0260649   .0537531    -0.48   0.631    -.1353044    .0831746
       2010  |  -.0233992   .0535243    -0.44   0.665    -.1321737    .0853754
       2015  |   .0066015   .0615117     0.11   0.915    -.1184054    .1316084
       2020  |   .0124835    .087588     0.14   0.888    -.1655167    .1904838
             |
        male |   .0954398   .0164037     5.82   0.000     .0621034    .1287762
       _cons |   -.112771   .0524435    -2.15   0.039     -.219349   -.0061931
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
 component_id |       108           0         108     |
 birth_cohort |        18           1          17     |
------------------------------------------------------+

. reghdfe manager_skill ib1985.cohort `controls' if !founder & `sample', a(`FEs') cluster(first_year )
(dropped 1 singleton observations)
(MWFE estimator converged in 4 iterations)

HDFE Linear regression                            Number of obs   =     73,962
Absorbing 2 HDFE groups                           F(   8,     36) =      34.96
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.0034
                                                  Adj R-squared   =     0.0017
                                                  Within R-sq.    =     0.0016
Number of clusters (first_year) =         37      Root MSE        =     2.7109

                            (Std. err. adjusted for 37 clusters in first_year)
------------------------------------------------------------------------------
             |               Robust
manager_sk~l | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      cohort |
       1990  |  -.1676895   .0462648    -3.62   0.001     -.261519   -.0738601
       1995  |  -.3249342   .0462866    -7.02   0.000    -.4188078   -.2310606
       2000  |  -.2269483   .0414495    -5.48   0.000    -.3110118   -.1428847
       2005  |  -.2124052   .0393334    -5.40   0.000    -.2921769   -.1326334
       2010  |  -.1646249   .0401414    -4.10   0.000    -.2460354   -.0832145
       2015  |  -.0868065     .04906    -1.77   0.085    -.1863048    .0126918
       2020  |   .0665597   .0496317     1.34   0.188     -.034098    .1672175
             |
        male |   .1473082   .0195493     7.54   0.000     .1076604     .186956
       _cons |   .1365327   .0380521     3.59   0.001     .0593595    .2137059
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
 component_id |       108           0         108     |
 birth_cohort |        17           1          16     |
------------------------------------------------------+

. 
. reghdfe manager_skill ln_n `controls' if !founder & `sample', a(`FEs') cluster(first_year )
(dropped 1 singleton observations)
(MWFE estimator converged in 4 iterations)

HDFE Linear regression                            Number of obs   =     73,962
Absorbing 2 HDFE groups                           F(   2,     36) =      23.51
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.0025
                                                  Adj R-squared   =     0.0009
                                                  Within R-sq.    =     0.0007
Number of clusters (first_year) =         37      Root MSE        =     2.7120

                            (Std. err. adjusted for 37 clusters in first_year)
------------------------------------------------------------------------------
             |               Robust
manager_sk~l | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        ln_n |  -.0756082   .0291234    -2.60   0.014    -.1346732   -.0165432
        male |    .155561   .0231304     6.73   0.000     .1086504    .2024717
       _cons |   .5002367   .2078108     2.41   0.021     .0787768    .9216966
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
 component_id |       108           0         108     |
 birth_cohort |        17           1          16     |
------------------------------------------------------+

. reghdfe manager_skill ln_n `controls' if founder & `sample', a(`FEs') cluster(first_year )
(MWFE estimator converged in 4 iterations)

HDFE Linear regression                            Number of obs   =     91,979
Absorbing 2 HDFE groups                           F(   2,     34) =      16.48
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.0011
                                                  Adj R-squared   =    -0.0003
                                                  Within R-sq.    =     0.0003
Number of clusters (first_year) =         35      Root MSE        =     2.5982

                            (Std. err. adjusted for 35 clusters in first_year)
------------------------------------------------------------------------------
             |               Robust
manager_sk~l | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        ln_n |    .003473   .0168762     0.21   0.838    -.0308235    .0377695
        male |    .091051   .0197874     4.60   0.000     .0508381     .131264
       _cons |  -.1619616   .1207104    -1.34   0.189    -.4072746    .0833514
------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
 component_id |       108           0         108     |
 birth_cohort |        18           1          17     |
------------------------------------------------------+

. reghdfe manager_skill i.founder##c.ln_n `controls' if founder & `sample', a(`FEs') cluster(first_year )
(MWFE estimator converged in 4 iterations)
note: 1bn.founder is probably collinear with the fixed effects (all partialled-out values are close to zero; to
> l = 1.0e-09)
note: 1.founder#c.ln_n omitted because of collinearity

HDFE Linear regression                            Number of obs   =     91,979
Absorbing 2 HDFE groups                           F(   2,     34) =      16.48
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.0011
                                                  Adj R-squared   =    -0.0003
                                                  Within R-sq.    =     0.0003
Number of clusters (first_year) =         35      Root MSE        =     2.5982

                              (Std. err. adjusted for 35 clusters in first_year)
--------------------------------------------------------------------------------
               |               Robust
 manager_skill | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
---------------+----------------------------------------------------------------
     1.founder |          0  (omitted)
          ln_n |    .003473   .0168762     0.21   0.838    -.0308235    .0377695
               |
founder#c.ln_n |
            1  |          0  (omitted)
               |
          male |    .091051   .0197874     4.60   0.000     .0508381     .131264
         _cons |  -.1619616   .1207104    -1.34   0.189    -.4072746    .0833514
--------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
 component_id |       108           0         108     |
 birth_cohort |        18           1          17     |
------------------------------------------------------+

. 
end of do-file

. local sample birth_year <= 2000

. 
. reghdfe manager_skill i.founder##c.ln_n `controls' if `sample', a(`FEs') cluster(first_year )
variable hungarian_name not found
r(111);

. 
. reghdfe manager_skill i.founder##c.ln_n male if `sample', a(`FEs') cluster(first_year )
(MWFE estimator converged in 4 iterations)

HDFE Linear regression                            Number of obs   =    165,942
Absorbing 2 HDFE groups                           F(   4,     36) =      26.63
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.0019
                                                  Adj R-squared   =     0.0011
                                                  Within R-sq.    =     0.0008
Number of clusters (first_year) =         37      Root MSE        =     2.6490

                              (Std. err. adjusted for 37 clusters in first_year)
--------------------------------------------------------------------------------
               |               Robust
 manager_skill | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
---------------+----------------------------------------------------------------
     1.founder |  -.4516487   .1940474    -2.33   0.026    -.8451951   -.0581023
          ln_n |  -.0451176   .0257696    -1.75   0.088    -.0973807    .0071455
               |
founder#c.ln_n |
            1  |   .0463408   .0260443     1.78   0.084    -.0064796    .0991611
               |
          male |   .1184583   .0153438     7.72   0.000     .0873397    .1495769
         _cons |   .2945002   .1874255     1.57   0.125    -.0856163    .6746167
--------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
 component_id |       108           0         108     |
 birth_cohort |        18           1          17     |
------------------------------------------------------+

. reghdfe manager_skill i.founder##c.ln_n i.founder##i.male  if `sample', a(`FEs') cluster(first_year )
(MWFE estimator converged in 4 iterations)

HDFE Linear regression                            Number of obs   =    165,942
Absorbing 2 HDFE groups                           F(   5,     36) =      23.16
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.0019
                                                  Adj R-squared   =     0.0012
                                                  Within R-sq.    =     0.0009
Number of clusters (first_year) =         37      Root MSE        =     2.6490

                              (Std. err. adjusted for 37 clusters in first_year)
--------------------------------------------------------------------------------
               |               Robust
 manager_skill | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
---------------+----------------------------------------------------------------
     1.founder |  -.6447261   .1925551    -3.35   0.002    -1.035246   -.2542061
          ln_n |  -.0615462   .0255983    -2.40   0.021     -.113462   -.0096304
               |
founder#c.ln_n |
            1  |   .0785904   .0271813     2.89   0.006     .0234641    .1337167
               |
        1.male |   .1525292    .022527     6.77   0.000     .1068424     .198216
               |
  founder#male |
          1 1  |  -.0719268   .0313324    -2.30   0.028    -.1354718   -.0083818
               |
         _cons |   .3925211   .1835122     2.14   0.039     .0203411    .7647011
--------------------------------------------------------------------------------

Absorbed degrees of freedom:
------------------------------------------------------+
  Absorbed FE | Categories  - Redundant  = Num. Coefs |
--------------+---------------------------------------|
 component_id |       108           0         108     |
 birth_cohort |        18           1          17     |
------------------------------------------------------+

. note: 1/theta is between 0.07 and 0.02, so theta is between 14 and 50

. log close
      name:  <unnamed>
       log:  /Users/koren/Downloads/ceo-value.log
  log type:  text
 closed on:  25 Sep 2025, 19:51:24
---------------------------------------------------------------------------------------------------------------
