
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: Single-user 2-core  perpetual
Serial number: 501806323834
  Licensed to: Miklos Koren
               CEU MicroData

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do code/estimate/cohort.do 

. use "temp/unfiltered.dta", clear

. merge m:1 frame_id_numeric person_id using "temp/manager_value.dta", keep(mat
> ch) nogen

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                        10,224,519  
    -----------------------------------------

. 
. * for babyboom, we measure manager skills in revenue units, not as TFP
. replace manager_skill = manager_skill / chi
(5,740,906 real changes made)

. * only deal with hungarian CEOs
. generate byte hungarian_name = !missing(male)

. keep if hungarian_name
(705,932 observations deleted)

. 
. keep if !missing(sales)
(0 observations deleted)

. egen N_jobs = total(1), by(person_id year)

. tabulate N_jobs

     N_jobs |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |  7,208,807       75.73       75.73
          2 |  1,544,036       16.22       91.96
          3 |    435,186        4.57       96.53
          4 |    150,216        1.58       98.11
          5 |     67,815        0.71       98.82
          6 |     36,606        0.38       99.20
          7 |     21,693        0.23       99.43
          8 |     13,168        0.14       99.57
          9 |      9,333        0.10       99.67
         10 |      6,340        0.07       99.73
         11 |      4,807        0.05       99.78
         12 |      3,228        0.03       99.82
         13 |      2,431        0.03       99.84
         14 |      2,016        0.02       99.86
         15 |      1,755        0.02       99.88
         16 |      1,392        0.01       99.90
         17 |        952        0.01       99.91
         18 |        792        0.01       99.92
         19 |        513        0.01       99.92
         20 |        780        0.01       99.93
         21 |        483        0.01       99.93
         22 |        286        0.00       99.94
         23 |        230        0.00       99.94
         24 |        240        0.00       99.94
         25 |        250        0.00       99.95
         26 |        208        0.00       99.95
         27 |        243        0.00       99.95
         28 |        168        0.00       99.95
         29 |        261        0.00       99.95
         30 |        120        0.00       99.96
         31 |         93        0.00       99.96
         32 |        128        0.00       99.96
         33 |         66        0.00       99.96
         34 |         68        0.00       99.96
         35 |        245        0.00       99.96
         36 |        108        0.00       99.96
         37 |         74        0.00       99.96
         38 |        266        0.00       99.97
         39 |        117        0.00       99.97
         41 |         82        0.00       99.97
         42 |        126        0.00       99.97
         43 |         43        0.00       99.97
         44 |         44        0.00       99.97
         46 |        138        0.00       99.97
         47 |         47        0.00       99.97
         48 |         48        0.00       99.97
         50 |        150        0.00       99.97
         52 |         52        0.00       99.98
         53 |         53        0.00       99.98
         54 |         54        0.00       99.98
         55 |        220        0.00       99.98
         56 |         56        0.00       99.98
         57 |         57        0.00       99.98
         62 |         62        0.00       99.98
         64 |         64        0.00       99.98
         67 |         67        0.00       99.98
         68 |         68        0.00       99.98
         73 |        219        0.00       99.99
         75 |         75        0.00       99.99
         77 |         77        0.00       99.99
         78 |         78        0.00       99.99
         80 |         80        0.00       99.99
         81 |        162        0.00       99.99
         85 |         85        0.00       99.99
         90 |         90        0.00       99.99
         92 |         92        0.00       99.99
         94 |         94        0.00       99.99
        101 |        101        0.00       99.99
        102 |        102        0.00      100.00
        118 |        118        0.00      100.00
        124 |        124        0.00      100.00
        139 |        139        0.00      100.00
------------+-----------------------------------
      Total |  9,518,587      100.00

. drop if N_jobs > 4
(180,342 observations deleted)

. * keep largest firm only if multiple jobs
. bysort person_id year (sales): keep if _n == _N
(1,174,804 observations deleted)

. tabulate N_jobs

     N_jobs |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |  7,208,807       88.31       88.31
          2 |    772,018        9.46       97.76
          3 |    145,062        1.78       99.54
          4 |     37,554        0.46      100.00
------------+-----------------------------------
      Total |  8,163,441      100.00

. drop N_jobs

. 
. egen first_year = min(year), by(person_id)

. tabulate first_year founder

           |    Founding owner
first_year |         0          1 |     Total
-----------+----------------------+----------
      1986 |    18,057      5,752 |    23,809 
      1987 |     2,574      1,806 |     4,380 
      1988 |     2,574      2,832 |     5,406 
      1989 |    11,974     25,057 |    37,031 
      1990 |    35,523     96,031 |   131,554 
      1991 |    46,390    169,789 |   216,179 
      1992 |    99,660    593,735 |   693,395 
      1993 |    67,701    353,734 |   421,435 
      1994 |    64,071    350,025 |   414,096 
      1995 |    59,467    289,962 |   349,429 
      1996 |    64,901    337,935 |   402,836 
      1997 |    74,737    353,419 |   428,156 
      1998 |    74,644    337,743 |   412,387 
      1999 |    65,407    238,648 |   304,055 
      2000 |    88,819    288,509 |   377,328 
      2001 |    71,062    285,666 |   356,728 
      2002 |    65,655    248,307 |   313,962 
      2003 |    63,732    210,901 |   274,633 
      2004 |    70,988    221,462 |   292,450 
      2005 |    64,277    169,884 |   234,161 
      2006 |    63,159    167,558 |   230,717 
      2007 |    64,184    151,335 |   215,519 
      2008 |    76,438    187,559 |   263,997 
      2009 |    64,686    167,199 |   231,885 
      2010 |    59,767    157,140 |   216,907 
      2011 |    56,602    142,567 |   199,169 
      2012 |    70,254    141,583 |   211,837 
      2013 |    99,824    124,493 |   224,317 
      2014 |    52,694     81,253 |   133,947 
      2015 |    46,378     52,701 |    99,079 
      2016 |    45,788     51,514 |    97,302 
      2017 |    40,473     45,186 |    85,659 
      2018 |    32,695     39,608 |    72,303 
      2019 |    26,174     33,506 |    59,680 
      2020 |    34,307     27,557 |    61,864 
      2021 |    16,218     27,766 |    43,984 
      2022 |     9,637     12,228 |    21,865 
-----------+----------------------+----------
     Total | 1,971,491  6,191,950 | 8,163,441 

. 
. * to calibrate alpha, we need to count founders
. generate cohort = int(first_year/5)*5

. tabulate cohort founder

           |    Founding owner
    cohort |         0          1 |     Total
-----------+----------------------+----------
      1985 |    35,179     35,447 |    70,626 
      1990 |   313,345  1,563,314 | 1,876,659 
      1995 |   339,156  1,557,707 | 1,896,863 
      2000 |   360,256  1,254,845 | 1,615,101 
      2005 |   332,744    843,535 | 1,176,279 
      2010 |   339,141    647,036 |   986,177 
      2015 |   191,508    222,515 |   414,023 
      2020 |    60,162     67,551 |   127,713 
-----------+----------------------+----------
     Total | 1,971,491  6,191,950 | 8,163,441 

. * export a nice latex table for the paper
. preserve

. collapse (count) count = person_id, by(cohort founder)

. reshape wide count, i(cohort) j(founder)
(j = 0 1)

Data                               Long   ->   Wide
-----------------------------------------------------------------------------
Number of observations               16   ->   8           
Number of variables                   3   ->   3           
j variable (2 values)           founder   ->   (dropped)
xij variables:
                                  count   ->   count0 count1
-----------------------------------------------------------------------------

. egen total = rowtotal(count0 count1)

. replace count0 = . if missing(count0)
(0 real changes made)

. replace count1 = . if missing(count1)
(0 real changes made)

. 
. * Create LaTeX table manually
. file open fh using "output/table/cohort_founders.tex", write replace
(file output/table/cohort_founders.tex not found)

. file write fh "\begin{table}[htbp]\centering" _n

. file write fh "\caption{Manager Cohort Entry and Founder Status}\label{tab:co
> hort_founders}" _n

. file write fh "\begin{threeparttable}" _n

. file write fh "\begin{tabular}{lccc}" _n

. file write fh "\toprule" _n

. file write fh "Cohort & Non-Founder & Founder & Total \\" _n

. file write fh "\midrule" _n

. 
. foreach c of numlist 1985 1990 1995 2000 2005 2010 2015 2020 {
  2.     quietly summarize count0 if cohort == `c'
  3.     local nonfound = r(mean)
  4.     quietly summarize count1 if cohort == `c'  
  5.     local found = r(mean)
  6.     quietly summarize total if cohort == `c'
  7.     local tot = r(mean)
  8.     if !missing(`nonfound') & !missing(`found') {
  9.         file write fh "`c' & " %12.0fc (`nonfound') " & " %12.0fc (`found'
> ) " & " %12.0fc (`tot') " \\" _n
 10.     }
 11. }

. 
. * Add total row
. quietly summarize count0

. local nonfound_tot = r(sum)

. quietly summarize count1

. local found_tot = r(sum)

. quietly summarize total

. local grand_tot = r(sum)

. file write fh "\midrule" _n

. file write fh "Total & " %12.0fc (`nonfound_tot') " & " %12.0fc (`found_tot')
>  " & " %12.0fc (`grand_tot') " \\" _n

. 
. file write fh "\bottomrule" _n

. file write fh "\end{tabular}" _n

. file write fh "\begin{tablenotes}" _n

. file write fh "\footnotesize" _n

. file write fh "\item \textbf{Notes:} This table reports the number of manager
> s entering each cohort by founder status. Cohorts are defined by the first ye
> ar a manager appears in the data, grouped in 5-year bins. Founders are define
> d as CEOs who are also founders of the firm they manage. The sample is restri
> cted to Hungarian managers with non-missing revenue data and at most 4 simult
> aneous positions. Data source: Hungarian Manager Database (CEU MicroData) mer
> ged with firm financial statements, 1986-2022." _n

. file write fh "\end{tablenotes}" _n

. file write fh "\end{threeparttable}" _n

. file write fh "\end{table}" _n

. file close fh

. 
. restore

. 
. generate birth_cohort = int(birth_year/5)*5

. 
. egen skill_group = group(birth_cohort male)

. egen tag = tag(person_id first_year skill_group)

. egen n = total(tag), by(first_year skill_group)

. * 1986 is the first measured year, captures the entire 1980s
. replace n = n / 7 if first_year == 1986
(23,809 real changes made)

. generate ln_n = ln(n)

. 
. local controls male ceo_age ceo_age_sq founder firm_age firm_age_sq

. local FEs teaor08_2d##year

. local sample inrange(ceo_age, 18, 75) & year >= 1992

. 
. * to calibrate phi, report EBTA/sales ratios by founder status
. generate double ebitda_sales = EBITDA / sales
(951,661 missing values generated)

. replace ebitda_sales = . if ebitda_sales < 0 | ebitda_sales > 1
(1,791,512 real changes made, 1,791,512 to missing)

. summarize ebitda_sales if `sample' & founder, detail

                        ebitda_sales
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0032782              0
 5%      .015043              0
10%     .0271919              0       Obs           4,118,707
25%     .0643698              0       Sum of wgt.   4,118,707

50%     .1584473                      Mean            .248042
                        Largest       Std. dev.      .2440098
75%      .355101              1
90%     .6319846              1       Variance       .0595408
95%     .8023292              1       Skewness       1.339244
99%     .9887133              1       Kurtosis       4.030994

. display "Mean EBITDA/Sales, Founders: " %6.4f r(mean)
Mean EBITDA/Sales, Founders: 0.2480

. display "Median EBITDA/Sales, Founders: " %6.4f r(p50)
Median EBITDA/Sales, Founders: 0.1584

. summarize ebitda_sales [aw=sales] if `sample' & founder

    Variable |     Obs      Weight        Mean   Std. dev.       Min        Max
-------------+-----------------------------------------------------------------
ebitda_sales | 4118707  3.3320e+11    .1242832   .1434126          0          1

. display "Weighted Mean EBITDA/Sales, Founders: " %6.4f r(mean)
Weighted Mean EBITDA/Sales, Founders: 0.1243

. summarize ebitda_sales if `sample' & !founder, detail

                        ebitda_sales
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0027563              0
 5%     .0129802              0
10%     .0238921              0       Obs           1,205,612
25%     .0566256              0       Sum of wgt.   1,205,612

50%     .1381393                      Mean           .2342439
                        Largest       Std. dev.      .2464476
75%     .3231283              1
90%     .6277829              1       Variance       .0607364
95%     .8199357              1       Skewness       1.484457
99%     .9913244              1       Kurtosis        4.41189

. display "Mean EBITDA/Sales, Non-Founders: " %6.4f r(mean)
Mean EBITDA/Sales, Non-Founders: 0.2342

. display "Median EBITDA/Sales, Non-Founders: " %6.4f r(p50)
Median EBITDA/Sales, Non-Founders: 0.1381

. summarize ebitda_sales [aw=sales] if `sample' & !founder

    Variable |     Obs      Weight        Mean   Std. dev.       Min        Max
-------------+-----------------------------------------------------------------
ebitda_sales | 1205612  3.5069e+11    .1157356   .1588289          0          1

. display "Weighted Mean EBITDA/Sales, Non-Founders: " %6.4f r(mean)
Weighted Mean EBITDA/Sales, Non-Founders: 0.1157

. 
. generate ln_EBITDA_share = ln(ebitda_sales)
(2,751,009 missing values generated)

. 
. reghdfe ln_EBITDA_share `controls' if `sample', a(`FEs') cluster(frame_id_num
> eric)
(dropped 82 singleton observations)
(MWFE estimator converged in 1 iterations)
