
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      18.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2023 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: Single-user 2-core  perpetual
Serial number: 501806323834
  Licensed to: Miklos Koren
               CEU MicroData

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000 but can be increased;
          see help set_maxvar.

. do code/estimate/cohort.do 

. use "temp/unfiltered.dta", clear

. merge m:1 frame_id_numeric person_id using "temp/manager_value.dta", keep(mat
> ch) nogen

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                        10,224,519  
    -----------------------------------------

. 
. * for babyboom, we measure manager skills in revenue units, not as TFP
. replace manager_skill = manager_skill / chi
(5,740,906 real changes made)

. * only deal with hungarian CEOs
. generate byte hungarian_name = !missing(male)

. keep if hungarian_name
(705,932 observations deleted)

. 
. keep if !missing(sales)
(0 observations deleted)

. egen N_jobs = total(1), by(person_id year)

. tabulate N_jobs

     N_jobs |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |  7,208,807       75.73       75.73
          2 |  1,544,036       16.22       91.96
          3 |    435,186        4.57       96.53
          4 |    150,216        1.58       98.11
          5 |     67,815        0.71       98.82
          6 |     36,606        0.38       99.20
          7 |     21,693        0.23       99.43
          8 |     13,168        0.14       99.57
          9 |      9,333        0.10       99.67
         10 |      6,340        0.07       99.73
         11 |      4,807        0.05       99.78
         12 |      3,228        0.03       99.82
         13 |      2,431        0.03       99.84
         14 |      2,016        0.02       99.86
         15 |      1,755        0.02       99.88
         16 |      1,392        0.01       99.90
         17 |        952        0.01       99.91
         18 |        792        0.01       99.92
         19 |        513        0.01       99.92
         20 |        780        0.01       99.93
         21 |        483        0.01       99.93
         22 |        286        0.00       99.94
         23 |        230        0.00       99.94
         24 |        240        0.00       99.94
         25 |        250        0.00       99.95
         26 |        208        0.00       99.95
         27 |        243        0.00       99.95
         28 |        168        0.00       99.95
         29 |        261        0.00       99.95
         30 |        120        0.00       99.96
         31 |         93        0.00       99.96
         32 |        128        0.00       99.96
         33 |         66        0.00       99.96
         34 |         68        0.00       99.96
         35 |        245        0.00       99.96
         36 |        108        0.00       99.96
         37 |         74        0.00       99.96
         38 |        266        0.00       99.97
         39 |        117        0.00       99.97
         41 |         82        0.00       99.97
         42 |        126        0.00       99.97
         43 |         43        0.00       99.97
         44 |         44        0.00       99.97
         46 |        138        0.00       99.97
         47 |         47        0.00       99.97
         48 |         48        0.00       99.97
         50 |        150        0.00       99.97
         52 |         52        0.00       99.98
         53 |         53        0.00       99.98
         54 |         54        0.00       99.98
         55 |        220        0.00       99.98
         56 |         56        0.00       99.98
         57 |         57        0.00       99.98
         62 |         62        0.00       99.98
         64 |         64        0.00       99.98
         67 |         67        0.00       99.98
         68 |         68        0.00       99.98
         73 |        219        0.00       99.99
         75 |         75        0.00       99.99
         77 |         77        0.00       99.99
         78 |         78        0.00       99.99
         80 |         80        0.00       99.99
         81 |        162        0.00       99.99
         85 |         85        0.00       99.99
         90 |         90        0.00       99.99
         92 |         92        0.00       99.99
         94 |         94        0.00       99.99
        101 |        101        0.00       99.99
        102 |        102        0.00      100.00
        118 |        118        0.00      100.00
        124 |        124        0.00      100.00
        139 |        139        0.00      100.00
------------+-----------------------------------
      Total |  9,518,587      100.00

. drop if N_jobs > 4
(180,342 observations deleted)

. * keep largest firm only if multiple jobs
. bysort person_id year (sales): keep if _n == _N
(1,174,804 observations deleted)

. tabulate N_jobs

     N_jobs |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |  7,208,807       88.31       88.31
          2 |    772,018        9.46       97.76
          3 |    145,062        1.78       99.54
          4 |     37,554        0.46      100.00
------------+-----------------------------------
      Total |  8,163,441      100.00

. drop N_jobs

. 
. egen first_year = min(year), by(person_id)

. tabulate first_year founder

           |    Founding owner
first_year |         0          1 |     Total
-----------+----------------------+----------
      1986 |    18,057      5,752 |    23,809 
      1987 |     2,574      1,806 |     4,380 
      1988 |     2,574      2,832 |     5,406 
      1989 |    11,974     25,057 |    37,031 
      1990 |    35,523     96,031 |   131,554 
      1991 |    46,390    169,789 |   216,179 
      1992 |    99,660    593,735 |   693,395 
      1993 |    67,701    353,734 |   421,435 
      1994 |    64,071    350,025 |   414,096 
      1995 |    59,467    289,962 |   349,429 
      1996 |    64,901    337,935 |   402,836 
      1997 |    74,737    353,419 |   428,156 
      1998 |    74,644    337,743 |   412,387 
      1999 |    65,407    238,648 |   304,055 
      2000 |    88,819    288,509 |   377,328 
      2001 |    71,062    285,666 |   356,728 
      2002 |    65,655    248,307 |   313,962 
      2003 |    63,732    210,901 |   274,633 
      2004 |    70,988    221,462 |   292,450 
      2005 |    64,277    169,884 |   234,161 
      2006 |    63,159    167,558 |   230,717 
      2007 |    64,184    151,335 |   215,519 
      2008 |    76,438    187,559 |   263,997 
      2009 |    64,686    167,199 |   231,885 
      2010 |    59,767    157,140 |   216,907 
      2011 |    56,602    142,567 |   199,169 
      2012 |    70,254    141,583 |   211,837 
      2013 |    99,824    124,493 |   224,317 
      2014 |    52,694     81,253 |   133,947 
      2015 |    46,378     52,701 |    99,079 
      2016 |    45,788     51,514 |    97,302 
      2017 |    40,473     45,186 |    85,659 
      2018 |    32,695     39,608 |    72,303 
      2019 |    26,174     33,506 |    59,680 
      2020 |    34,307     27,557 |    61,864 
      2021 |    16,218     27,766 |    43,984 
      2022 |     9,637     12,228 |    21,865 
-----------+----------------------+----------
     Total | 1,971,491  6,191,950 | 8,163,441 

. 
. generate cohort = int(first_year/5)*5

. tabulate cohort founder

           |    Founding owner
    cohort |         0          1 |     Total
-----------+----------------------+----------
      1985 |    35,179     35,447 |    70,626 
      1990 |   313,345  1,563,314 | 1,876,659 
      1995 |   339,156  1,557,707 | 1,896,863 
      2000 |   360,256  1,254,845 | 1,615,101 
      2005 |   332,744    843,535 | 1,176,279 
      2010 |   339,141    647,036 |   986,177 
      2015 |   191,508    222,515 |   414,023 
      2020 |    60,162     67,551 |   127,713 
-----------+----------------------+----------
     Total | 1,971,491  6,191,950 | 8,163,441 

. 
. generate birth_cohort = int(birth_year/5)*5

. 
. egen skill_group = group(birth_cohort male)

. egen tag = tag(person_id first_year skill_group)

. egen n = total(tag), by(first_year skill_group)

. * 1986 is the first measured year, captures the entire 1980s
. replace n = n / 7 if first_year == 1986
(23,809 real changes made)

. generate ln_n = ln(n)

. 
. local controls male ceo_age ceo_age_sq founder firm_age firm_age_sq

. local FEs teaor08_2d##year

. local sample inrange(ceo_age, 18, 75) & year >= 1992

. 
. * to calibrate alpha, we need to count founders
. tabulate founder if `sample'

   Founding |
      owner |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  1,909,405       23.81       23.81
          1 |  6,110,719       76.19      100.00
------------+-----------------------------------
      Total |  8,020,124      100.00

. tabulate year founder if `sample', row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |    Founding owner
      Year |         0          1 |     Total
-----------+----------------------+----------
      1992 |    14,665     64,613 |    79,278 
           |     18.50      81.50 |    100.00 
-----------+----------------------+----------
      1993 |    16,726     82,834 |    99,560 
           |     16.80      83.20 |    100.00 
-----------+----------------------+----------
      1994 |    19,433    105,683 |   125,116 
           |     15.53      84.47 |    100.00 
-----------+----------------------+----------
      1995 |    21,573    118,386 |   139,959 
           |     15.41      84.59 |    100.00 
-----------+----------------------+----------
      1996 |    24,518    134,235 |   158,753 
           |     15.44      84.56 |    100.00 
-----------+----------------------+----------
      1997 |    27,949    148,916 |   176,865 
           |     15.80      84.20 |    100.00 
-----------+----------------------+----------
      1998 |    32,307    171,796 |   204,103 
           |     15.83      84.17 |    100.00 
-----------+----------------------+----------
      1999 |    35,163    178,334 |   213,497 
           |     16.47      83.53 |    100.00 
-----------+----------------------+----------
      2000 |    40,108    191,354 |   231,462 
           |     17.33      82.67 |    100.00 
-----------+----------------------+----------
      2001 |    44,001    207,560 |   251,561 
           |     17.49      82.51 |    100.00 
-----------+----------------------+----------
      2002 |    45,797    203,529 |   249,326 
           |     18.37      81.63 |    100.00 
-----------+----------------------+----------
      2003 |    47,805    203,653 |   251,458 
           |     19.01      80.99 |    100.00 
-----------+----------------------+----------
      2004 |    51,793    214,032 |   265,825 
           |     19.48      80.52 |    100.00 
-----------+----------------------+----------
      2005 |    55,113    216,099 |   271,212 
           |     20.32      79.68 |    100.00 
-----------+----------------------+----------
      2006 |    58,242    220,558 |   278,800 
           |     20.89      79.11 |    100.00 
-----------+----------------------+----------
      2007 |    61,327    221,509 |   282,836 
           |     21.68      78.32 |    100.00 
-----------+----------------------+----------
      2008 |    65,649    226,926 |   292,575 
           |     22.44      77.56 |    100.00 
-----------+----------------------+----------
      2009 |    68,296    230,514 |   298,810 
           |     22.86      77.14 |    100.00 
-----------+----------------------+----------
      2010 |    71,386    236,779 |   308,165 
           |     23.16      76.84 |    100.00 
-----------+----------------------+----------
      2011 |    74,328    241,747 |   316,075 
           |     23.52      76.48 |    100.00 
-----------+----------------------+----------
      2012 |    77,185    238,346 |   315,531 
           |     24.46      75.54 |    100.00 
-----------+----------------------+----------
      2013 |    87,823    246,763 |   334,586 
           |     26.25      73.75 |    100.00 
-----------+----------------------+----------
      2014 |    90,096    242,785 |   332,881 
           |     27.07      72.93 |    100.00 
-----------+----------------------+----------
      2015 |    92,766    237,446 |   330,212 
           |     28.09      71.91 |    100.00 
-----------+----------------------+----------
      2016 |    94,977    230,152 |   325,129 
           |     29.21      70.79 |    100.00 
-----------+----------------------+----------
      2017 |    95,593    221,467 |   317,060 
           |     30.15      69.85 |    100.00 
-----------+----------------------+----------
      2018 |    96,410    217,400 |   313,810 
           |     30.72      69.28 |    100.00 
-----------+----------------------+----------
      2019 |    96,401    213,390 |   309,791 
           |     31.12      68.88 |    100.00 
-----------+----------------------+----------
      2020 |    98,752    209,520 |   308,272 
           |     32.03      67.97 |    100.00 
-----------+----------------------+----------
      2021 |    99,921    213,338 |   313,259 
           |     31.90      68.10 |    100.00 
-----------+----------------------+----------
      2022 |   103,302    221,055 |   324,357 
           |     31.85      68.15 |    100.00 
-----------+----------------------+----------
     Total | 1,909,405  6,110,719 | 8,020,124 
           |     23.81      76.19 |    100.00 

. tabulate first_year founder if `sample', row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |    Founding owner
first_year |         0          1 |     Total
-----------+----------------------+----------
      1986 |     8,283      5,505 |    13,788 
           |     60.07      39.93 |    100.00 
-----------+----------------------+----------
      1987 |     1,236      1,728 |     2,964 
           |     41.70      58.30 |    100.00 
-----------+----------------------+----------
      1988 |     1,344      2,596 |     3,940 
           |     34.11      65.89 |    100.00 
-----------+----------------------+----------
      1989 |     8,188     20,460 |    28,648 
           |     28.58      71.42 |    100.00 
-----------+----------------------+----------
      1990 |    28,708     82,090 |   110,798 
           |     25.91      74.09 |    100.00 
-----------+----------------------+----------
      1991 |    41,370    155,159 |   196,529 
           |     21.05      78.95 |    100.00 
-----------+----------------------+----------
      1992 |    97,733    586,024 |   683,757 
           |     14.29      85.71 |    100.00 
-----------+----------------------+----------
      1993 |    66,796    349,603 |   416,399 
           |     16.04      83.96 |    100.00 
-----------+----------------------+----------
      1994 |    63,105    346,674 |   409,779 
           |     15.40      84.60 |    100.00 
-----------+----------------------+----------
      1995 |    58,688    287,126 |   345,814 
           |     16.97      83.03 |    100.00 
-----------+----------------------+----------
      1996 |    63,973    334,714 |   398,687 
           |     16.05      83.95 |    100.00 
-----------+----------------------+----------
      1997 |    73,713    350,195 |   423,908 
           |     17.39      82.61 |    100.00 
-----------+----------------------+----------
      1998 |    73,863    335,341 |   409,204 
           |     18.05      81.95 |    100.00 
-----------+----------------------+----------
      1999 |    64,755    237,187 |   301,942 
           |     21.45      78.55 |    100.00 
-----------+----------------------+----------
      2000 |    87,854    286,801 |   374,655 
           |     23.45      76.55 |    100.00 
-----------+----------------------+----------
      2001 |    70,358    284,282 |   354,640 
           |     19.84      80.16 |    100.00 
-----------+----------------------+----------
      2002 |    65,016    246,992 |   312,008 
           |     20.84      79.16 |    100.00 
-----------+----------------------+----------
      2003 |    63,079    209,908 |   272,987 
           |     23.11      76.89 |    100.00 
-----------+----------------------+----------
      2004 |    70,077    220,393 |   290,470 
           |     24.13      75.87 |    100.00 
-----------+----------------------+----------
      2005 |    63,517    168,965 |   232,482 
           |     27.32      72.68 |    100.00 
-----------+----------------------+----------
      2006 |    62,346    166,783 |   229,129 
           |     27.21      72.79 |    100.00 
-----------+----------------------+----------
      2007 |    63,213    150,434 |   213,647 
           |     29.59      70.41 |    100.00 
-----------+----------------------+----------
      2008 |    75,396    186,748 |   262,144 
           |     28.76      71.24 |    100.00 
-----------+----------------------+----------
      2009 |    63,799    166,229 |   230,028 
           |     27.74      72.26 |    100.00 
-----------+----------------------+----------
      2010 |    58,583    156,225 |   214,808 
           |     27.27      72.73 |    100.00 
-----------+----------------------+----------
      2011 |    55,472    141,721 |   197,193 
           |     28.13      71.87 |    100.00 
-----------+----------------------+----------
      2012 |    67,829    140,150 |   207,979 
           |     32.61      67.39 |    100.00 
-----------+----------------------+----------
      2013 |    96,310    123,083 |   219,393 
           |     43.90      56.10 |    100.00 
-----------+----------------------+----------
      2014 |    51,144     80,442 |   131,586 
           |     38.87      61.13 |    100.00 
-----------+----------------------+----------
      2015 |    45,106     52,118 |    97,224 
           |     46.39      53.61 |    100.00 
-----------+----------------------+----------
      2016 |    44,733     51,041 |    95,774 
           |     46.71      53.29 |    100.00 
-----------+----------------------+----------
      2017 |    39,491     44,735 |    84,226 
           |     46.89      53.11 |    100.00 
-----------+----------------------+----------
      2018 |    31,845     39,202 |    71,047 
           |     44.82      55.18 |    100.00 
-----------+----------------------+----------
      2019 |    25,473     33,214 |    58,687 
           |     43.40      56.60 |    100.00 
-----------+----------------------+----------
      2020 |    31,928     27,251 |    59,179 
           |     53.95      46.05 |    100.00 
-----------+----------------------+----------
      2021 |    15,725     27,558 |    43,283 
           |     36.33      63.67 |    100.00 
-----------+----------------------+----------
      2022 |     9,356     12,042 |    21,398 
           |     43.72      56.28 |    100.00 
-----------+----------------------+----------
     Total | 1,909,405  6,110,719 | 8,020,124 
           |     23.81      76.19 |    100.00 

. 
. * to calibrate phi, report EBTA/sales ratios by founder status
. generate double ebitda_sales = EBITDA / sales
(951,661 missing values generated)

. replace ebitda_sales = . if ebitda_sales < 0 | ebitda_sales > 1
(1,791,512 real changes made, 1,791,512 to missing)

. summarize ebitda_sales if `sample' & founder, detail

                        ebitda_sales
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0032782              0
 5%      .015043              0
10%     .0271919              0       Obs           4,118,707
25%     .0643698              0       Sum of wgt.   4,118,707

50%     .1584473                      Mean            .248042
                        Largest       Std. dev.      .2440098
75%      .355101              1
90%     .6319846              1       Variance       .0595408
95%     .8023292              1       Skewness       1.339244
99%     .9887133              1       Kurtosis       4.030994

. display "Mean EBITDA/Sales, Founders: " %6.4f r(mean)
Mean EBITDA/Sales, Founders: 0.2480

. display "Median EBITDA/Sales, Founders: " %6.4f r(p50)
Median EBITDA/Sales, Founders: 0.1584

. summarize ebitda_sales [aw=sales] if `sample' & founder

    Variable |     Obs      Weight        Mean   Std. dev.       Min        Max
-------------+-----------------------------------------------------------------
ebitda_sales | 4118707  3.3320e+11    .1242832   .1434126          0          1

. display "Weighted Mean EBITDA/Sales, Founders: " %6.4f r(mean)
Weighted Mean EBITDA/Sales, Founders: 0.1243

. summarize ebitda_sales if `sample' & !founder, detail

                        ebitda_sales
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .0027563              0
 5%     .0129802              0
10%     .0238921              0       Obs           1,205,612
25%     .0566256              0       Sum of wgt.   1,205,612

50%     .1381393                      Mean           .2342439
                        Largest       Std. dev.      .2464476
75%     .3231283              1
90%     .6277829              1       Variance       .0607364
95%     .8199357              1       Skewness       1.484457
99%     .9913244              1       Kurtosis        4.41189

. display "Mean EBITDA/Sales, Non-Founders: " %6.4f r(mean)
Mean EBITDA/Sales, Non-Founders: 0.2342

. display "Median EBITDA/Sales, Non-Founders: " %6.4f r(p50)
Median EBITDA/Sales, Non-Founders: 0.1381

. summarize ebitda_sales [aw=sales] if `sample' & !founder

    Variable |     Obs      Weight        Mean   Std. dev.       Min        Max
-------------+-----------------------------------------------------------------
ebitda_sales | 1205612  3.5069e+11    .1157356   .1588289          0          1

. display "Weighted Mean EBITDA/Sales, Non-Founders: " %6.4f r(mean)
Weighted Mean EBITDA/Sales, Non-Founders: 0.1157

. 
. * firm size goes down. entry goes up
. reghdfe lnR ib1985.cohort `controls' if `sample', a(`FEs') cluster(first_year
>  )
(dropped 88 singleton observations)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =  7,087,436
Absorbing 1 HDFE group                            F(  13,     36) =    1138.80
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.1781
                                                  Adj R-squared   =     0.1778
                                                  Within R-sq.    =     0.0471
Number of clusters (first_year) =         37      Root MSE        =     1.8857

                            (Std. err. adjusted for 37 clusters in first_year)
------------------------------------------------------------------------------
             |               Robust
         lnR | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      cohort |
       1990  |  -.7272364   .1227392    -5.93   0.000     -.976163   -.4783098
       1995  |  -1.037822    .078614   -13.20   0.000    -1.197258   -.8783849
       2000  |  -1.291226   .0838386   -15.40   0.000    -1.461259   -1.121194
       2005  |  -1.388941   .0939486   -14.78   0.000    -1.579477   -1.198404
       2010  |  -1.578991   .1028191   -15.36   0.000    -1.787518   -1.370464
       2015  |  -1.543029   .1051479   -14.67   0.000    -1.756279   -1.329779
       2020  |  -1.768004   .1365637   -12.95   0.000    -2.044968    -1.49104
             |
        male |   .3923908   .0188411    20.83   0.000     .3541794    .4306023
     ceo_age |   .0782316   .0040569    19.28   0.000     .0700039    .0864593
  ceo_age_sq |  -.0009271   .0000418   -22.19   0.000    -.0010118   -.0008424
     founder |  -.5406575    .027093   -19.96   0.000    -.5956046   -.4857104
    firm_age |   .0637018   .0059458    10.71   0.000     .0516432    .0757605
 firm_age_sq |  -.0028571   .0001772   -16.12   0.000    -.0032164   -.0024977
       _cons |   8.958274   .1671933    53.58   0.000      8.61919    9.297358
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------------+
       Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------------+---------------------------------------|
   teaor08_2d#year |      2487           0        2487     |
-----------------------------------------------------------+

. reghdfe ln_n ib1985.cohort `controls' if `sample', a(`FEs') cluster(first_yea
> r )
(dropped 86 singleton observations)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =  8,019,463
Absorbing 1 HDFE group                            F(  13,     36) =     149.55
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.3718
                                                  Adj R-squared   =     0.3716
                                                  Within R-sq.    =     0.3150
Number of clusters (first_year) =         37      Root MSE        =     0.8563

                            (Std. err. adjusted for 37 clusters in first_year)
------------------------------------------------------------------------------
             |               Robust
        ln_n | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      cohort |
       1990  |   3.199712   .7265148     4.40   0.000     1.726272    4.673153
       1995  |    2.99069   .6969315     4.29   0.000     1.577248    4.404133
       2000  |    2.99052   .6987996     4.28   0.000     1.573288    4.407751
       2005  |   2.843857   .7006706     4.06   0.000     1.422831    4.264883
       2010  |   2.853157   .7031165     4.06   0.000      1.42717    4.279143
       2015  |   2.303564   .7033758     3.28   0.002     .8770522    3.730077
       2020  |   2.439902    .704383     3.46   0.001     1.011347    3.868457
             |
        male |   .4403351   .0367555    11.98   0.000     .3657915    .5148788
     ceo_age |   .2428805   .0112047    21.68   0.000     .2201562    .2656047
  ceo_age_sq |  -.0027754   .0001132   -24.53   0.000    -.0030049   -.0025459
     founder |    .071401   .0177625     4.02   0.000      .035377     .107425
    firm_age |  -.0376942   .0041834    -9.01   0.000    -.0461786   -.0292099
 firm_age_sq |   .0023189   .0002343     9.90   0.000     .0018437    .0027942
       _cons |  -.4553136   .7893266    -0.58   0.568    -2.056142    1.145515
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------------+
       Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------------+---------------------------------------|
   teaor08_2d#year |      2498           0        2498     |
-----------------------------------------------------------+

. 
. * ===========================================================================
> ==
. * Store estimates and create table
. * ===========================================================================
> ==
. 
. * Store the key regression results
. estimates clear

. * ln_n captures degree of entry in cohort, its coefficient is -1/theta
. reghdfe lnR ln_n `controls' if `sample', a(`FEs') cluster(first_year )
(dropped 88 singleton observations)
(MWFE estimator converged in 1 iterations)

HDFE Linear regression                            Number of obs   =  7,087,436
Absorbing 1 HDFE group                            F(   7,     36) =     625.81
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.1722
                                                  Adj R-squared   =     0.1719
                                                  Within R-sq.    =     0.0403
Number of clusters (first_year) =         37      Root MSE        =     1.8924

                            (Std. err. adjusted for 37 clusters in first_year)
------------------------------------------------------------------------------
             |               Robust
         lnR | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
        ln_n |   -.137909   .0201679    -6.84   0.000    -.1788113   -.0970067
        male |    .523216   .0280251    18.67   0.000     .4663784    .5800536
     ceo_age |   .1209569   .0054837    22.06   0.000     .1098354    .1320783
  ceo_age_sq |  -.0013387    .000058   -23.08   0.000    -.0014564   -.0012211
     founder |  -.4150676   .0358092   -11.59   0.000     -.487692   -.3424433
    firm_age |   .0831855   .0052846    15.74   0.000     .0724678    .0939032
 firm_age_sq |  -.0026645   .0002156   -12.36   0.000    -.0031018   -.0022271
       _cons |   7.462916   .0995713    74.95   0.000     7.260976    7.664856
------------------------------------------------------------------------------

Absorbed degrees of freedom:
-----------------------------------------------------------+
       Absorbed FE | Categories  - Redundant  = Num. Coefs |
-------------------+---------------------------------------|
   teaor08_2d#year |      2487           0        2487     |
-----------------------------------------------------------+

. * if skill groups have difference baseline skills or different sizes (demogra
> phics), this can be taken out by fixed effects
. reghdfe lnR ln_n `controls' if `sample', a(`FEs' skill_group) cluster(first_y
> ear )
(dropped 89 singleton observations)
